import { cerealsImages } from "./cerealsImages";

const zitarice = [
  {
    id: 1,
    name: "Хељда",
    img: cerealsImages.buckwheat,
    inGeneralHeading: `Хранљива и Безглутенска Житарица`,
    inGeneral: `Хељда, научно позната као Fagopyrum esculentum, веома је хранљива псеудожитарица која се узгаја вековима. Упркос називу, хељда није повезана са пшеницом и природно је без глутена, што је чини популарним избором за људе са целијакијом или осетљивошћу на глутен. Позната по орашастом укусу и земљаним тоновима, хељда се може конзумирати у различитим облицима, попут крупника, брашна или резанаца, и представља основну намирницу у традиционалним кухињама широм света.
                          Једна од најзначајнијих нутритивних предности хељде је висок садржај протеина. Хељда садржи свих девет есенцијалних аминокиселина, укључујући лизин, што је чини потпуним извором протеина, што је ретко за биљне намирнице. Ово је одличан избор за вегетаријанце и вегане који желе да диверсификују унос протеина. Такође је добар извор дијеталних влакана, која помажу варењу, промовишу ситост и регулишу ниво шећера у крви.
                          Хељда је богата есенцијалним витаминима и минералима, укључујући магнезијум, манган, бакар и Б витамине, попут ниацина, фолата и рибофлавина. Ови нутријенти играју кључну улогу у енергетском метаболизму, функцији мозга и здрављу срца. Хељда такође садржи антиоксидансе попут рутина и кверцетина, који смањују упалу, побољшавају циркулацију и штите од оксидативног стреса, потенцијално смањујући ризик од хроничних болести.
                          У кулинарству, хељда је веома свестрана. Може се кувати као пиринач, користити у кашама, додавати супама и салатама, или млети у брашно за прављење палачинки, хлеба и резанаца, попут собе у јапанској кухињи.
                          Укратко, хељда је хранљива, безглутенска житарица која нуди бројне здравствене предности. Висок садржај протеина, влакана и широк спектар витамина и минерала чине је вредним додатком уравнотеженој исхрани.`,
    topic1: "Нутриција и Здравље",
    nutritionText: [
      {
        element: "Енергетска вредност:",
        quantity: 343,
        measurementUnits: "кцал",
        description:
          "– Умерен извор калорија, пружајући енергију са уравнотеженим нутријентима.",
      },
      {
        element: "Масти:",
        quantity: 3.4,
        measurementUnits: "г",
        description:
          "– Мало масти, са корисним мастима као што су полинезасићене и мононезасићене масти.",
      },
      {
        element: "Засићене масне киселине:",
        quantity: 0.7,
        measurementUnits: "г",
        description:
          "– Веома низак ниво засићених масти, што подржава здравље срца.",
      },
      {
        element: "Витамин Б3 (Ниацин):",
        quantity: 7.02,
        measurementUnits: "мг",
        description:
          "– Важан за поправку ДНК и подржава здравље дигестивног система.",
      },
      {
        element: "Натријум:",
        quantity: 1,
        measurementUnits: "мг",
        description:
          "– Веома низак садржај натријума, користан за регулисање крвног притиска.",
      },
      {
        element: "Калијум:",
        quantity: 270,
        measurementUnits: "мг",
        description:
          "– Умерен извор калијума, који је неопходан за равнотежу течности и функцију мишића.",
      },
      {
        element: "Угљени хидрати:",
        quantity: 74.3,
        measurementUnits: "г",
        description:
          "– Богат угљеним хидратима, који пружају брз извор енергије.",
      },
      {
        element: "Влакна:",
        quantity: 7.3,
        measurementUnits: "г",
        description:
          "– Добар извор дијеталних влакана, који подстичу здраво варење.",
      },
      {
        element: "Шећер:",
        quantity: 6.3,
        measurementUnits: "г",
        description:
          "– Садржи природне шећере, што доприноси његовом слатком укусу.",
      },
      {
        element: "Протеини:",
        quantity: 9.4,
        measurementUnits: "г",
        description:
          "– Обезбеђује умерену количину биљних протеина, који су корисни за обнову мишића.",
      },
      {
        element: "Витамин Ц:",
        quantity: 6.8,
        measurementUnits: "мг",
        description:
          "– Садржи витамин Ц, који је важан за функцију имунолошког система и здравље коже.",
      },
      {
        element: "Калцијум:",
        quantity: 2,
        measurementUnits: "мг",
        description:
          "– Садржи малу количину калцијума, који доприноси здрављу костију.",
      },
      {
        element: "Гвожђе:",
        quantity: 0.5,
        measurementUnits: "мг",
        description: "– Садржи мале количине гвожђа, неопходног за здраву крв.",
      },
      {
        element: "Витамин Б1 (Тиамин):",
        quantity: 0.15,
        measurementUnits: "мг",
        description:
          "– Подржава метаболизам енергије помажући телу да претвори угљене хидрате у енергију.",
      },
      {
        element: "Витамин Б6:",
        quantity: 0.1,
        measurementUnits: "мг",
        description: "– Подржава метаболизам и важан је за здравље мозга.",
      },
      {
        element: "Витамин Б2 (Рибофлавин):",
        quantity: 0.06,
        measurementUnits: "мг",
        description: "– Игра улогу у производњи енергије и здрављу коже.",
      },
      {
        element: "Магнезијум:",
        quantity: 37,
        measurementUnits: "мг",
        description:
          "– Садржи магнезијум, који је важан за функцију мишића и нерва.",
      },
      {
        element: "Цинк:",
        quantity: 0.5,
        measurementUnits: "мг",
        description:
          "– Садржи мале количине цинка, који подржава функцију имунолошког система.",
      },
      {
        element: "Витамин Е:",
        quantity: 0.1,
        measurementUnits: "мг",
        description:
          "– Низак садржај витамина Е, али је присутан у малим количинама.",
      },
      {
        element: "Витамин А:",
        quantity: 0,
        measurementUnits: "мг",
        description: "– Хељда није значајан извор витамина А.",
      },
    ],
    cultivationHeading:
      "Узгајање хељде подразумева раст тврде, брзо сазревајуће биљке која је толерантна на лоше услове земљишта. У наставку су кључни аспекти узгоја хељде:",
    cultivation: [
      {
        id: 21,
        topic: "Клима",
        children: [
          {
            id: 211,
            topic: "Температура",
            text: "Хељда успева у умереним климатским условима са хладним, влажним условима раста. Оптималне температуре су од 15°C до 25°C (59°F до 77°F). Не подноси добро мраз, па је често потребно касније сетво да би се избегле хладне температуре.",
          },
        ],
      },
      {
        id: 22,
        topic: "Земљиште",
        children: [
          {
            id: 221,
            topic: "pH ",
            text: "Хељда преферира благо кисело земљиште са пХ вредношћу од 5.0 до 7.0. Толерантна је на лош квалитет земљишта и не захтева високу плодност.",
          },
          {
            id: 222,
            topic: "Плодност",
            text: "За хељду је потребно минимално ђубрење, јер добро расте у земљиштима са ниским нивоом нутријената. Међутим, додавање органске материје или компоста може побољшати принос. Прекомерни азот може проузроковати да биљка расте превише високо и пада (ложење).",
          },
          {
            id: 223,
            topic: "Дренажа",
            text: "Хељда најбоље расте у добро дренираним земљиштима. Не подноси застоје воде и слабо ће расти у превише влажним условима.",
          },
        ],
      },
      {
        id: 23,
        topic: "Варијетети",
        text: "Неке уобичајене сорте хељде су:\n- Обична хељда (Fagopyrum esculentum)\n- Татарска хељда (Fagopyrum tataricum), позната по већој толеранцији на хладноћу и сиромашно земљиште.",
      },
      {
        id: 24,
        topic: "Сетва",
        children: [
          {
            id: 241,
            topic: "Време",
            text: "Хељда се обично сеје крајем пролећа или почетком лета након што прође опасност од мраза. Прерано сетво може изложити усев мразу.",
          },
          {
            id: 242,
            topic: "Размак",
            text: "Хељда се обично сеје на раздаљини од 50–75 кг по хектару. Размак између биљака може бити мањи у односу на друге усеве због компактног раста.",
          },
        ],
      },
      {
        id: 25,
        topic: "Заливање",
        children: [
          {
            id: 251,
            topic: "Минимално заливање",
            text: "Хељда је отпорна на сушу и захтева минимално заливање након што се укорени. Прекомерна влага може отежати њен раст.",
          },
        ],
      },
      {
        id: 26,
        topic: "Орезивање",
        text: "Орезивање није потребно за хељду. Она има једноставан начин раста и не захтева пуно одржавања након што се укорени.",
      },
      {
        id: 27,
        topic: "Ђубрење",
        children: [
          {
            id: 271,
            topic: "Хранљиве материје",
            text: "Примените лагана органска ђубрива или компост пре сетве ако је потребно, јер се хељда обично узгаја у нископлодним земљиштима. Висок ниво хранљивих материја може смањити принос.",
          },
        ],
      },
      {
        id: 28,
        topic: "Контрола штеточина и болести",
        text: "Хељда је углавном отпорна на штеточине и болести због брзог раста и способности да надјача коров. Међутим, уобичајене штеточине као што су ваши и бубе-бушачи могу утицати на усев. Контрола штеточина ретко је потребна јер кратак период раста хељде помаже у избегавању већих проблема.",
      },
      {
        id: 29,
        topic: "Жетва",
        children: [
          {
            id: 291,
            topic: "Знаци зрелости",
            text: "Хељда сазрева за око 10–12 недеља. Семе је спремно за жетву када потамни и доњи листови почну да се суше. Жетва треба да буде пажљиво темпирана како би се избегло распршивање семена по земљи.",
          },
        ],
      },
      {
        id: 30.1,
        topic: "Чување",
        text: "Након жетве, семе хељде може се чувати на сувом и хладном месту. Брашно од хељде најбоље је користити свеже јер има краћи рок трајања у односу на пшенично брашно због већег садржаја уља.",
      },
    ],
  },
  {
    id: 2,
    name: "Јечам",
    img: cerealsImages.barley,
    inGeneralHeading: `Основна житарица за здравље`,
    inGeneral: `Јечам (Hordeum vulgare) је једна од најстаријих култивисаних житарица, која се користи и у исхрани и као сточна храна. Ова житарица је позната по свом благотворном дејству на здравље, јер је богат извор влакана, витамина и минерала. Јечам се може користити у разним облицима, као цела зрна, брашно или као састојак у супама, чорбама и салатама.
        Јечам је добар извор сложених угљених хидрата, који осигуравају дуготрајну енергију. Он такође садржи велико количество растворљивих влакана, посебно бета-глукан, који је познат по својој способности да смањи холестерол и побољша здравље срца. Поред тога, јечам садржи и протеине, који су важни за раст и обнављање ткива.
        Ова житарица је такође богата витаминима Б групе, као што су тиамин и рибофлавин, који играју важну улогу у метаболизму и одржавању здравља коже и нервног система. Јечам је такође извор магнезијума, који је важан за функцију мишића и нерва, као и за одржавање здравих костју.
        У кулинарству, јечам се користи у разним јелима и напитцима, као што су хљеб, пивски екстракти, супе и салате. Његов благо слатки и орашасти укус додаје дубину и текстуру многим јелима.
        Укратко, јечам је висококвалитетна житарица која пружа бројне здравствене предности, а његова разноврсност у кулинарским применама чини га драгоценим састојком у свакодневној исхрани.`,
    topic1: "Нутриција и Здравље",
    nutritionText: [
      {
        element: "Енергетска вредност:",
        quantity: 354,
        measurementUnits: "кцал",
        description:
          "– Умерен извор калорија, обезбеђује енергију са избалансираним храњивим материјама.",
      },
      {
        element: "Масти:",
        quantity: 2.3,
        measurementUnits: "г",
        description:
          "– Мало масти, са корисним мастима укључујући полинезасићене масти.",
      },
      {
        element: "Засићене масне киселине:",
        quantity: 0.5,
        measurementUnits: "г",
        description:
          "– Веома ниско у засићеним мастима, што подстиче здравље срца.",
      },
      {
        element: "Витамин Б3 (Ниацин):",
        quantity: 4.6,
        measurementUnits: "мг",
        description:
          "– Подржава метаболизам и важан је за одржавање здраве коже и нерва.",
      },
      {
        element: "Натријум:",
        quantity: 12,
        measurementUnits: "мг",
        description: "– Ниско у натријуму, чинећи га здравим избором за срце.",
      },
      {
        element: "Калијум:",
        quantity: 452,
        measurementUnits: "мг",
        description:
          "– Добар извор калијума, који је важан за функцију мишића и баланс течности.",
      },
      {
        element: "Угљени хидрати:",
        quantity: 73.5,
        measurementUnits: "г",
        description:
          "– Богат у сложеним угљеним хидратима, обезбеђује дуготрајну енергију.",
      },
      {
        element: "Влакна:",
        quantity: 17.3,
        measurementUnits: "г",
        description:
          "– Висок у дијеталним влакнима, посебно бета-глукану, који подржава здравље срца и варење.",
      },
      {
        element: "Шећер:",
        quantity: 0.8,
        measurementUnits: "г",
        description:
          "– Садржи минималну количину природних шећера, чинећи га житарицом са ниским садржајем шећера.",
      },
      {
        element: "Протеини:",
        quantity: 12.5,
        measurementUnits: "г",
        description:
          "– Добар извор протеина на биљној бази, који помаже у поправци и одржавању мишића.",
      },
      {
        element: "Витамин Ц:",
        quantity: 0,
        measurementUnits: "мг",
        description: "– Јечам није значајан извор витамина Ц.",
      },
      {
        element: "Калцијум:",
        quantity: 29,
        measurementUnits: "мг",
        description: "– Пружа неки калцијум, који доприноси здрављу костију.",
      },
      {
        element: "Гвожђе:",
        quantity: 2.5,
        measurementUnits: "мг",
        description:
          "– Садржи гвожђе, које је неопходно за здраву производњу црвених крвних зрнаца.",
      },
      {
        element: "Витамин Б1 (Тиамин):",
        quantity: 0.3,
        measurementUnits: "мг",
        description:
          "– Подржава метаболизам енергије претварањем угљених хидрата у енергију.",
      },
      {
        element: "Витамин Б6:",
        quantity: 0.3,
        measurementUnits: "мг",
        description: "– Учествује у здрављу мозга и подржава метаболизам.",
      },
      {
        element: "Витамин Б2 (Рибофлавин):",
        quantity: 0.12,
        measurementUnits: "мг",
        description: "– Има улогу у производњи енергије и здрављу коже.",
      },
      {
        element: "Магнезијум:",
        quantity: 133,
        measurementUnits: "мг",
        description:
          "– Добар извор магнезијума, који је важан за функцију мишића и здравље нерва.",
      },
      {
        element: "Цинк:",
        quantity: 2.1,
        measurementUnits: "мг",
        description:
          "– Садржи цинк, који подржава имунски систем и раст ћелија.",
      },
      {
        element: "Витамин Е:",
        quantity: 0.02,
        measurementUnits: "мг",
        description: "– Веома низак у витамину Е, са минималним количинама.",
      },
      {
        element: "Витамин Б6 (Пиридоксин):",
        quantity: 0.26,
        measurementUnits: "мг",
        description: "– Подржава функцију мозга и здравље имуног система.",
      },
      {
        element: "Витамин А:",
        quantity: 0,
        measurementUnits: "мг",
        description: "– Јечам није значајан извор витамина А.",
      },
    ],
    cultivationHeading:
      "Гајење јечма захтева специфичне услове за постизање оптималног раста и приноса. Испод је преглед кључних фактора који су укључени у гајење јечма:",
    cultivation: [
      {
        id: 41,
        topic: "Клима",
        children: [
          {
            id: 411,
            topic: "Температура",
            text: "Јечам успешно расте у хладним, умереним климатским условима. Може поднети широк спектар температура, али најбоље успева у опсегу од 12°C до 24°C (54°F до 75°F). Јечам је такође подношљивији на хладноћу од других житарица као што је пшеница.",
          },
          {
            id: 412,
            topic: "Падавине",
            text: "Јечам захтева умерене падавине, идеално између 300 мм и 400 мм (12 до 16 инча) током расада. Превише влаге може довести до болести, док суша може смањити принос.",
          },
        ],
      },
      {
        id: 42,
        topic: "Тло",
        children: [
          {
            id: 421,
            topic: "pH",
            text: "Јечам преферира добро дренирано тло са pH вредношћу између 6.0 и 7.5. Умерено је подношљив на благо кисела и благо алкална тла.",
          },
          {
            id: 422,
            topic: "Тип тла",
            text: "Најбоље тло за јечам је плодно, лојано тло. Може расти и у пешчано-лојаним и глиненим тлима, под условом да имају добру дренажу. Тла која су водом заглављена треба избегавати како би се спречила труљења корена.",
          },
          {
            id: 423,
            topic: "Припрема тла",
            text: "Пре садње, тло треба обрадити или орањем разбијати компактацију и побољшати продор корена. Додавање органског материјала као што је компост или стајско ђубриво побољшава плодност и структуру.",
          },
        ],
      },
      {
        id: 43,
        topic: "Врсте",
        text: "Популарне врсте јечма укључују: -Дворедни јечам-: Често се користи за малтовање и производњу пива. -Шесторедни јечам-: Више се користи за сточну храну и производњу хране.",
      },
      {
        id: 44,
        topic: "Садња",
        children: [
          {
            id: 441,
            topic: "Време",
            text: "Јечам се може садити у пролеће или јесен, зависно од врсте. Пролећни јечам се сади чим се тло може обрадити, док се зимски јечам сади у јесен пре првог мраза.",
          },
          {
            id: 442,
            topic: "Размак",
            text: "Семе треба садити око 2 до 5 цм (1 до 2 инча) дубоко, са размаком редова од 15 до 20 цм (6 до 8 инча). Правилан размак помаже у осигурању доброг протока ваздуха и смањује ризик од болести.",
          },
          {
            id: 443,
            topic: "Стопа сејања",
            text: "Јечам обично захтева стопу сејања од 80 до 100 кг по хектару (71 до 89 фунти по акру) за оптималан принос.",
          },
        ],
      },
      {
        id: 45,
        topic: "Заливање",
        children: [
          {
            id: 451,
            topic: "Фаза успостављања",
            text: "Јечам треба редовно заливање током првих неколико недеља раста како би се осигурала клијавост и успостављање корена.",
          },
          {
            id: 452,
            topic: "Зрели биљке",
            text: "Након успостављања, јечам је релативно отпоран на сушу, али и даље захтева око 25-50 мм (1-2 инча) воде недељно током критичних фаза раста, као што су разгранате биљке и пуњење зрна.",
          },
        ],
      },
      {
        id: 46,
        topic: "Орезивање",
        text: "Јечам не захтева орезивање. Међутим, управљање густином усева и проредање прекомјерно густих биљака може побољшати циркулацију ваздуха и смањити ризик од гљивичних болести.",
      },
      {
        id: 47,
        topic: "Ђубрење",
        children: [
          {
            id: 471,
            topic: "Нутријенти",
            text: "Јечам има користи од уравнотежених ђубрива, посебно азота, фосфора и калијума. Типична примена азота је 80-100 кг по хектару, у зависности од природне плодности тла.",
          },
          {
            id: 472,
            topic: "Време",
            text: "Примена ђубрива треба да буде пре садње или у раним фазама раста. У неким случајевима, може бити потребна додатна примена азота током разгранатих фаза за оптималан принос.",
          },
        ],
      },
      {
        id: 48,
        topic: "Контрола штеточина и болести",
        children: [
          {
            id: 481,
            topic: "Штеточине",
            text: "Чести штеточини укључују афиде, војне црве и жице. Интегрисано управљање штеточинама (IPM), као што је употреба биолошких контрола или циљаних пестицида, може бити ефикасно.",
          },
          {
            id: 482,
            topic: "Болести",
            text: "Јечам је подложан болестима као што су брашнаста плесни, рђа листова и опекотине. Превентивне мере укључују ротацију усева, правилан размак и употребу фунгицида ако је потребно.",
          },
        ],
      },
      {
        id: 49,
        topic: "Жетва",
        children: [
          {
            id: 491,
            topic: "Време",
            text: "Јечам је обично спреман за жетву 60 до 70 дана након садње за пролећне врсте, и 180 дана за зимске врсте. Зрно треба да се бере када биљка постане златно-смеђа, а семе буде тврдо.",
          },
          {
            id: 492,
            topic: "Метод",
            text: "Јечам се може механички убирати помоћу жњевне машине. Употреба машине за жетву треба да се обави када садржај влаге у зрну буде око 14%, како би се спречила појава плесни.",
          },
        ],
      },
      {
        id: 50.2,
        topic: "Складиштење",
        text: "Јечам треба да се осуши на влагу од 12-13% пре складиштења како би се спречило кварење. Једном осушен, може се чувати у хладним и сувим условима неколико месеци.",
      },
      {
        id: 51.2,
        topic: "Проређивање",
        text: "Јечам не захтева проређивање, али смањење густине биљака може побољшати здрав раст и смањити конкуренцију за нутријенте.",
      },
    ],
  },
  {
    id: 3,
    name: "Кукуруз",
    img: cerealsImages.corn,
    inGeneralHeading: `Свестран и основни усев`,
    inGeneral: `Кукуруз, такође познат као маиз (Zea mays), једна је од најшире узгајаних култура на свету и основна намирница за милионе људи. Потиче из Америке и узгаја се већ хиљадама година, ценљен је због своје свестраности и употребе како у кулинарским тако и индустријским сврхама. Без обзира да ли се једе на чинији, као попкорн, млевено у брашно или прерађено у кукурузни сируп, ова житарица се налази у великом броју хране и производа.
                    Кукуруз је богат извор угљених хидрата, обезбеђујући енергију за тело. Посебно је богат скробом, што га чини кључним извором калорија у многим исхранама. Међутим, такође има значајну нутритивну вредност. Кукуруз садржи неколико есенцијалних витамина и минерала, укључујући витамине из Б групе као што су тиамин и фолат, који су важни за производњу енергије и функцију ћелија. Такође је добар извор магнезијума и фосфора, који су важни за здравље костију, као и мале количине калијума који подржава функцију срца.
                    Кукуруз, посебно жуте сорте, богат је антиоксидансима као што су каротеноиди, посебно лутеин и зеаксантин, који су познати по томе што подржавају здравље очију, помажући у смањењу ризика од катаракте и старењем повезаних дегенерација макуле. Цео кукуруз такође је добар извор влакана, која подржавају варење, здравље црева и помажу у одржавању стабилних нивоа шећера у крви.
                    У кулинарском смислу, кукуруз је изузетно свестран. Може се кувати или печити на роштиљу, користити као попкорн за ужину или млевен у кукурузно брашно за припрему хлеба, тортиља и других намирница. Кукуруз се такође користи за прављење поленте, грижа, а чак и пића као што су атоле и чича.
                    Укратко, кукуруз је веома свестран и нутритивно богат усев који обезбеђује енергију, есенцијалне витамине, минерале и антиоксидансе. Његова прилагодљивост у кухињи и широк спектар здравствених користи чине га важним компонентом исхране широм света.`,
    topic1: "Нутриција и здравље",
    nutritionText: [
      {
        element: "Енергетска вредност:",
        quantity: 365,
        measurementUnits: "ккал",
        description:
          "– Добар извор калорија, који обезбеђује енергију углавном из угљених хидрата.",
      },
      {
        element: "Масти:",
        quantity: 4.7,
        measurementUnits: "г",
        description:
          "– Низак садржај масти, са малим количинама полинезасићених масти.",
      },
      {
        element: "Засићене масне киселине:",
        quantity: 0.6,
        measurementUnits: "г",
        description:
          "– Врло низак садржај засићених масти, што подржава здравље срца.",
      },
      {
        element: "Витамин Б3 (Нијасин):",
        quantity: 1.7,
        measurementUnits: "мг",
        description:
          "– Подржава метаболизам и помаже у одржавању здраве коже и нервног система.",
      },
      {
        element: "Натријум:",
        quantity: 15,
        measurementUnits: "мг",
        description: "– Низак садржај натријума, чинећи га здравим за срце.",
      },
      {
        element: "Калијум:",
        quantity: 270,
        measurementUnits: "мг",
        description:
          "– Средњи извор калијума, који је неопходан за равнотежу течности и функцију мишића.",
      },
      {
        element: "Угљени хидрати:",
        quantity: 74.3,
        measurementUnits: "г",
        description:
          "– Висок садржај угљених хидрата, који обезбеђују брз извор енергије.",
      },
      {
        element: "Влакна:",
        quantity: 7.3,
        measurementUnits: "г",
        description:
          "– Добар извор дијеталних влакана, која подржавају здраво варење.",
      },
      {
        element: "Шећер:",
        quantity: 6.3,
        measurementUnits: "г",
        description:
          "– Садржи природне шећере који доприносе његовој слаткој ароми.",
      },
      {
        element: "Протеини:",
        quantity: 9.4,
        measurementUnits: "г",
        description:
          "– Обезбеђује умерену количину биљних протеина, корисних за поправку мишића.",
      },
      {
        element: "Витамин Ц:",
        quantity: 6.8,
        measurementUnits: "мг",
        description:
          "– Садржи витамин Ц који је важан за имунолошку функцију и здравље коже.",
      },
      {
        element: "Калцијум:",
        quantity: 2,
        measurementUnits: "мг",
        description:
          "– Садржи мале количине калцијума који доприноси здрављу костију.",
      },
      {
        element: "Гвожђе:",
        quantity: 0.5,
        measurementUnits: "мг",
        description: "– Садржи мале количине гвожђа, неопходног за здраву крв.",
      },
      {
        element: "Витамин Б1 (Тијамин):",
        quantity: 0.15,
        measurementUnits: "мг",
        description:
          "– Подржава метаболизам енергије помажући организму да претвори угљене хидрате у енергију.",
      },
      {
        element: "Витамин Б6:",
        quantity: 0.1,
        measurementUnits: "мг",
        description: "– Подржава метаболизам и важан је за здравље мозга.",
      },
      {
        element: "Витамин Б2 (Рибофлавин):",
        quantity: 0.06,
        measurementUnits: "мг",
        description: "– Игра улогу у производњи енергије и здрављу коже.",
      },
      {
        element: "Магнезијум:",
        quantity: 37,
        measurementUnits: "мг",
        description:
          "– Садржи магнезијум, који је есенцијалан за функцију мишића и нерва.",
      },
      {
        element: "Цинк:",
        quantity: 0.5,
        measurementUnits: "мг",
        description:
          "– Садржи мале количине цинка, који подржава имунолошку функцију.",
      },
      {
        element: "Витамин Е:",
        quantity: 0.1,
        measurementUnits: "мг",
        description:
          "– Низак садржај витамина Е, иако присутан у малим количинама.",
      },
      {
        element: "Витамин А:",
        quantity: 0,
        measurementUnits: "мг",
        description: "– Кукуруз није значајан извор витамина А.",
      },
    ],
    cultivationHeading:
      "Култивација кукуруза захтева специфичне услове како би се осигурао оптималан раст и високи приноси. Испод је преглед кључних фактора који утичу на узгајање кукуруза:",
    cultivation: [
      {
        id: 61,
        topic: "Клима",
        children: [
          {
            id: 611,
            topic: "Температура",
            text: "Кукуруз најбоље расте у топлим, сунчаним климатама. Оптимална температура за раст је између 18°C и 24°C (64°F до 75°F), али може поднети температуре до 32°C (90°F). Кукуруз је веома осетљив на мраз.",
          },
          {
            id: 612,
            topic: "Падавине",
            text: "Кукуруз захтева умерене до високе падавине, идеално између 500 мм и 800 мм (20 до 32 инча) током сезоне раста. Сушни услови могу значајно смањити принос, посебно током фазе цветовања.",
          },
        ],
      },
      {
        id: 62,
        topic: "Тло",
        children: [
          {
            id: 621,
            topic: "pH",
            text: "Кукуруз најбоље расте на добро дренираним тлима са ПХ вредношћу између 5.8 и 7.0. Може поднети благо кисела тла, али најбоље расте на неутралним или благо алкалним условима.",
          },
          {
            id: 622,
            topic: "Тип тла",
            text: "Лоамска тла богата органским материјама су идеална за кукуруз, јер обезбеђују добру дренажу и доступност хранљивих материја. Кукуруз може да се узгаја и на песковитим или глиненим тлима, али уз одржавање правилне ирригације и дренажe.",
          },
          {
            id: 623,
            topic: "Припрема тла",
            text: "Пре садње, тло треба обрадити и обогатити органским материјама као што су компост или добро разграђени стајњак, како би се побољшала плодност и структура. Препоручује се тестирање тла како би се утврдиле потребе за хранљивим материјама.",
          },
        ],
      },
      {
        id: 63,
        topic: "Сорте",
        text: "Популарне сорте кукуруза укључују: -Слатки кукуруз-: Узгаја се за свежу потрошњу. -Пољски кукуруз-: Користи се за сточну храну, скроб или производњу етанола. -Попкорн-: Специјална сорта са чврстим зрнима која пуцају када се загреју.",
      },
      {
        id: 64,
        topic: "Садња",
        children: [
          {
            id: 641,
            topic: "Време",
            text: "Кукуруз је најбоље садити у пролеће, након што прође опасност од мраза и када температура тла достигне најмање 10°C (50°F) ради оптималне клијања.",
          },
          {
            id: 642,
            topic: "Размак",
            text: "Семе кукуруза треба садити на дубину од око 2.5 до 5 цм (1 до 2 инча), са редовима који су удаљени 75 цм (30 инча). Растојање између биљака у реду треба бити 20 до 30 цм (8 до 12 инча).",
          },
          {
            id: 643,
            topic: "Број семена",
            text: "Препоручује се број семена од 25.000 до 35.000 биљака по хектару (10.000 до 14.000 по акру), зависно од сорте и услова раста.",
          },
        ],
      },
      {
        id: 65,
        topic: "Заливање",
        children: [
          {
            id: 651,
            topic: "Фаза успостављања",
            text: "Кукуруз захтева константну влагу током раних фаза раста. Регуларно заливање је неопходно како би се обезбедило клијање и успостављање садница.",
          },
          {
            id: 652,
            topic: "Зреле биљке",
            text: "Кукуруз захтева око 25-50 мм (1-2 инча) воде недељно током сезоне раста. Адекватно заливање током фазе кочијања и свиле је кључно за максималан принос зрна.",
          },
        ],
      },
      {
        id: 66,
        topic: "Орезивање",
        text: "Кукуруз не захтева орезивање. Међутим, контрола корова око базе биљака је важна за смањење конкуренције за хранљиве материје и воду.",
      },
      {
        id: 67,
        topic: "Ђубрење",
        children: [
          {
            id: 671,
            topic: "Хранљиве материје",
            text: "Кукуруз је интензиван поједач и захтева ђубрива богата азотом за оптималан раст. Може се користити уравнотежено НПК ђубриво (нпр. 10-10-10) или циљана примена азота (нпр. уреа).",
          },
          {
            id: 672,
            topic: "Време",
            text: "Ђубрива треба применити у време садње и током вегетативних фаза раста. Додатно ђубрење азотом током фазе 4 до 6 листова (В4-В6) је корисно за постизање високих приноса.",
          },
        ],
      },
      {
        id: 68,
        topic: "Контрола штеточина и болести",
        children: [
          {
            id: 681,
            topic: "Штеточине",
            text: "Чести штеточини који утичу на кукуруз укључују кукурузног ушца, европског кукурузног борера и војне гусенице. Интегрисани приступ управљању штеточинама (ИПМ), као што су ротирање усева, сорте отпорне на штеточине и биолошка контрола, могу помоћи у управљању овим штеточинама.",
          },
          {
            id: 682,
            topic: "Болести",
            text: "Кукуруз је подложан болестима као што су болест листова, рђа и труљење стабала. Сорте отпорне на болести и правилне агротехничке мере, укључујући правилан размак и адекватну ирригацију, могу помоћи у спречавању инфекција.",
          },
        ],
      },
      {
        id: 69,
        topic: "Жетва",
        children: [
          {
            id: 691,
            topic: "Време",
            text: "Кукуруз се обично жње 60 до 100 дана након садње, у зависности од сорте. Слатки кукуруз је спреман када су зрна пуна и млечна, док се пољски кукуруз бере након што су зрна потпуно осушена.",
          },
          {
            id: 692,
            topic: "Метод",
            text: "Кукуруз се може жетвити ручно или механичким жетвама, посебно за велике производње. За слатки кукуруз, жетва се врши када је свила постала браон, а зрна су пуна.",
          },
        ],
      },
      {
        id: 70.2,
        topic: "Чување",
        text: "Слатки кукуруз је најбоље конзумирати свеже, али се може чувати у фрижидеру до недељу дана. За пољски кукуруз, зрна треба осушити до садржаја влаге око 15% и чувати на хладном, сувом месту за дугорочно складиштење.",
      },
      {
        id: 71.2,
        topic: "Проређивање",
        text: "Проређивање је важно у култивацији кукуруза, посебно ако су семена засадила превише густо. Проређивање саднице када су високе 10 до 15 цм (4 до 6 инча) како бисте осигурали правилан размак и здрав раст.",
      },
    ],
  },

  {
    id: 4,
name: "Просо",
img: cerealsImages.millet,
inGeneralHeading: `Древно и хранљиво зрно`,
inGeneral: `Просо, група малозрних трава из породице Поацеае, древно је зрно које се гаји већ хиљадама година, посебно у Азији и Африци. Веома је цењено због своје отпорности на сушу, што га чини основном храном у подручјима са сувим климатама. Просо долази у неколико врста, укључујући бисерно, лисно, просо и прстасто просо, свака са нешто различитим укусом и текстуром. Вреди се не само због своје свестраности у кухању, већ и због импресивног нутритивног профила. 
                    Просо је природно без глутена, што га чини популарним избором за особе са целијакијом или осетљивошћу на глутен. Богато је сложеним угљеним хидратима који пружају одрживу енергију, а нуди и добру количину влакана. Влакна помажу у варењу, подстичу осећај ситости и помажу у регулацији нивоа шећера у крви, што просо чини корисним за оне који управљају дијабетесом или желе да одрже стабилне нивое енергије.
                    Просо је такође богат извор есенцијалних витамина и минерала. Садржи витамине из групе Б, као што су ниацин, тиамин и рибофлавин, који играју кључну улогу у метаболизму, функцији мозга и производњи енергије. Поред тога, просо је добар извор магнезијума, фосфора, гвожђа и мангана, који подржавају здравље костију, кардиоваскуларно здравље и општу ћелијску функцију.
                    Поред ових нутријената, просо садржи антиоксидансе, укључујући фенолне компоне и флавоноиде, који помажу у смањењу запаљења и штите тело од оксидативног стреса. Ово доприноси нижем ризику од хроничних болести, као што су срчане болести и рак.
                    У кулинарском смислу, просо је изузетно свестран. Може се кувати као пиринач и користити као основа за салате, пилаве или каше. Његов благ укус чини га погодним за слане и слатке јела. Просо брашно такође може да се користи у печењу, посебно у рецептима без глутена.
                    Укратко, просо је хранљиво, безглутенско зрно са бројним здравственим предностима. Његова свестраност у кухању и способност да расте у тешким климатским условима чине га важним и вредним зрном у исхрани широм света.`,
topic1: "Нутриција и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 378,
    measurementUnits: "ккал",
    description: "– Добар извор калорија, пружа енергију уз различите нутријенте."
  },
  {
    element: "Масти:",
    quantity: 4.2,
    measurementUnits: "г",
    description: "– Низак садржај укупних масти, садржи здраве незасићене масти."
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0.4,
    measurementUnits: "г",
    description: "– Врло низак садржај засићених масти, подржава здравље срца."
  },
  {
    element: "Витамин Б3 (Никотинска киселина):",
    quantity: 1.0,
    measurementUnits: "мг",
    description: "– Подржава метаболичке процесе и доприноси здрављу коже."
  },
  {
    element: "Натријум:",
    quantity: 5,
    measurementUnits: "мг",
    description: "– Врло низак садржај натријума, што га чини погодним за здравље срца."
  },
  {
    element: "Калијум:",
    quantity: 195,
    measurementUnits: "мг",
    description: "– Пружа калијум, који је важан за здравље срца и мишића."
  },
  {
    element: "Угљени хидрати:",
    quantity: 73.0,
    measurementUnits: "г",
    description: "– Богат угљеним хидратима, пружа одрживу енергију."
  },
  {
    element: "Влакна:",
    quantity: 9.0,
    measurementUnits: "г",
    description: "– Висок садржај влакана, подстиче здравље дигестивног система."
  },
  {
    element: "Шећер:",
    quantity: 1.0,
    measurementUnits: "г",
    description: "– Садржи минималне природне шећере, чинећи га зрном са ниским садржајем шећера."
  },
  {
    element: "Протеини:",
    quantity: 11.0,
    measurementUnits: "г",
    description: "– Добар извор биљних протеина, помаже у поправци мишића."
  },
  {
    element: "Витамин Ц:",
    quantity: 0,
    measurementUnits: "мг",
    description: "– Просо није значајан извор витамина Ц."
  },
  {
    element: "Калцијум:",
    quantity: 8,
    measurementUnits: "мг",
    description: "– Пружа неки калцијум, који доприноси здрављу костију."
  },
  {
    element: "Гвожђе:",
    quantity: 3.0,
    measurementUnits: "мг",
    description: "– Садржи гвожђе, које је есенцијално за производњу црвених крвних зрнаца."
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Подржава метаболизам енергије претварањем угљених хидрата у енергију."
  },
  {
    element: "Витамин Б6:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Важан за здравље мозга и метаболизам."
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.07,
    measurementUnits: "мг",
    description: "– Има улогу у производњи енергије и здрављу коже."
  },
  {
    element: "Магнезијум:",
    quantity: 85,
    measurementUnits: "мг",
    description: "– Добар извор магнезијума, који је есенцијалан за функцију мишића и нерва."
  },
  {
    element: "Цинк:",
    quantity: 1.0,
    measurementUnits: "мг",
    description: "– Садржи цинк, који подржава имунски систем и зарастање рана."
  },
  {
    element: "Витамин Е:",
    quantity: 0.2,
    measurementUnits: "мг",
    description: "– Садржи мале количине витамина Е, који делује као антиоксиданс."
  },
  {
    element: "Витамин А:",
    quantity: 0,
    measurementUnits: "мг",
    description: "– Просо није значајан извор витамина А."
  },
],
cultivationHeading: "Узгој проса је погодан за суве регионе и захтева специфичне услове за оптималан раст и принос. Ево прегледа кључних фактора који утичу на узгој проса:",

cultivation: [
  {
    id: 81,
    topic: "Клима",
    children: [
      {
        id: 811,
        topic: "Температура",
        text: "Просо најбоље расте у топлим климама, са идеалним температурама између 24°C и 29°C (75°F до 85°F). Отпорно је на сушу и може успешно расти у регионима са малим падавинама.",
      },
      {
        id: 812,
        topic: "Падавине",
        text: "Просо је веома отпорно на сушу, али ипак захтева 300 мм до 500 мм (12 до 20 инча) падавина током вегетационог периода за оптималну производњу. Може толерисати услове са малим до умереним количинама падавина.",
      },
    ],
  },
  {
    id: 82,
    topic: "Тло",
    children: [
      {
        id: 821,
        topic: "pH",
        text: "Просо добро расте на различитим типовима земљишта, са pH вредношћу између 5.5 и 7.0. Предност дају благо киселим до неутралним земљиштима.",
      },
      {
        id: 822,
        topic: "Тип земљишта",
        text: "Песковито-ловна или лојна земљишта су идеална за просо због доброг одводњавања. Просо може расти и на сиромашним и неплодним земљиштима, што га чини добром опцијом за маргина земљишта.",
      },
      {
        id: 823,
        topic: "Припрема земљишта",
        text: "Пре садње, земљиште треба обрадити и обогатити органским материјама, као што су компост или стајњак, како би се побољшала плодност и структура земљишта.",
      },
    ],
  },
  {
    id: 83,
    topic: "Варијанте",
    text: "Популарне сорте проса укључују: - Перлово просо (Бајра) -: Узгаја се за зрно и сточну храну. - Љуљачко просо -: Узгаја се за производњу зрна. - Палачево просо (Раги) -: Богато калцијумом и користи се за људску исхрану.",
  },
  {
    id: 84,
    topic: "Садња",
    children: [
      {
        id: 841,
        topic: "Време",
        text: "Просо се обично сади током сезоне киша (мусон), или може да расте у пролеће и лето у неким регионима. Потребно је осигурати да земљиште буде загрејано пре садње.",
      },
      {
        id: 842,
        topic: "Размак",
        text: "Семе треба садити на дубину од 2,5 до 3,5 цм (1 до 1,5 инча), а размаци између редова треба да буду од 30 до 45 цм (12 до 18 инча). Разређујте саднице на удаљеност од 10 до 15 цм (4 до 6 инча).",
      },
      {
        id: 843,
        topic: "Број семена",
        text: "Препоручена количина семена за просо је 4 до 5 кг по хектару (3,5 до 4,5 фунти по акру), у зависности од сорте и услова на земљишту.",
      },
    ],
  },
  {
    id: 85,
    topic: "Заливање",
    children: [
      {
        id: 851,
        topic: "Фаза успостављања",
        text: "Просо захтева лако заливање или кишу током фаза клијања и развоја садница. Треба избегавати превелики обим воде јер је просо отпорно на сушу и осетљиво на преплављене услове.",
      },
      {
        id: 852,
        topic: "Зреле биљке",
        text: "Просо захтева минимално заливање након успостављања. Може да преживи уз 25-50 мм (1-2 инча) воде недељно, што га чини погодним за регионе са ограниченим водним ресурсима.",
      },
    ],
  },
  {
    id: 86,
    topic: "Орезивање",
    text: "Просо не захтева орезивање, али треба редовно контролисати коров како би се спречила конкуренција за воду и хранљиве материје.",
  },
  {
    id: 87,
    topic: "Ђубрење",
    children: [
      {
        id: 871,
        topic: "Храњиве материје",
        text: "Просо захтева умерену количину азота и фосфора за раст. Могу се користити органска ђубрива, као што је компост, или уравнотежена ђубрива као што је NPK (нпр. 10-10-10).",
      },
      {
        id: 872,
        topic: "Време",
        text: "Ђубрење треба применити при садњи и поново током раних фаза раста како би се подстакао здрав развој. Током сезоне раста, потребно је додатно ђубрење азотом ако је потребно.",
      },
    ],
  },
  {
    id: 88,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 881,
        topic: "Штеточине",
        text: "Уобичајене штеточине које нападају просо укључују штитне борацке, уши и скакавце. Применом интегрисаног система управљања штеточинама (IPM), као што је сејање у ротацији, може се помоћи у контроли популације штеточина.",
      },
      {
        id: 882,
        topic: "Болести",
        text: "Просо је подложно болестима као што су downy mildew и rust. Права ротација усева, отпорне сорте и фунгициди могу помоћи у решавању ових проблема.",
      },
    ],
  },
  {
    id: 89,
    topic: "Жетва",
    children: [
      {
        id: 891,
        topic: "Време",
        text: "Просо је обично спремно за жетву од 60 до 90 дана након садње, зависно од сорте. Жетва се врши када зрно постане чврсто и зрело, а биљке почну да се суше.",
      },
      {
        id: 892,
        topic: "Метод",
        text: "Просо се може жетвати ручно или механички. За ручну жетву, сече се стабљика и житарице се љуљашу традиционалним или механичким методама.",
      },
    ],
  },
  {
    id: 90.2,
    topic: "Складиштење",
    text: "Зрно проса може се складиштити неколико месеци ако се чува на хладном и сувом месту. Потребно је правилно сушење зрна након жетве да би се спречило плесни и квариње током складиштења.",
  },
  {
    id: 91.2,
    topic: "Разређивање",
    text: "Саднице проса треба разређивати након што досегну висину од 10 цм (4 инча) како би се осигурао правилан размак и смањила конкуренција између биљака.",
  },
]

  },
  {
    id: 5,
    name: "Пшеница",
    img: cerealsImages.wheat,
    inGeneralHeading: "Основна житарица глобалне пољопривреде",
    inGeneral: `Пшеница (Triticum) је једна од најважнијих житарица на свету, која служи као основни део исхране за милијарде људи. Гаји се више од 10.000 година и представља основу многих намирница, укључујући хлеб, тестенине, житарице и пецива, чинећи је каменом темљцем глобалне кухиње. Њена способност прилагођавања различитим климатским условима и богата нутритивна вредност чине пшеницу кључном културом у људској цивилизацији. 
                    Пшеница се углавном састоји од угљених хидрата, пружајући значајан извор енергије. Цела пшеница, која укључује све делове зрна – ољуштени део, клицу и крајњи део – много је хранљивија од рафинисане пшенице. Цела пшеница садржи есенцијалне витамине и минерале као што су гвожђе, магнезијум, фосфор и витамини Б групе као што су ниацин и фолат. Поред тога, добар је извор дијететских влакана која подржавају здравље варења, регулишу ниво шећера у крви и промовишу ситост. 
                    Ољуштени део и клица у целој пшеници такође садрже антиоксиданте попут селена и фенолних киселина који помажу у заштити од оксидативног стреса и упале, смањујући ризик од хроничних болести као што су болести срца и неке врсте рака. Пшеница такође пружа умерену количину протеина, посебно у сортама као што је тврда пшеница која се користи за производњу тестенине. 
                    У кулинарском смислу, пшеница је веома свестрана. Може се млети у брашно за печење, дробити за употребу у салатама и житарицама, или правити булгур и кускус за разне јелова. Упркос свим својим предностима, пшеница садржи глутен, који може изазвати негативне реакције код људи са целијакијом или осетљивошћу на глутен. 
                    Укратко, пшеница је глобално важна житарица, која пружа енергију, влакна и виталне нутритијенте. Њена свестраност и улога као основне намирнице чине је незаобилазним делом исхране широм света.`,
    topic1: "Нутритивна вредност и здравље",
    nutritionText: [
      {
        element: "Енергетска вредност:",
        quantity: 339,
        measurementUnits: "кцал",
        description: "– Добар извор калорија, који пружа енергију углавном из угљених хидрата.",
      },
      {
        element: "Масти:",
        quantity: 2.5,
        measurementUnits: "г",
        description: "– Низак у мастима, са малим количинама полинезасићених и мононезасићених масти.",
      },
      {
        element: "Засићене масне киселине:",
        quantity: 0.4,
        measurementUnits: "г",
        description: "– Веома низак у засићеним мастима, што промовише здравље срца.",
      },
      {
        element: "Витамин Б3 (Ниацин):",
        quantity: 4.6,
        measurementUnits: "мг",
        description: "– Подржава метаболизам и есенцијалан је за одржавање здраве коже и нерва.",
      },
      {
        element: "Натријум:",
        quantity: 2,
        measurementUnits: "мг",
        description: "– Веома низак у натријуму, што га чини избором добрим за здравље срца.",
      },
      {
        element: "Калијум:",
        quantity: 363,
        measurementUnits: "мг",
        description: "– Добар извор калијума, који је есенцијалан за функцију мишића и равнотежу течности.",
      },
      {
        element: "Угљени хидрати:",
        quantity: 71.2,
        measurementUnits: "г",
        description: "– Богат угљеним хидратима, који пружају сталну енергију.",
      },
      {
        element: "Влакна:",
        quantity: 12.2,
        measurementUnits: "г",
        description: "– Богат дијететским влакнима, која промовишу здраво варење и здравље црева.",
      },
      {
        element: "Шећер:",
        quantity: 0.4,
        measurementUnits: "г",
        description: "– Садржи минималне количине природних шећера.",
      },
      {
        element: "Протеини:",
        quantity: 13.2,
        measurementUnits: "г",
        description: "– Добар извор биљних протеина, користан за обнову и раст мишића.",
      },
      {
        element: "Витамин Ц:",
        quantity: 0,
        measurementUnits: "мг",
        description: "– Пшеница није значајан извор витамина Ц.",
      },
      {
        element: "Калцијум:",
        quantity: 18,
        measurementUnits: "мг",
        description: "– Пружа малу количину калцијума, који доприноси здрављу костију.",
      },
      {
        element: "Гвожђе:",
        quantity: 3.6,
        measurementUnits: "мг",
        description: "– Садржи гвожђе, које је есенцијално за здравље крви и превенцију анемије.",
      },
      {
        element: "Витамин Б1 (Тиамин):",
        quantity: 0.4,
        measurementUnits: "мг",
        description: "– Подржава енергетски метаболизам помажући телу да претвори угљене хидрате у енергију.",
      },
      {
        element: "Витамин Б6:",
        quantity: 0.1,
        measurementUnits: "мг",
        description: "– Важан за метаболизам протеина и когнитивни развој.",
      },
      {
        element: "Витамин Б2 (Рибофлавин):",
        quantity: 0.2,
        measurementUnits: "мг",
        description: "– Игра важну улогу у производњи енергије и одржавању здраве коже.",
      },
      {
        element: "Магнезијум:",
        quantity: 126,
        measurementUnits: "мг",
        description: "– Добар извор магнезијума, који је есенцијалан за функцију мишића и нерва.",
      },
      {
        element: "Цинк:",
        quantity: 3.2,
        measurementUnits: "мг",
        description: "– Садржи цинк, који подржава имунолошки систем и зарастање рана.",
      },
      {
        element: "Витамин Е:",
        quantity: 0.1,
        measurementUnits: "мг",
        description: "– Низак у витамину Е, али присутан у малим количинама.",
      },
      {
        element: "Витамин А:",
        quantity: 0,
        measurementUnits: "мг",
        description: "– Пшеница није значајан извор витамина А.",
      },
    ],
    cultivationHeading: "Узгој пшенице захтева специфичне услове за оптималан раст и принос. Ево прегледа кључних фактора који утичу на узгој пшенице:",

    cultivation: [
      {
        id: 101,
        topic: "Клима",
        children: [
          {
            id: 1011,
            topic: "Температура",
            text: "Пшеница најбоље расте у хладним, умереним климама. Идеалне температуре за раст су између 10°C и 24°C (50°F до 75°F). Пшеница захтева хладно време током вегетативне фазе и топлије температуре како се приближава зрелости.",
          },
          {
            id: 1012,
            topic: "Падавине",
            text: "Пшеница захтева умерене падавине од 300 до 900 мм (12 до 35 инча) током вегетационог периода. Падавине током фазе пуњења зрна могу негативно утицати на квалитет зрна, па се током овог периода преферира суво време.",
          },
        ],
      },
      {
        id: 102,
        topic: "Тло",
        children: [
          {
            id: 1021,
            topic: "pH",
            text: "Пшеница најбоље расте на земљишту са pH вредношћу између 6.0 и 7.0. Благо кисела до неутрална земљишта су оптимална за узгој пшенице.",
          },
          {
            id: 1022,
            topic: "Тип земљишта",
            text: "Лојна, добро одводњена земљишта су идеална за пшеницу. Култура такође може расти на глиновитим или песковитим земљиштима, ако имају добру способност задржавања воде и одводњавање.",
          },
          {
            id: 1023,
            topic: "Припрема земљишта",
            text: "Пре садње, земљиште треба обрадити до фине текстуре и обогатити органским материјама или уравнотеженим ђубривима како би се осигурала доступност хранљивих материја.",
          },
        ],
      },
      {
        id: 103,
        topic: "Варијанте",
        text: "Популарне сорте пшенице укључују: -Тврда црвена пшеница-: Користи се за прављење хлеба због високог садржаја глутена. -Мека црвена пшеница-: Користи се за пецива и колаче. -Дурум пшеница-: Користи се за производњу тестенина.",
      },
      {
        id: 104,
        topic: "Садња",
        children: [
          {
            id: 1041,
            topic: "Време",
            text: "Пшеница се обично сади у јесен (зимска пшеница) или рано пролеће (пролећна пшеница), у зависности од сорте и локалне климе. Зимска пшеница се сади од септембра до новембра, док се пролећна пшеница сади од марта до маја.",
          },
          {
            id: 1042,
            topic: "Размак",
            text: "Семе пшенице треба садити на дубину од 2,5 до 4 цм (1 до 1,5 инча), са размацима између редова од 15 до 25 цм (6 до 10 инча) како би се омогућио правилан раст и циркулација ваздуха.",
          },
          {
            id: 1043,
            topic: "Број семена",
            text: "Препоручена количина семена за пшеницу је 100 до 150 кг по хектару (90 до 135 фунти по акру), у зависности од сорте и плодовитости земљишта.",
          },
        ],
      },
      {
        id: 105,
        topic: "Заливање",
        children: [
          {
            id: 1051,
            topic: "Фаза успостављања",
            text: "Пшеница захтева довољно влаге током клијања и раних фаза раста. Треба залијевати пољопривредну површину током сувих периода како би се одржала константна влажност земљишта.",
          },
          {
            id: 1052,
            topic: "Критичне фазе",
            text: "Пшеница захтева највише воде током фазе латења, цветања и пуњења зрна. Недостатак воде током ових фаза може смањити принос.",
          },
          {
            id: 1053,
            topic: "Избегавање преплављености",
            text: "Пшеница је осетљива на преплављене услове, који могу изазвати труљење корена и успорен раст. Осигурајте добру одводњавање на пољу.",
          },
        ],
      },
      {
        id: 106,
        topic: "Орезивање",
        text: "Пшеница не захтева орезивање, али је контролисање корова ручно или хемијским средствима кључно за смањење конкуренције за воду, светлост и хранљиве материје.",
      },
      {
        id: 107,
        topic: "Ђубрење",
        children: [
          {
            id: 1071,
            topic: "Храњиве материје",
            text: "Пшеница захтева азот, фосфор и калијум за оптималан раст. Уравнотежена ђубрива, као што је NPK (нпр. 20-20-0), могу се применити на основу тестова земљишта.",
          },
          {
            id: 1072,
            topic: "Време",
            text: "Ђубрење треба применити при садњи и током фазе латења како би се подстакли здрави раст корена и стабљика. Нитрогено ђубрење током раста може побољшати принос и квалитет зрна.",
          },
        ],
      },
      {
        id: 108,
        topic: "Контрола штеточина и болести",
        children: [
          {
            id: 1081,
            topic: "Штеточине",
            text: "Уобичајене штеточине пшенице укључују уши, пшенични стабљични ждерљи и војничке гусенице. Практиковање интегрисаног управљања штеточинама (IPM), као што је биолошка контрола и ротација усева, може помоћи у смањењу притиска штеточина.",
          },
          {
            id: 1082,
            topic: "Болести",
            text: "Пшеница је подложна болестима као што су рђа, прашкаста плесан и Фузаријумов мозак. Отпорне сорте и благовремена примена фунгицида могу помоћи у превенцији ових болести.",
          },
        ],
      },
      {
        id: 109,
        topic: "Жетва",
        children: [
          {
            id: 1091,
            topic: "Време",
            text: "Пшеница је обично спремна за жетву од 100 до 120 дана након садње. Жетва се обавља када зрна постану чврста, а биљке постану златно-смеђе боје.",
          },
          {
            id: 1092,
            topic: "Метод",
            text: "Пшеница се може жетвити ручно или уз помоћ комбајна. Правилно сушење је од суштинске важности како би се смањио садржај влаге и осигурала безбедна складиштења.",
          },
        ],
      },
      {
        id: 110,
        topic: "Складиштење",
        text: "Након жетве, зрна пшенице треба темељно осушити како би се смањио садржај влаге на око 12% како би се спречило кварење. Зрна се могу складиштити у хладним и сувим условима неколико месеци.",
      },
      {
        id: 111,
        topic: "Проређивање",
        text: "Пшеница обично не захтева проређивање. Међутим, одржавање одговарајуће густине садње је важно за здрав раст биљака и оптималан принос.",
      },
    ]    
  },
  {
    id: 6,
name: "Раж",
img: cerealsImages.rye,
inGeneralHeading: `Нутритивно богат и укусни зрно`,
inGeneral: `Раж (Secale cereale) је отпорно житарица која се гаји већ вековима, углавном у Европи и деловима Азије. Позната по свом специфичном, земљаном укусу и богатом нутритивном профилу, раж се често користи за прављење хлеба, крекера, па чак и вискија. Одлично успева у хладнијим климатским условима и често се гаји као ротирајућа култура, помажући побољшању здравља земљишта и смањењу ерозије.
Једна од најистакнутијих карактеристика ражи је висок садржај влакана, посебно растворљивих влакана, која помажу у смањењу нивоа холестерола и регулисању нивоа шећера у крви. Влакна у ражи доприносе осећају ситости, што је чини корисном за контролу тежине. Цео зрно ражи такође је богато есенцијалним нутријентима, укључујући витамине Б (као што су ниацин и фолат), гвожђе, магнезијум и манган, који подржавају различите телесне функције, укључујући метаболизам и производњу енергије.
Раж се посебно истиче по својим потенцијалним здравственим предностима, укључујући своја антиоксидативна својства, која помажу у борби против оксидативног стреса и упале у телу. Неки истраживачки радови сугеришу да укључивање ражи у исхрану може смањити ризик од одређених хроничних болести, као што су болести срца и дијабетес тип 2.
Кулинарски гледано, ражено брашно се најчешће користи за прављење густих, срдачних хлебова, укључујући традиционални ражени хлеб и пумперникел. Раж се такође може кувати као цео зрно, користити у салатама или додавати у супе и чорбе за додатну текстуру и укус.
У закључку, раж је хранљива житарица која нуди разне здравствене предности. Њен јединствени укус, висок садржај влакана и свестраност у кувању чине је вредним додацима у уравнотеженој исхрани.`,
topic1: "Нутриција и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 335,
    measurementUnits: "кцал",
    description:
      "– Умерен извор калорија, који пружа енергију уз есенцијалне нутријенте.",
  },
  {
    element: "Масти:",
    quantity: 1.6,
    measurementUnits: "г",
    description:
      "– Низак садржај масти, са здравим мастима углавном из полинезасићених извора.",
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0.3,
    measurementUnits: "г",
    description:
      "– Врло низак садржај засићених масти, што је корисно за здравље срца.",
  },
  {
    element: "Витамин Б3 (Нијасин):",
    quantity: 3.9,
    measurementUnits: "мг",
    description: "– Подржава метаболизам и важан је за здравље коже.",
  },
  {
    element: "Натријум:",
    quantity: 2,
    measurementUnits: "мг",
    description: "– Врло низак садржај натријума, чинећи га здравим избором за срце.",
  },
  {
    element: "Калијум:",
    quantity: 364,
    measurementUnits: "мг",
    description:
      "– Добар извор калијума, важан за функцију мишића и нерва.",
  },
  {
    element: "Угљени хидрати:",
    quantity: 76.0,
    measurementUnits: "г",
    description:
      "– Богат сложеним угљеним хидратима, који пружају продужену енергију.",
  },
  {
    element: "Влакна:",
    quantity: 15.0,
    measurementUnits: "г",
    description:
      "– Висок садржај дијететских влакана, који подржавају здравље варења и црева.",
  },
  {
    element: "Шећер:",
    quantity: 1.0,
    measurementUnits: "г",
    description:
      "– Садржи минималне природне шећере, што га чини житарицом са ниским садржајем шећера.",
  },
  {
    element: "Протеини:",
    quantity: 9.5,
    measurementUnits: "г",
    description:
      "– Добар извор биљних протеина, који помажу у одржавању и поправци мишића.",
  },
  {
    element: "Витамин Ц:",
    quantity: 0,
    measurementUnits: "мг",
    description: "– Раж није значајан извор витамина Ц.",
  },
  {
    element: "Калцијум:",
    quantity: 18,
    measurementUnits: "мг",
    description: "– Пружа неки калцијум, који доприноси здрављу костију.",
  },
  {
    element: "Гвожђе:",
    quantity: 3.5,
    measurementUnits: "мг",
    description:
      "– Садржи гвожђе, које је неопходно за производњу црвених крвних зрнаца.",
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.4,
    measurementUnits: "мг",
    description:
      "– Подржава метаболизам енергије и функцију нервног система.",
  },
  {
    element: "Витамин Б6:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Учествује у здрављу мозга и метаболизму.",
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.11,
    measurementUnits: "мг",
    description:
      "– Има улогу у производњи енергије и одржавању здраве коже.",
  },
  {
    element: "Магнезијум:",
    quantity: 94,
    measurementUnits: "мг",
    description:
      "– Добар извор магнезијума, важан за функцију мишића и здравље нерва.",
  },
  {
    element: "Цинк:",
    quantity: 2.3,
    measurementUnits: "мг",
    description:
      "– Садржи цинк, који подржава имунолошку функцију и зарастање рана.",
  },
  {
    element: "Витамин Е:",
    quantity: 0.2,
    measurementUnits: "мг",
    description:
      "– Садржи мале количине витамина Е, важног антиоксиданса.",
  },
  {
    element: "Витамин А:",
    quantity: 0,
    measurementUnits: "мг",
    description: "– Раж није значајан извор витамина А.",
  },
],
cultivationHeading:
      "Култивација ражи укључује специфичне услове који осигуравају оптималан раст и принос. Ево прегледа кључних фактора који утичу на узгој ражи:",
    cultivation: [
      {
        id: 201,
        topic: "Клима",
        children: [
          {
            id: 2011,
            topic: "Температура",
            text: "Раж је отпорна биљка и може да поднесе хладне температуре. Најбоље расте у подручјима са хладном климом, са идеалним температурама од 10°C до 20°C (50°F до 68°F). Подноси мраз и отпорнија је на хладноћу од других жита, што је чини погодном за садњу касне јесени или ране зиме.",
          },
          {
            id: 2012,
            topic: "Кише",
            text: "Раж може да напредује у подручјима са малим до умереним количинама падавина, око 300 до 600 мм (12 до 24 инча) годишње. Отпорна је на сушу и може да опстане у сувљим подручјима у поређењу са другим житима, али приноси се побољшавају уз умерене падавине током раста.",
          },
        ],
      },
      {
        id: 202,
        topic: "Тло",
        children: [
          {
            id: 2021,
            topic: "pH",
            text: "Раж преферира благо кисела до неутрална тла, са оптималним pH вредностима између 5.5 и 7.0.",
          },
          {
            id: 2022,
            topic: "Тип тла",
            text: "Раж је прилагодљива лошим тлима и добро расте на песковитим, лојним или лаганим глинастим тлима. Њен дубок коренов систем омогућава раст у добро одводњеним тлима са ниским плодношћу, чинећи је погодном за маргинизована земљишта.",
          },
          {
            id: 2023,
            topic: "Припрема тла",
            text: "Пре садње, тло треба да буде обрађено до фине текстуре. Раж може да се сади без интензивне припреме тла, али обогаћивање тла органским материјама или ђубривима побољшаће приносе.",
          },
        ],
      },
      {
        id: 203,
        topic: "Врсте",
        text: "Популарне врсте ражи укључују: -Зимска раж-: Сади се на јесен, расте током зиме и бере се лети. -Пролећна раж-: Сади се рано пролеће и бере се касно лето.",
      },
      {
        id: 204,
        topic: "Садња",
        children: [
          {
            id: 2041,
            topic: "Време",
            text: "Раж се може садити или на јесен (зимска раж) или пролеће (пролећна раж). Зимска раж се обично сади од краја септембра до новембра, док се пролећна раж сади у марту или априлу.",
          },
          {
            id: 2042,
            topic: "Размак",
            text: "Семе ражи треба садити на дубину од 2,5 до 4 цм (1 до 1,5 инча), а размаци између редова треба да буду 15 до 20 цм (6 до 8 инча) да би се омогућио правилан раст и циркулација ваздуха.",
          },
          {
            id: 2043,
            topic: "Која количина семена",
            text: "Препоручена количина семена за ражу је 100 до 150 кг по хектару (90 до 135 фунти по акру), зависно од услова тла и очекиваног приноса.",
          },
        ],
      },
      {
        id: 205,
        topic: "Заливање",
        children: [
          {
            id: 2051,
            topic: "Фаза успостављања",
            text: "Раж треба влагу током фаза клијања и раног раста. Иако је отпорна на сушу, осигуравање довољне влажности тла током почетне фазе је кључно за успостављање јаког кореновог система.",
          },
          {
            id: 2052,
            topic: "Одржане биљке",
            text: "Када се успостави, раж може да поднесе суве услове. Обично захтева мање воде од других житарица као што су пшеница или јечам, али користи од умерене влаге током раста.",
          },
          {
            id: 2053,
            topic: "Избегавање воденог застоја",
            text: "Раж је осетљива на воде која се задржава у тлу. Осигурајте добру дренажу како бисте избегли проблеме као што су труљење корена и успорени раст.",
          },
        ],
      },
      {
        id: 206,
        topic: "Ђубрење",
        children: [
          {
            id: 2061,
            topic: "Нутријенти",
            text: "Раж је ефикасна у коришћењу нутријената из тла, чак и у лошим условима. Међутим, применом ђубрива на бази азота рано у пролеће може се побољшати принос. Фосфор и калијум су такође важни за развој јаких корена и изданака.",
          },
          {
            id: 2062,
            topic: "Термини",
            text: "Ђубрите ражу при садњи и током раних фаза раста, посебно пре фазе разгранатих изданака, за оптималне резултате.",
          },
        ],
      },
      {
        id: 207,
        topic: "Контрола штеточина и болести",
        children: [
          {
            id: 2071,
            topic: "Штеточине",
            text: "Уобичајене штеточине укључују афиде, жичане бубе и листне жица. Интегрисано управљање штеточинама (IPM), ротација усева и биолошке контроле могу помоћи у управљању овим штеточинама.",
          },
          {
            id: 2072,
            topic: "Болести",
            text: "Раж је отпорна на многе болести, али може бити погођена ерготом, прашкастом плесни и рђом. Правилна хигијена поља, сорте отпорне на болести и применом фунгицида могу помоћи у контроли ових болести.",
          },
        ],
      },
      {
        id: 208,
        topic: "Жетва",
        children: [
          {
            id: 2081,
            topic: "Време",
            text: "Зимска раж се обично бере рано лето, око 10 месеци након садње, док се пролећна раж бере касно лето. Жетва се обавља када зрна постану чврста, а биљке пожуте.",
          },
          {
            id: 2082,
            topic: "Метод",
            text: "Раж се може бирати ручно или уз помоћ механичких бербача. Обезбедите правилно сушење пре складиштења како би се избегла кварења.",
          },
        ],
      },
      {
        id: 209,
        topic: "Складиштење",
        text: "Након жетве, зрна ражи треба осушити на влажност од око 12% како би се осигурало безбедно складиштење. Чувајте их на хладном, сувом месту како би се спречило плесни или напада инсеката.",
      },
      {
        id: 210,
        topic: "Проређивање",
        text: "Раж не захтева проређивање, али је правилно распоређивање семена при садњи од суштинске важности како би се избегло претерано густоћу и осигурао здрав раст биљке.",
      },
    ],
  },
  {
    id: 7,
    name: "Пиринач",
    img: cerealsImages.rice,
    inGeneralHeading: "Глобално житарица основна",
    inGeneral: "Пиринач, житарица из врсте Ориза сатива, једна је од најважнијих основних намирница широм света, која служи као примарни извор калорија за више од половине глобалне популације. Узгаја се у различитим условима, од поплављених њива до террасастих брда, и долази у многим сортама, укључујући дугозрне, средње зрне и краткозрне, од којих свака има јединствену текстуру и укус. Нутриционистички, пиринач се углавном састоји од угљених хидрата, што представља значајан извор енергије. Док је бели пиринач широко конзумиран, она пролази кроз обраду која уклања слојеве и клицу, чиме се одузима многим нутријентима. Супротно томе, браон приниач је цело зрно које задржава слојеве и клицу, чинећи је богатијом влакнима, витаминима и минералима. Браон приниач пружа есенцијалне нутријенте као што су витамини Б комплекса, магнезијум, фосфор и селен, који подржавају метаболизам енергије, здравље костју и имунски систем. Пиринач је такође без глутена, што је чини одличним избором за људе са целијакијом или осетљивошћу на глутен. Њен благ укус и свестраност омогућавају употребу у бројним јелима, од пржених јела и сушија до супа и десерта. Пиринач се може служити као прилог, ући у салате или користити као основа за карри и чорбе. Поред своје кулинарске употребе, принач има културно значење у многим друштвима, често симболизујући просперитет и плодност. Она игра централну улогу у традиционалним церемонијама и прославама. Укратко, пиринач је важна основна житарица која пружа енергију, есенцијалне нутријенте и кулинарску свестраност. Њен значај у глобалним дијетама и културама чини је непроцењивим извором хране широм света.",
    topic1: "Нутриција и здравље",
    nutritionText: [
      {
        element: "Енергетска вредност:",
        quantity: 130,
        measurementUnits: "ккал",
        description:
          "– Умерени извор калорија, пружа енергију углавном из угљених хидрата.",
      },
      {
        element: "Масти:",
        quantity: 0.3,
        measurementUnits: "г",
        description:
          "– Врло низак садржај масти, са занемарљивим количинама засићених масти.",
      },
      {
        element: "Засићене масне киселине:",
        quantity: 0.1,
        measurementUnits: "г",
        description:
          "– Изузетно низак садржај засићених масти, што је чини срцу пријатељском.",
      },
      {
        element: "Витамин Б3 (Ниацин):",
        quantity: 1.5,
        measurementUnits: "мг",
        description:
          "– Подржава метаболизам енергије и важан је за здравље коже и нервног система.",
      },
      {
        element: "Натрил:",
        quantity: 1,
        measurementUnits: "мг",
        description: "– Врло низак садржај натријума, што доприноси здрављу срца.",
      },
      {
        element: "Калијум:",
        quantity: 26,
        measurementUnits: "мг",
        description:
          "– Садржи мале количине калијума, који је есенцијалан за функцију мишића и равнотежу течности.",
      },
      {
        element: "Угљени хидрати:",
        quantity: 28.6,
        measurementUnits: "г",
        description: "– Богат угљеним хидратима, пружа брзу енергију.",
      },
      {
        element: "Влакна:",
        quantity: 0.4,
        measurementUnits: "г",
        description:
          "– Низак садржај дијеталних влакана, обично мање него код других целих зрна.",
      },
      {
        element: "Шећер:",
        quantity: 0.1,
        measurementUnits: "г",
        description: "– Садржи минималне природне шећере.",
      },
      {
        element: "Протеини:",
        quantity: 2.7,
        measurementUnits: "г",
        description: "– Пружа умерени извор биљних протеина.",
      },
      {
        element: "Витамин Ц:",
        quantity: 0,
        measurementUnits: "мг",
        description: "– Пиринач није значајан извор витамина Ц.",
      },
      {
        element: "Калцијум:",
        quantity: 10,
        measurementUnits: "мг",
        description:
          "– Пружа мале количине калцијума, што доприноси здрављу костију.",
      },
      {
        element: "Гвожђе:",
        quantity: 0.2,
        measurementUnits: "мг",
        description: "– Садржи минимално гвожђе, мање него неке друге житарице.",
      },
      {
        element: "Витамин Б1 (Тиамин):",
        quantity: 0.07,
        measurementUnits: "мг",
        description:
          "– Подржава метаболизам енергије претварањем угљених хидрата у енергију.",
      },
      {
        element: "Витамин Б6:",
        quantity: 0.1,
        measurementUnits: "мг",
        description: "– Учествује у метаболизму и когнитивном развоју.",
      },
      {
        element: "Витамин Б2 (Рибофлавин):",
        quantity: 0.02,
        measurementUnits: "мг",
        description:
          "– Има улогу у производњи енергије и одржавању здраве коже.",
      },
      {
        element: "Магнезијум:",
        quantity: 12,
        measurementUnits: "мг",
        description:
          "– Садржи мале количине магнезијума, који је важан за функцију мишића и нерва.",
      },
      {
        element: "Цинк:",
        quantity: 0.4,
        measurementUnits: "мг",
        description: "– Пружа минимални цинк, који подржава имунски систем.",
      },
      {
        element: "Витамин Е:",
        quantity: 0.1,
        measurementUnits: "мг",
        description:
          "– Врло низак садржај витамина Е, иако је присутан у малим количинама.",
      },
      {
        element: "Витамин А:",
        quantity: 0,
        measurementUnits: "мг",
        description: "– Пиринач није значајан извор витамина А.",
      }
    ],
    cultivationHeading:
      "Култивација пиринча захтева специфичне услове за оптималан раст и принос. Ево прегледа кључних фактора укључених у узгој пиринча:",
    cultivation: [
      {
        id: 301,
        topic: "Клима",
        children: [
          {
            id: 3011,
            topic: "Температура",
            text: "Пиринач најбоље расте у тропским и субтропским климатама. Треба топле температуре, са идеалним опсегом између 20°C и 35°C (68°F до 95°F). Пиринач је веома осетљив на мраз и хладне температуре, што га чини неприкладним за хладније регије.",
          },
          {
            id: 3012,
            topic: "Падавине",
            text: "Пиринач захтева обилну воду током свог раста. Годишње падавине од 1000 до 1500 мм (39 до 59 инча) су идеалне. У подручјима са мањим падавинама, наводњавање је кључно за успешну култивацију пиринча.",
          },
        ],
      },
      {
        id: 302,
        topic: "Тло",
        children: [
          {
            id: 3021,
            topic: "pH",
            text: "Пиринач преферира лагано кисела тла, са оптималним pH опсегом од 5.5 до 6.5.",
          },
          {
            id: 3022,
            topic: "Тип тла",
            text: "Пиринач најбоље расте на глинистим или лојамским тлима која могу задржати воду. Љуљежне њиве су често потопљене водом, па су тла са добром способношћу задржавања воде пожељна.",
          },
          {
            id: 3023,
            topic: "Припрема тла",
            text: "Пре садње, тло треба да буде орано и изравнано. Љуљежне њиве се обично поплављују пре него што се саднице пиринча пресаде како би се осигурао водом натопљен простор за раст.",
          },
        ],
      },
      {
        id: 303,
        topic: "Врсте",
        text: "Популарне врсте пиринча укључују: -Индика- (дужи зрнца, узгаја се у тропским регијама) -Јапоника- (краћа зрнца, узгаја се у умереним регијама) -Ароматичне врсте- као што су Басмати и Жасмин (цењене због свог ароме).",
      },
      {
        id: 304,
        topic: "Садња",
        children: [
          {
            id: 3041,
            topic: "Време",
            text: "Пиринач се обично сади на почетку сезоне падавина. У тропским регијама то може бити од маја до августа, док се у субтропским регијама пиринач сади од априла до јуна.",
          },
          {
            id: 3042,
            topic: "Методе",
            text: "Пиринач се може узгајати различитим методама: -Пресадња-: Саднице се узгајају у расадницима и пресађују у поплављена поља. -Директно сејање-: Семена се директно сеју у поље.",
          },
          {
            id: 3043,
            topic: "Размак",
            text: "При методу пресађивања, саднице треба да буду распоређене на 15 до 20 см (6 до 8 инча) једна од друге како би се осигурао адекватан проток ваздуха и смањила конкуренција за хранљиве материје.",
          },
        ],
      },
      {
        id: 305,
        topic: "Заливање",
        children: [
          {
            id: 3051,
            topic: "Поплављивање",
            text: "Љуљежне њиве су традиционално поплављене слојем воде (5 до 10 см) током већине раста. Ова метода, позната као 'љуљежна пољопривреда', помаже у контроли корова и штеточина.",
          },
          {
            id: 3052,
            topic: "Наводњавање",
            text: "У подручјима са недостатком падавина, користе се контролисани системи наводњавања за одржавање нивоа воде. Сушни периоди или неправилно заливање могу значајно утицати на принос.",
          },
          {
            id: 3053,
            topic: "Одводњавање",
            text: "Као што се сезона раста завршава, вода се одводњава са њива како би се дозволило пиринчу да сазри и припреми се за жетву.",
          },
        ],
      },
      {
        id: 306,
        topic: "Ђубрење",
        children: [
          {
            id: 3061,
            topic: "Нутријенти",
            text: "Пиринач користи уравнотежен режим ђубрења, при чему је азот најважнији нутријент. Фосфор и калијум су такође есенцијални за развој корена и формирање зрна.",
          },
          {
            id: 3062,
            topic: "Време",
            text: "Ђубрива треба примењивати у кључним фазама раста, као што су пре пресађивања, у фази дољења (када биљка почиње да производи додатне изданке) и у фази цветања.",
          },
        ],
      },
      {
        id: 307,
        topic: "Контрола штеточина и болести",
        children: [
          {
            id: 3071,
            topic: "Штеточине",
            text: "Уобичајене штеточине пиринча укључују смеђе плантарске ускоке, стеблне буше и листне ускоке. Технике интегрисаног управљања штеточинама (IPM), укључујући коришћење природних предатора, ротацију усева и органске пестициде, могу помоћи у управљању овим штеточинама.",
          },
          {
            id: 3072,
            topic: "Болести",
            text: "Пиринач је подложан болестима као што су огаљивање пиринча, блата око лишћа и бактеријски огаљивање лишћа. Ове болести се могу контролисати коришћењем отпорних врста, правилним управљањем водом и применом фунгицида.",
          },
        ],
      },
      {
        id: 308,
        topic: "Жетва",
        children: [
          {
            id: 3081,
            topic: "Време",
            text: "Пиринач је обично спреман за жетву 3 до 6 месеци након садње, у зависности од врсте и климе. Зрна треба да буду чврста и златне боје када се беру.",
          },
          {
            id: 3082,
            topic: "Метода",
            text: "Пиринач се може жетвити ручно или механички. Након сечења, зрна се лупају да би се уклонила са стабљика, а затим се суше како би се смањио садржај влаге.",
          },
        ],
      },
      {
        id: 309,
        topic: "Складиштење",
        text: "Након жетве, зрна пиринча треба осушити до садржаја влаге од око 14% како би се осигурало безбедно складиштење. Складиштити на сувим, хладним местима како би се спречило развијање плесни, нападе инсеката и поквареност.",
      },
      {
        id: 310,
        topic: "Разређивање",
        text: "Пиринач обично не захтева разређивање, али одржавање одговарајућег растојања биљака током пресађивања или директног сејања осигурава здрав развој биљака.",
      },
    ]
  },
  {
    id: 8,
name: "Овас",
img: cerealsImages.oat,
inGeneralHeading: `Нутритивна и свестрана житарица`,
inGeneral: `Овас (Avena sativa) су цела зрна која се конзумирају већ хиљадама година, углавном у облику овсене каше и граноле. Познате су по бројним здравственим предностима и свестраности, овас је основна храна у многим дијетама широм света. Често се хвале због свог јединственог нутритивног профила, што их чини популарним избором за доручак и ужину.
                    Једна од главних предности овса је њихов висок садржај влакана, посебно бета-глукана, растворљивог влакна које је показано да смањује ниво холестерола и побољшава здравље срца. Ова влакна помажу у регулисању нивоа шећера у крви успоравањем варења, што може помоћи у управљању тежином и обезбедити одрживу енергију током дана. Овас је такође богат антиоксидансима, укључујући авенантрамиде, који имају антиинфламаторне особине и могу помоћи у смањењу ризика од хроничних болести.
                    Нутритивно, овас је богат есенцијалним витаминима и минералима, укључујући витамине Б групе (као што су тиамин и фолат), гвожђе, магнезијум и цинк. Ови нутријенти подржавају различите функције у телу, укључујући метаболизам, имунски систем и здравље костју. Овас је такође добар извор протеина у поређењу са другим житарицама, што га чини одличном опцијом за оне који желе да повећају унос протеина.
                    У кулинарству, овас је невероватно свестран. Може се припремити као топла чинија овсене каше, користити у печењу за кексе, мафине и хлеб, или се умешати у смутије за додатну нутрицију. Овсене каше и челични овсени гриз могу се користити и у сланим јелима, као што су овсене ризото или житарице.
                    У резимеу, овас је хранљива и свестрана житарица која нуди бројне здравствене предности. Његов висок садржај влакана, есенцијалних нутријената и кулинарска прилагодљивост чине га вредним додацима у уравнотежену исхрану.`,
topic1: "Нутриција и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 389,
    measurementUnits: "ккал",
    description:
      "– Добар извор калорија, пружајући одрживу енергију уз есенцијалне нутријенте.",
  },
  {
    element: "Масти:",
    quantity: 6.9,
    measurementUnits: "г",
    description:
      "– Садржи здраве масти, укључујући полинезасићене и мононезасићене масти.",
  },
  {
    element: "Засићене масне киселине:",
    quantity: 1.2,
    measurementUnits: "г",
    description: "– Низак садржај засићених масти, што доприноси здрављу срца.",
  },
  {
    element: "Витамин Б3 (Нијасин):",
    quantity: 0.96,
    measurementUnits: "мг",
    description:
      "– Важан за енергетски метаболизам и подржава здравље коже.",
  },
  {
    element: "Натријум:",
    quantity: 2,
    measurementUnits: "мг",
    description: "– Веома низак садржај натријума, што га чини срчаним пријатељским.",
  },
  {
    element: "Калијум:",
    quantity: 358,
    measurementUnits: "мг",
    description:
      "– Добар извор калијума, есенцијалног за функционисање мишића и регулисање крвног притиска.",
  },
  {
    element: "Угљени хидрати:",
    quantity: 66.3,
    measurementUnits: "г",
    description:
      "– Богат комплексним угљеним хидратима, пружајући дуготрајну енергију.",
  },
  {
    element: "Влакна:",
    quantity: 10.6,
    measurementUnits: "г",
    description:
      "– Богат влакнима, посебно бета-глуканом, који подржава здравље дигестивног тракта и помаже у смањењу холестерола.",
  },
  {
    element: "Шећер:",
    quantity: 0.9,
    measurementUnits: "г",
    description:
      "– Садржи минималне природне шећере, што га чини нискошећерном храном.",
  },
  {
    element: "Протеини:",
    quantity: 16.9,
    measurementUnits: "г",
    description:
      "– Добар извор протеина биљног порекла, који подржава поправку и раст мишића.",
  },
  {
    element: "Витамин Ц:",
    quantity: 0,
    measurementUnits: "мг",
    description: "– Овас није значајан извор витамина Ц.",
  },
  {
    element: "Калцијум:",
    quantity: 52,
    measurementUnits: "мг",
    description: "– Пружа нешто калцијума, што доприноси здрављу костију.",
  },
  {
    element: "Гвожђе:",
    quantity: 4.7,
    measurementUnits: "мг",
    description:
      "– Садржи гвожђе, важно за производњу црвених крвних зрнаца.",
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.76,
    measurementUnits: "мг",
    description: "– Подржава енергетски метаболизам и функцију нерва.",
  },
  {
    element: "Витамин Б6:",
    quantity: 0.1,
    measurementUnits: "мг",
    description:
      "– Укључен у здравље мозга и метаболизам протеина.",
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.11,
    measurementUnits: "мг",
    description:
      "– Има улогу у производњи енергије и одржавању здраве коже.",
  },
  {
    element: "Магнезијум:",
    quantity: 138,
    measurementUnits: "мг",
    description:
      "– Добар извор магнезијума, који је кључан за функционисање мишића и производњу енергије.",
  },
  {
    element: "Цинк:",
    quantity: 3.1,
    measurementUnits: "мг",
    description:
      "– Садржи цинк, који подржава имунски систем и поправку ћелија.",
  },
  {
    element: "Витамин Е:",
    quantity: 0.4,
    measurementUnits: "мг",
    description:
      "– Садржи мале количине витамина Е, важног антиоксиданта.",
  },
  {
    element: "Витамин А:",
    quantity: 0,
    measurementUnits: "мг",
    description: "– Овас није значајан извор витамина А.",
  },
],
cultivationHeading:
      "Култивација овса захтева специфичне услове за добар принос и квалитетне зрне. Ево прегледа кључних фактора који су укључени у узгој овса:",
    cultivation: [
      {
        id: 401,
        topic: "Клима",
        children: [
          {
            id: 4011,
            topic: "Температура",
            text: "Овас најбоље расте у хладним, умереним климама. Идеалне температуре су између 15°C и 25°C (59°F до 77°F). Овс је релативно отпоран на мраз и може толерисати хладноћу боље од других житарица као што су кукуруз или пшеница.",
          },
          {
            id: 4012,
            topic: "Падавине",
            text: "Овас захтева умерене падавине, обично између 400 и 800 мм (15 до 31 инча) годишње. У регијама са мањим падавинама, може бити потребно додатно наводњавање да би се одржао здрав раст.",
          },
        ],
      },
      {
        id: 402,
        topic: "Тло",
        children: [
          {
            id: 4021,
            topic: "pH",
            text: "Овас преферира лагано кисела до неутрална тла са pH опсегом од 6.0 до 7.0.",
          },
          {
            id: 4022,
            topic: "Тип тла",
            text: "Овас добро расте на добро дренираним, лојамским тлима, али може толерисати различите типове тла. Треба избегавати тешка глинена тла која задржавају превише воде и песковита тла која се превише брзо одводе.",
          },
          {
            id: 4023,
            topic: "Припрема тла",
            text: "Пре садње, тло треба орати и изравнати да би се осигурао добар простор за сетву. Додавање органских материја као што су компост или добро разложени стајњак може побољшати плодност тла.",
          },
        ],
      },
      {
        id: 403,
        topic: "Врсте",
        text: "Популарне врсте овса укључују: -Авеина сатива- (обично се гаји за људску исхрану). -Авеина бизантина- (користи се у топлијим климама и за сточну храну). -Овс без љуске- (врста са лабавом љуском, лакша за прераду).",
      },
      {
        id: 404,
        topic: "Садња",
        children: [
          {
            id: 4041,
            topic: "Време",
            text: "Овас се обично сеје рано у пролеће, јер може толерисати хладноћу и мраз. У неким регијама, такође се гаји као зимска култура и сади се на јесен.",
          },
          {
            id: 4042,
            topic: "Дубина и растојање",
            text: "Семе овса треба садити на дубину од 2 до 4 цм (0.8 до 1.6 инча). Семе се обично сеје са растојањем од 10 до 15 цм (4 до 6 инча) у редовима, са растојањем између редова од 25 цм (10 инча).",
          },
          {
            id: 4043,
            topic: "Квота сетве",
            text: "За оптималан раст, препоручује се квота сетве од 90 до 120 кг по хектару (80 до 110 фунти по акру).",
          },
        ],
      },
      {
        id: 405,
        topic: "Заливање",
        children: [
          {
            id: 4051,
            topic: "Културе зависне од падавина",
            text: "У регијама са адекватним падавинама, овс може расти као култура која се ослања на падавине без додатног наводњавања.",
          },
          {
            id: 4052,
            topic: "Наводњаване културе",
            text: "У сувљим регијама, овс може требати додатно наводњавање, посебно у критичним фазама као што су цветање и попуњавање зрна.",
          },
          {
            id: 4053,
            topic: "Заливање",
            text: "Овас не подноси водене услове. Потребно је осигурати да поља буду добро одводњена како би се спречила обољења корена и лош развој усева.",
          },
        ],
      },
      {
        id: 406,
        topic: "Ђубрење",
        children: [
          {
            id: 4061,
            topic: "Нутријенти",
            text: "Овас захтева азот, фосфор и калијум за здрав раст. Азот је посебно важан за добар принос и квалитет зрна.",
          },
          {
            id: 4062,
            topic: "Време",
            text: "Ђубрива треба применити пре садње, или азот може бити подељен (једном пре садње и поново током раног раста). Прекомерно ђубрење, посебно са азотом, може довести до полегања (где биљке падају).",
          },
        ],
      },
      {
        id: 407,
        topic: "Контрола штеточина и болести",
        children: [
          {
            id: 4071,
            topic: "Штеточине",
            text: "Честе штеточине које погађају овс укључују аписе, војне гусенице и жуте бубе. Интегрисани систем управљања штеточинама (IPM), укључујући ротацију усева и коришћење природних предатора, може помоћи у контроли популација штеточина.",
          },
          {
            id: 4072,
            topic: "Болести",
            text: "Овас је подложан болестима као што су крунаста рђа, прашкаста плесан и смут. Коришћењем отпорних врста и правилним одржавањем поља може се помоћи у управљању овим проблемима.",
          },
        ],
      },
      {
        id: 408,
        topic: "Жетва",
        children: [
          {
            id: 4081,
            topic: "Време",
            text: "Овас се обично жетви крајем лета, око 100 до 120 дана након садње. Зрна треба да буду потпуно зрела и сува, са садржајем влаге испод 14%, пре жетве.",
          },
          {
            id: 4082,
            topic: "Метод",
            text: "Овас се може жетвити комбинованим жетвама. Након жетве, зрна треба осушити ако је потребно, како би се спречило квариње током складиштења.",
          },
        ],
      },
      {
        id: 409,
        topic: "Складиштење",
        text: "Овс треба складиштити на сувом, хладном месту са садржајем влаге од око 12% или мање. Правилно складиштење помаже у спречавању развоја плесни, штеточина и погоршања квалитета зрна.",
      },
      {
        id: 410,
        topic: "Разређивање",
        text: "Овс обично не захтева разређивање, јер најбоље расте када се посеје на одговарајућу густину. Одржавање исправне квоте сетве осигурава оптималан развој биљака и принос.",
      },
    ],

  }
];

export default zitarice;
