import { fruitsImages } from "./fruitsimages";

const voce = [
    {
        id: 1,
        name: "Јабука",
        img: fruitsImages.apple,
        inGeneralHeading: `Квинтесенцијално воће`,
        inGeneral: `Јабука је јестиви плод бројних врста дрвећа, позната по својим сочним, зеленим или црвеним варијететима. Ово дрво се гаји глобално, а његов плод је нискобуџетан, популаран и широко конзумиран широм света.
    Дрво јабуке, врста дрвета добијена од овог воћа, цењено је због своје трајности и често се користи у производњи намештаја и димљењу хране.
    Сматра се да је дрво јабуке настало у јужном Казахстану, Киргистану, Узбекистану и северозападном делу Кине. Јабуке се узгајају хиљадама година у Азији и Европи и донете су у Северну Америку од стране европских досељеника. Воће има значајну религијску и митолошку важност у многим културама, симболизујући знање, искушење и здравље.
    Јабуке се углавном узгајају помоћу техника калемљења, иако се дивље јабуке лако размножавају из семена. Дрвеће узгојено из семена обично је веће, док су оне калемљене на корен мање. Постоји више од 10.000 познатих сорти јабука, које се разликују по карактеристикама и укусима. Уобичајена употреба укључује конзумацију у свежем стању, кување и производњу јабуковог вина.
    Када је реч о безбедности хране, семенке јабуке садрже амигдалин, који може ослободити цијанид када се метаболише. Иако је количина у семенкама обично мала и велика конзумација је потребна да представља ризик, важно је бити свестан ове токсичности.
    Дрво јабуке и њени плодови подложни су разним претњама, укључујући гљиве, бактерије и штеточине. Године 2010. геном јабуке је секвенционисан, што доприноси истраживањима усмереним на побољшање отпорности на болести и побољшање техника узгоја.
    У 2013. глобална производња јабука достигла је 90,8 милиона тона, а Кина је чинила 49% укупне производње. Ова раширена култивација одражава важност јабуке као основног воћа у исхрани широм света.`,
        topic1: "Исхрана и здравље",
        nutritionText: [
          {
            element: "Енергетска вредност:",
            quantity: 52,
            measurementUnits: "кцал",
            description: "– Воће са мало калорија, које пружа здрав извор енергије.",
          },
          {
            element: "Масти:",
            quantity: 0.2,
            measurementUnits: "г",
            description: "– Веома ниско у мастима, са занемарљивим количинама засићених масти.",
          },
          {
            element: "Засићене масне киселине:",
            quantity: 0.03,
            measurementUnits: "г",
            description: "– Изузетно мало засићених масти, добро за здравље срца.",
          },
          {
            element: "Витамин Б3 (Ниацин):",
            quantity: 0.091,
            measurementUnits: "мг",
            description: "– Подржава метаболизам и важан је за здраву кожу и нерве.",
          },
          {
            element: "Натријум:",
            quantity: 1,
            measurementUnits: "мг",
            description: "– Веома мало натријума, што доприноси здрављу срца.",
          },
          {
            element: "Калијум:",
            quantity: 107,
            measurementUnits: "мг",
            description: "– Добар извор калијума, важног за функцију мишића и баланс течности.",
          },
          {
            element: "Угљени хидрати:",
            quantity: 14,
            measurementUnits: "г",
            description: "– Богато угљеним хидратима, углавном природним шећерима и влакнима.",
          },
          {
            element: "Влакна:",
            quantity: 2.4,
            measurementUnits: "г",
            description: "– Високо у дијететским влакнима, подстиче здраву пробаву.",
          },
          {
            element: "Шећер:",
            quantity: 10.39,
            measurementUnits: "г",
            description: "– Садржи природне шећере, пружајући слатки укус без додатих шећера.",
          },
          {
            element: "Протеини:",
            quantity: 0.3,
            measurementUnits: "г",
            description: "– Садржи мале количине протеина, доприноси дневном уносу.",
          },
          {
            element: "Витамин Ц:",
            quantity: 4.6,
            measurementUnits: "мг",
            description: "– Пружа витамин Ц, важан за функцију имунолошког система и здравље коже.",
          },
          {
            element: "Калцијум:",
            quantity: 6,
            measurementUnits: "мг",
            description: "– Садржи мале количине калцијума, доприноси здрављу костију.",
          },
          {
            element: "Гвожђе:",
            quantity: 0.12,
            measurementUnits: "мг",
            description: "– Садржи минимално гвожђе, важно за транспорт кисеоника у крви.",
          },
          {
            element: "Витамин Б1 (Тиамин):",
            quantity: 0.017,
            measurementUnits: "мг",
            description: "– Подржава метаболизам енергије претварањем угљених хидрата у енергију.",
          },
          {
            element: "Витамин Б6:",
            quantity: 0.041,
            measurementUnits: "мг",
            description: "– Укључен у метаболизам и когнитивни развој.",
          },
          {
            element: "Витамин Б2 (Рибофлавин):",
            quantity: 0.026,
            measurementUnits: "мг",
            description: "– Има улогу у производњи енергије и одржавању здраве коже.",
          },
          {
            element: "Магнезијум:",
            quantity: 5,
            measurementUnits: "мг",
            description: "– Садржи мале количине магнезијума, важног за функцију мишића и живаца.",
          },
          {
            element: "Цинк:",
            quantity: 0.04,
            measurementUnits: "мг",
            description: "– Пружа минимално цинка, који подржава функцију имунолошког система.",
          },
          {
            element: "Витамин Е:",
            quantity: 0.18,
            measurementUnits: "мг",
            description: "– Садржи врло мале количине витамина Е, који има антиоксидативна својства.",
          },
          {
            element: "Витамин А:",
            quantity: 54,
            measurementUnits: "ИЈ",
            description: "– Садржи витамин А, важан за вид и функцију имунолошког система.",
          }
        ],
        cultivationHeading: "Узгој јабука укључује гајење стабала јабуке, процес који захтева специфичне услове и негу како би се произвели квалитетни плодови. Ево прегледа кључних аспеката узгоја јабука",
cultivation: [
  {
    id: 11,
    topic: "Клима",
    children: [
      {
        id: 111,
        topic: "Температура",
        text: "Стабла јабуке најбоље расту у подручјима са хладнијом климом, где доживљавају хладне зиме и умерена лета. Идеалне температуре су између 21°C и 24°C током вегетационе сезоне.",
      },
      {
        id: 112,
        topic: "Хладни сати",
        text: "Јабуке захтевају одређени број хладних сати (сати испод 7°C) током зиме за правилно формирање пупољака и плодова. Потребни хладни сати варирају у зависности од сорте јабуке.",
      },
    ],
  },
  {
    id: 12,
    topic: "Земљиште",
    children: [
      {
        id: 121,
        topic: "pH",
        text: "Стабла јабуке преферирају добро дренирано, иловасто земљиште са pH вредношћу између 6.0 и 7.0.",
      },
      {
        id: 122,
        topic: "Плодност",
        text: "Земљиште би требало да буде богато органском материјом, са адекватним нивоима азота, фосфора и калијума.",
      },
      {
        id: 123,
        topic: "Дренажа",
        text: "Добра дренажа је критична, јер стабла јабуке не толеришу услове натопљености водом. Повишени лежаји или падине могу помоћи са дренажом.",
      },
    ],
  },
  {
    id: 13,
    topic: "Сорте",
    text: "Постоје бројне сорте јабука, укључујући: - Гала, Фуџи, Грени Смит и Ханикрисп (популарне за јело у свежем стању). - Златни Делишес и Џонатан (користе се за печење или кување).",
  },
  {
    id: 14,
    topic: "Садња",
    children: [
      {
        id: 141,
        topic: "Време",
        text: "Најбоље време за садњу стабала јабуке је током мирног периода, обично крајем зиме или почетком пролећа, пре него што почне нови раст.",
      },
      {
        id: 142,
        topic: "Размак",
        text: "Стабла јабуке треба садити на раздаљини од око 4.5 до 5.5 метара како би се обезбедио довољан простор за раст и циркулацију ваздуха.",
      },
      {
        id: 143,
        topic: "Опрашивање",
        text: "Многе сорте јабуке захтевају унакрсно опрашивање са другом сортом како би донеле плод. Садња компатибилних сорти у близини помаже у овоме.",
      },
    ],
  },
  {
    id: 15,
    topic: "Заливање",
    children: [
      {
        id: 151,
        topic: "Редовно заливање",
        text: "Стабла јабуке захтевају редовно заливање, посебно у првим годинама након садње. Када се стабла успоставе, потребно је око 25–50 мм воде недељно током вегетационе сезоне.",
      },
    ],
  },
  {
    id: 16,
    topic: "Орезивање",
    children: [
      {
        id: 161,
        topic: "Облик",
        text: "Правилно орезивање помаже стаблима јабуке да развију чврсту структуру и побољшају циркулацију ваздуха, смањујући ризик од болести. Стабла се обично формирају тако да имају отворен центар или централну структуру лидера.",
      },
      {
        id: 162,
        topic: "Време",
        text: "Орезивање треба обавити током мирног периода (крајем зиме) како би се уклонило суво или болесно дрво и гране које се укрштају или стварају гужву у крошњи.",
      },
    ],
  },
  {
    id: 17,
    topic: "Ђубрење",
    children: [
      {
        id: 171,
        topic: "Нутријенти",
        text: "Примена избалансираних ђубрива (као што је 10-10-10 НПК) обезбеђује потребне нутријенте. Стабла јабуке такође користе од органског компоста или добро разложеног стајњака.",
      },
      {
        id: 172,
        topic: "Време",
        text: "Ђубрење треба обавити почетком пролећа, пре него што почне нови раст.",
      },
    ],
  },
  {
    id: 18,
    topic: "Контрола штеточина и болести",
    text: "-Уобичајени штеточини укључују јабучног мољаца, јабучног црва и ваши. Коришћење стратегија интегрисаног управљања штеточинама, као што су замке, биолошке контроле и органски инсектициди, може помоћи. -Болести као што су јабучна краста, пепелница и пламенац могу се контролисати правилним орезивањем, фунгицидима и одабиром сорти отпорних на болести.",
  },
  {
    id: 19,
    topic: "Жетва",
    children: [
      {
        id: 191,
        topic: "Знаци зрелости",
        text: "Развој боје, чврстина и укус су добри показатељи да су јабуке спремне за бербу.",
      },
    ],
  },
  {
    id: 20.1,
    topic: "Складиштење",
    text: "Након бербе, јабуке могу бити чуване у хладним и влажним условима (између 0°C и 4°C) како би се продужио њихов рок трајања.",
  },
],
    },
    {
        id: 2,
name: "Кајсија",
img: fruitsImages.apricot,
inGeneralHeading: `Прекрасно воће са коштицом`,
inGeneral: `Кајсије су живописно, златно-наранџасто воће које припада породици Prunus, у сродству са бресквама, шљивама и трешњама. Њихова глатка, баршунаста кора обавија меко, сочно месо са слаткастим, али суптилно киселкастим укусом, што их чини популарним избором за свежу конзумацију и кулинарске употребе. Кајсије су богате храњивим састојцима, посебно витаминима А и Ц, који доприносе здрављу очију, подршци имунитету и виталности коже. Такође обезбеђују дијетална влакна која подржавају варење и антиоксидансе попут бета-каротена који помаже у борби против слободних радикала.
                Суве кајсије су популаран ужитак, пружајући концентровану исхрану и дуг рок трајања. Кајсије се користе у разним јелима, од џемова и конзерви до сланих сосова, салата и десерта. Пореклом из региона попут централне Азије и Медитерана, кајсије се вековима узгајају, цењене због својих здравствених користи, освежавајућег укуса и разноврсности у кувању.
                Поред импресивног нутритивног профила, кајсије се традиционално цене због својих лековитих својстава. Верује се да подржавају здравље срца захваљујући садржају калијума који помаже у регулисању крвног притиска и одржавању равнотеже електролита. Природни шећери у кајсијама пружају енергетски подстицај, што их чини идеалним избором за ужину, посебно за спортисте или оне са активним начином живота.
                Кајсијине коштице, које се налазе унутар плода, у неким културама се користе за вађење уља које нуди предности за негу коже и чак за кулинарске сврхе. Ипак, коштице треба конзумирати са опрезом, јер садрже амигдалин, једињење које може ослободити цијанид у телу када се поједе у великим количинама. Кајсије имају кратку сезону раста, обично су доступне крајем пролећа и током лета, а њихова осетљива природа захтева нежно руковање током жетве и транспорта. Упркос томе, њихов освежавајући укус и нутритивно богатство чине их омиљеним воћем широм света.`,
topic1: "Исхрана и Здравље",
nutritionText: [
      {
        element: "Енергетска вредност:",
        quantity: 48,
        measurementUnits: "kcal",
        description: "– Ниска калоријска вредност, што је чини здравим избором за ужину или додатак оброцима."
    },
    {
        element: "Масти:",
        quantity: 0.1,
        measurementUnits: "g",
        description: "– Врло мало масти, што доприноси њеном здравственом профилу."
    },
    {
        element: "Засићене масне киселине:",
        quantity: 0,
        measurementUnits: "g",
        description: "– Не садржи засићене масти, што је погодно за здравље срца."
    },
    {
        element: "Витамин B3 (Ниацин):",
        quantity: 0.6,
        measurementUnits: "mg",
        description: "– Подржава метаболизам енергије и здравље коже."
    },
    {
        element: "Натријум:",
        quantity: 1,
        measurementUnits: "mg",
        description: "– Врло мало натријума, што је корисно за одржавање здравог крвног притиска."
    },
    {
        element: "Калијум:",
        quantity: 259,
        measurementUnits: "mg",
        description: "– Добар извор калијума, који је важан за равнотежу течности и контракције мишића."
    },
    {
        element: "Угљени хидрати:",
        quantity: 12,
        measurementUnits: "g",
        description: "– Садржи природне шећере и дијетална влакна за енергију и варење."
    },
    {
        element: "Влакна:",
        quantity: 2,
        measurementUnits: "g",
        description: "– Садржи дијетална влакна, која подржавају здравље дигестивног система."
    },
    {
        element: "Шећери:",
        quantity: 9,
        measurementUnits: "g",
        description: "– Садржи природне шећере, пружајући слаткаст укус без додатог шећера."
    },
    {
        element: "Протеини:",
        quantity: 1.4,
        measurementUnits: "g",
        description: "– Пружа малу количину протеина биљног порекла."
    },
    {
        element: "Витамин Ц:",
        quantity: 9.2,
        measurementUnits: "mg",
        description: "– Добар извор витамина Ц, важан за функцију имуног система и здравље коже."
    },
    {
        element: "Калцијум:",
        quantity: 18,
        measurementUnits: "mg",
        description: "– Садржи малу количину калцијума, доприносећи здрављу костију."
    },
    {
        element: "Гвожђе:",
        quantity: 0.2,
        measurementUnits: "mg",
        description: "– Садржи гвожђе, које је неопходно за производњу здравих црвених крвних зрнаца."
    },
    {
        element: "Витамин B1 (Тиамин):",
        quantity: 0.02,
        measurementUnits: "mg",
        description: "– Подржава метаболизам енергије."
    },
    {
        element: "Витамин B6:",
        quantity: 0.1,
        measurementUnits: "mg",
        description: "– Важан за метаболизам протеина и здравље мозга."
    },
    {
        element: "Витамин B2 (Рибофлавин):",
        quantity: 0.02,
        measurementUnits: "mg",
        description: "– Доприноси производњи енергије и здрављу коже."
    },
    {
        element: "Магнезијум:",
        quantity: 10,
        measurementUnits: "mg",
        description: "– Пружа малу количину магнезијума, важног за функцију мишића и живаца."
    },
    {
        element: "Цинк:",
        quantity: 0.1,
        measurementUnits: "mg",
        description: "– Садржи траг цинка, који подржава функцију имуног система."
    },
    {
        element: "Витамин Е:",
        quantity: 0.89,
        measurementUnits: "mg",
        description: "– Садржи малу количину витамина Е, важног антиоксиданса."
    },
    {
        element: "Витамин А:",
        quantity: 1926,
        measurementUnits: "IU",
        description: "– Добар извор витамина А, подржавајући вид и здравље имуног система."
    }
],
cultivationHeading: `Узгој кајсија захтева специфичне услове за оптималан раст и производњу плодова. Ево прегледа кључних фактора у узгоју кајсија`,
cultivation: [
  {
    id: 21,
    topic: `Клима`,
    children: [
      {
        id: 211,
        topic: `Температура`,
        text: `Кајсије преферирају умерену климу и осетљиве су на мраз. Захтевају хладну зиму за стање мировања, али су такође подложне касним пролећним мразевима који могу оштетити цветове и смањити принос. Идеална температура током сезоне раста је између 21°C и 27°C (70°F до 80°F).`,
      },
      {
        id: 212,
        topic: `Хладни сати`,
        text: `Већини сорти кајсија је потребно око 300 до 900 хладних сати (сати испод 7°C или 45°F) током зиме како би се осигурао правилан развој пупољака и плода.`,
      },
    ],
  },
  {
    id: 22,
    topic: `Земљиште`,
    children: [
      {
        id: 221,
        topic: `pH`,
        text: `Кајсије најбоље расту у добро дренираном, плодном земљишту са pH вредношћу између 6.0 и 7.5.`,
      },
      {
        id: 222,
        topic: `Тип земљишта`,
        text: `Лака или песковита земљишта су идеална, јер пружају добру дренажу. Кајсије су осетљиве на задржавање воде, па избегавајте земљишта богата глином или подручја склона поплавама.`,
      },
      {
        id: 223,
        topic: `Припрема земљишта`,
        text: `Пре садње, органски материјал као што је компост или добро разложен стајњак треба мешати у земљиште ради побољшања плодности и структуре.`,
      },
    ],
  },
  {
    id: 23,
    topic: `Сорте`,
    text: `Популарне сорте кајсија укључују: - Moorpark, Tilton и Goldcot (познате по слатком укусу и прилагодљивости). - Golden Delicious и Jonathan (користе се за печење или кување).`,
  },
  {
    id: 24,
    topic: `Садња`,
    children: [
      {
        id: 241,
        topic: `Време`,
        text: `Најбоље време за садњу кајсија је током сезоне мировања (касна зима до рано пролеће) пре него што нови раст почне.`,
      },
      {
        id: 242,
        topic: `Размак`,
        text: `Дрвеће треба да буде размакнуто око 6 до 7 метара (20 до 23 стопе) како би се обезбедио довољан простор за раст и проток ваздуха.`,
      },
      {
        id: 243,
        topic: `Опрашивање`,
        text: `Многе сорте кајсија су самоплодне, али садња више од једне сорте може повећати принос и побољшати квалитет плода.`,
      },
    ],
  },
  {
    id: 25,
    topic: `Заливање`,
    children: [
      {
        id: 251,
        topic: `Фаза успостављања`,
        text: `Кајсије захтевају редовно заливање током првих неколико година након садње како би се успоставио јак корен.`,
      },
      {
        id: 252,
        topic: `Зрела стабла`,
        text: `Једном када се стабла учврсте, треба их заливати дубоко, али ретко, како би се подстакао дубоки корен. Кајсије захтевају око 500 до 800 мм (20 до 31 инч) воде годишње.`,
      },
      {
        id: 253,
        topic: `Избегавање превише воде`,
        text: `Прекомерна влажност може довести до труљења корена и других гљивичних обољења.`,
      },
    ],
  },
  {
    id: 26,
    topic: `Орезивање`,
    children: [
      {
        id: 261,
        topic: `Облик`,
        text: `Кајсије се обично орезују у облик отвореног центра, што омогућава сунчевој светлости да допре до центра стабла и подстиче добру циркулацију ваздуха.`,
      },
      {
        id: 262,
        topic: `Време`,
        text: `Орезивање треба обављати током сезоне мировања (касна зима) ради уклањања мртвих, болесних или пренатрпаних грана. Избегавајте орезивање у влажним условима ради смањења ризика од болести.`,
      },
    ],
  },
  {
    id: 27,
    topic: `Ђубрење`,
    children: [
      {
        id: 271,
        topic: `Нутријенти`,
        text: `Кајсије имају користи од редовног ђубрења са уравнотеженим ђубривом (нпр. 10-10-10 NPK) или органским компостом.`,
      },
      {
        id: 272,
        topic: `Време`,
        text: `Ђубриво треба примењивати рано у пролеће, непосредно пре него што нови раст почне. Избегавајте обилно ђубрење касно у сезони раста, јер ово може довести до прекомерног вегетативног раста на штету производње плодова.`,
      },
    ],
  },
  {
    id: 28,
    topic: `Контрола штеточина и болести`,
    children: [
      {
        id: 281,
        topic: `Штеточине`,
        text: `Уобичајени штеточине кајсија укључују лисне ваши, гриње, гусенице и гриње на гранама. Интегрисано управљање штеточинама (IPM), као што је коришћење корисних инсеката и органских инсектицида, може помоћи у контроли штеточина.`,
      },
      {
        id: 282,
        topic: `Болести`,
        text: `Кајсије су подложне болестима као што су трулеж плодова, бактеријски рак, бактеријска пламењача и болест шупљина на листовима. Превентивне мере укључују правилно орезивање, добру циркулацију ваздуха и коришћење фунгицида када је потребно.`,
      },
    ],
  },
  {
    id: 29,
    topic: `Жетва`,
    children: [
      {
        id: 291,
        topic: `Време`,
        text: `Кајсије су обично спремне за жетву крајем пролећа до почетка лета, у зависности од сорте и климе.`,
      },
      {
        id: 292,
        topic: `Знаци зрелости`,
        text: `Зреле кајсије су обично златно-наранџасте, меке на додир и мирисне. Треба их брати када су потпуно зреле за најбољи укус.`,
      },
      {
        id: 293,
        topic: `Руковање`,
        text: `Кајсије су осетљиве и лако се модрирају, тако да их треба пажљиво руковати и пажљиво чувати након бербе.`,
      },
    ],
  },
  {
    id: 30.2,
    topic: `Чување`,
    text: `Кајсије имају релативно кратак рок трајања и најбоље су за конзумацију свеже. Ако је потребно, могу се чувати на хладном месту (0°C до 4°C или 32°F до 39°F) око недељу дана.`,
    children: [
      {
        id: 30.21,
        topic: `Очување`,
        text: `Кајсије се могу и сушити, конзервирати или прерадити у џемове и конзерве за продужење употребе након сезоне свежих плодова.`,
      },
    ],
  },
  {
    id: 31.2,
    topic: `Проређивање`,
    text: `Кајсије често производе више плодова него што стабло може да подржи, што доводи до мањег, мање квалитетног плода. Проређивање (уклањање неког незрелог плода) у рано пролеће може побољшати величину и квалитет плода.`,
  },
],
    },
    {
        id: 3,
name: "Банана",
img: fruitsImages.banana,
inGeneralHeading: "Природни и практични суперфрут",
inGeneral: `Банане су један од најшире конзумираних плодова на свету, познате по свом слатком укусу, меканој текстури и свестраности. Припадају роду Musa, а углавном се узгајају у тропским регионима, с тим да су Индија, Бразил и Еквадор међу водећим произвођачима. Лако су препознатљиве по издуженом облику, глаткој жутој кори (када су зреле) и кремасто белом месу.
                Банане су богат извор есенцијалних хранљивих материја, посебно калијума, који је важан за одржавање правилне функције срца и регулацију крвног притиска. Такође садрже значајне количине витамина Ц, витамина Б6 и дијеталних влакана, што помаже варењу и промовише здраву цревну флору. Банане су природно ниске у мастима и холестеролу, што их чини здравом ужином за срце.
                Спортисти често фаворизују банане због брзе енергетске подршке коју пружају природним шећерима као што су глукоза, фруктоза и сахароза. Због тога су идеална ужина пре или после тренинга, помажући у опоравку мишића и равнотежи електролита. Банане су такође познате као нежне за стомак и често се препоручују онима који се опорављају од пробавних тегоба.
                Поред тога што се једу сирове, банане су изузетно свестране у кувању. Могу се мешати у смутије, печене у хлеб, мафине или колаче и користити у сланим јелима као што су кари или гриловане као десерт. Незреле банане, познате као плантаини, су основна храна у многим тропским кухињама, често се прже или кувају. Са својим нутритивним предностима и кулинарском флексибилношћу, банане су заиста глобална основа уживања у разним облицима.`,
topic1: "Нутриција и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 89,
    measurementUnits: "ккал",
    description: "– Ниско калорично воће, које пружа брз извор енергије.",
  },
  {
    element: "Масти:",
    quantity: 0.3,
    measurementUnits: "г",
    description: "– Веома мало масти, са занемарљивим количинама засићених масти.",
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0.1,
    measurementUnits: "г",
    description: "– Изузетно ниске у засићеним мастима, што је корисно за здравље срца.",
  },
  {
    element: "Витамин Б3 (Ниацин):",
    quantity: 0.665,
    measurementUnits: "мг",
    description: "– Подржава метаболизам и важан је за здравље коже и нерава.",
  },
  {
    element: "Натријум:",
    quantity: 1,
    measurementUnits: "мг",
    description: "– Веома мало натријума, што је корисно за здравље срца.",
  },
  {
    element: "Калијум:",
    quantity: 358,
    measurementUnits: "мг",
    description: "– Добар извор калијума, који је неопходан за функцију мишића и баланс течности.",
  },
  {
    element: "Угљени хидрати:",
    quantity: 22.8,
    measurementUnits: "г",
    description: "– Богате угљеним хидратима, првенствено из природних шећера и влакана.",
  },
  {
    element: "Влакна:",
    quantity: 2.6,
    measurementUnits: "г",
    description: "– Висок садржај дијеталних влакана, који подстичу здраво варење.",
  },
  {
    element: "Шећер:",
    quantity: 12.2,
    measurementUnits: "г",
    description: "– Садржи природне шећере, пружајући сладак укус без додатих шећера.",
  },
  {
    element: "Протеини:",
    quantity: 1.1,
    measurementUnits: "г",
    description: "– Садржи мале количине протеина, који доприносе дневном уносу.",
  },
  {
    element: "Витамин Ц:",
    quantity: 8.7,
    measurementUnits: "мг",
    description: "– Обезбеђује витамин Ц, важан за функцију имуног система и здравље коже.",
  },
  {
    element: "Калцијум:",
    quantity: 5,
    measurementUnits: "мг",
    description: "– Садржи мале количине калцијума, који је важан за здравље костију.",
  },
  {
    element: "Гвожђе:",
    quantity: 0.26,
    measurementUnits: "мг",
    description: "– Садржи минималне количине гвожђа, важно за транспорт кисеоника у крви.",
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.031,
    measurementUnits: "мг",
    description: "– Подржава метаболизам енергије претварањем угљених хидрата у енергију.",
  },
  {
    element: "Витамин Б6:",
    quantity: 0.367,
    measurementUnits: "мг",
    description: "– Укључен у метаболизам и когнитивни развој.",
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.073,
    measurementUnits: "мг",
    description: "– Има улогу у производњи енергије и одржавању здраве коже.",
  },
  {
    element: "Магнезијум:",
    quantity: 27,
    measurementUnits: "мг",
    description: "– Садржи мале количине магнезијума, важног за функцију мишића и нерава.",
  },
  {
    element: "Цинк:",
    quantity: 0.15,
    measurementUnits: "мг",
    description: "– Пружа минималну количину цинка, који подржава имунолошку функцију.",
  },
  {
    element: "Витамин Е:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Садржи веома мале количине витамина Е, који има антиоксидативна својства.",
  },
  {
    element: "Витамин А:",
    quantity: 64,
    measurementUnits: "IU",
    description: "– Садржи витамин А, важан за вид и функцију имуног система.",
  }
],
cultivationHeading: `Банане су један од најпопуларнијих воћа на свету и углавном се узгајају у тропским регијама. Обично се узгајају на великим плантажама, али се такође могу гајити и у мањим баштама. Ево прегледа узгоја банана.`,
cultivation: [
  {
    id: 21,
    topic: "Клима",
    children: [
      {
        id: 211,
        topic: "Температура",
        text: "Банане најбоље расту у тропским и субтропским климама. Идеалне температуре за раст банана су између 26°C и 30°C (79°F до 86°F). Врло су осетљиве на хладне температуре и мраз, који могу озбиљно оштетити биљку.",
      },
      {
        id: 212,
        topic: "Падавине",
        text: "Банане захтевају константну снабдевеност водом и најбоље расту у подручјима са годишњим падавинама између 1,500 и 2,500 мм (60 до 100 инча). У сувљим подручјима обично је потребна наводњавање да би се осигурао одговарајући ниво влажности.",
      },
    ],
  },
  {
    id: 22,
    topic: "Земљиште",
    children: [
      {
        id: 221,
        topic: "pH",
        text: "Банане најбоље расту у земљишту са pH вредношћу између 5.5 и 7.0, што је благо кисело до неутрално.",
      },
      {
        id: 222,
        topic: "Тип земљишта",
        text: "Банане преферирају добро дренирана, лојама или песковита земљишта. Оне су осетљиве на застоје воде, па треба избегавати садњу у тешким глинестим или лоше дренираним земљиштима.",
      },
      {
        id: 223,
        topic: "Припрема земљишта",
        text: "Пре садње, корисно је додати органски материјал као што је компост или добро разложен стајњак како би се побољшала структура и плодност земљишта.",
      },
    ],
  },
  {
    id: 23,
    topic: "Сорте",
    text: `Популарне сорте банана укључују:
                              - Кавендиш (најшире гајена сорта за комерцијалну производњу).
                              - Платане (често се користе за кување).
                              - Црвене банане (познате по својој јединственој боји и укусу).`,
  },
  {
    id: 24,
    topic: "Садња",
    children: [
      {
        id: 241,
        topic: "Време",
        text: "Банане је најбоље садити на почетку сезоне падавина како би се обезбедила довољна влажност за успостављање биљке.",
      },
      {
        id: 242,
        topic: "Размак",
        text: "Садите изданке или младе биљке банана на удаљености од 3 метра (10 стопа), а редови треба да буду на удаљености од 4 метра (13 стопа) како би се омогућио одговарајући раст и циркулација ваздуха.",
      },
      {
        id: 243,
        topic: "Пропагација",
        text: "Банане се пропагирају изданцима (младе изданке) или биљкама добијеним течно културом, што омогућава уједначен раст и отпорност на болести.",
      },
    ],
  },
  {
    id: 25,
    topic: "Заливање",
    children: [
      {
        id: 251,
        topic: "Фаза успостављања",
        text: "Младе биљке банана захтевају редовно заливање како би успоставиле јак коренов систем. Осигурајте да земљиште буде влажно, али не превише залијевано.",
      },
      {
        id: 252,
        topic: "Зреле биљке",
        text: "Након што се стабла учврсте, банане треба залијевати дубоко, али ретко, јер захтевају око 1,200 до 2,000 мм (47 до 79 инча) воде годишње.",
      },
      {
        id: 253,
        topic: "Избегавање превелике влаге",
        text: "Прекомерно заливање може довести до труљења корена и других гљивичних болести, па је важно одржавати добру дренажу и избегавати водену стагнацију.",
      },
    ],
  },
  {
    id: 26,
    topic: "Орезивање",
    children: [
      {
        id: 261,
        topic: "Орезивање листова",
        text: "Уклоните мртве или оштећене листове како бисте побољшали циркулацију ваздуха и смањили ризик од штеточина и болести. Правилно орезивање помаже биљци да усмери енергију на развој плода.",
      },
    ],
  },
  {
    id: 27,
    topic: "Ђубрење",
    children: [
      {
        id: 271,
        topic: "Нутријенти",
        text: "Банане захтевају редовно ђубрење ђубривима богате азотом и уравнотежену мешавину фосфора и калијума за здрав раст и производњу плода.",
      },
      {
        id: 272,
        topic: "Време",
        text: "Ђубрите банане свака 2-3 месеца током сезоне раста. Органски материјал као што је компост или стајњак такође може бити применен за побољшање плодности земљишта.",
      },
    ],
  },
  {
    id: 28,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 281,
        topic: "Штеточине",
        text: "Уобичајени штеточине укључују бананске жичаре, апхије и нематоде. Стратегије интегрисаног управљања штеточинама (IPM), као што је коришћење корисних инсеката и органских пестицидa, помажу у контроли популације штеточина.",
      },
      {
        id: 282,
        topic: "Болести",
        text: "Банане су подложне болестима као што су Панамска болест, црни сигатока и вирус бананског чворова (BBTV). Врсте отпорне на болести и одговарајуће хигијенске мере важни су за управљање болестима.",
      },
    ],
  },
  {
    id: 29,
    topic: "Берба",
    children: [
      {
        id: 291,
        topic: "Време",
        text: "Банане су обично спремне за бербу 9 до 12 месеци након садње, у зависности од сорте и услова раста. Плодови се беру док су још зелени и дозревају после бербе.",
      },
      {
        id: 292,
        topic: "Знаци зрелости",
        text: "Банане се беру када су плодови округли, а ивице више нису оштре. Кожа ће прелазити из зелене у жуту док дозревају након бербе.",
      },
      {
        id: 293,
        topic: "Руковање",
        text: "Банане треба пажљиво руковати како би се избегло модрирање, које може утицати на рок трајања и тржишну вредност.",
      },
    ],
  },
  {
    id: 30.2,
    topic: "Чување",
    text: "Банане се могу чувати на собној температури ради дозревања. Да бисте успорили процес дозревања, чувате их на хладнијим температурама (око 13°C или 55°F), али избегавајте хлађење у фрижидеру, јер то може узроковати повреде од хладноће.",
    children: [
      {
        id: 30.21,
        topic: `Прерада`,
        text: "Банане се такође могу прерадити у производе као што су чипс од банане, пире или суве банане како би се продужио њихов рок трајања.",
      },
    ],
  },
  {
    id: 31.2,
    topic: "Разређивање",
    text: "Разређивање банана подразумева уклањање вишка изданака како би се одржала удаљеност биљака и осигурало да се енергија усмерава на производњу висококвалитетних плодова.",
  },
],
    }, 
    {
        id: 4,
name: "Купина",
img: fruitsImages.blackberry,
inGeneralHeading: `Нутритивни благодети купине`,
inGeneral: `Купине су тамно, сочне бобице из рода Рубус, које се обично налазе у умереним подручјима Северне Америке, Европе и Азије. Познате су по дубокој љубичасто-црној боји и малим, груписаним друпелама, купине нуде слатко-киселкаст укус који их чини популарним у свежим и кулинарским употребама. Ове бобице нису само укусне, већ су и богат извор здравствених користи.
                Купине су богате есенцијалним витаминима и минералима, нарочито витамином Ц, витамином К и манганом, који подржавају имунски систем, здравље костију и производњу колагена. Такође су одличан извор дијететских влакана, која помажу у варењу и промовишу здравље црева. Тамна пигментација купина долази од антхоцијанина, јаког антиоксиданса који помажу у смањењу упале и штите тело од оксидативног стреса, потенцијално смањујући ризик од хроничних болести као што су болести срца и рак.
                Поред што се конзумирају свеже, купине се често користе у џемовима, пита, колачима и смутијима. Добро се слажу са слатким и сланим јелима, као што су салате, јогурт или печено месо. Због високог садржаја антиоксиданса, купине су постале популаран састојак у здравим рецептима и пићима.
                Купине су релативно лаке за узгајање, често се налазе у дивљим шумарцима или кућним баштама. Међутим, имају кратак рок трајања и осетљиве су, захтевају пажљиво руковање током бербе. Њихова комбинација укуса, свестраности и нутритивних предности чини купине воћем које се воли у многим кулинарским традицијама широм света.`,
topic1: "Нутриција и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 43,
    measurementUnits: "ккал",
    description: "– Ниска калоричност, што их чини одличним избором за здраву ужину."
  },
  {
    element: "Масти:",
    quantity: 0.5,
    measurementUnits: "г",
    description: "– Веома ниско у мастима, што доприноси њиховом здравом профилу."
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0,
    measurementUnits: "г",
    description: "– Не садрже засићене масти, што подржава здравље срца."
  },
  {
    element: "Витамин Б3 (Нијасин):",
    quantity: 1.2,
    measurementUnits: "мг",
    description: "– Подржава метаболизам енергије и здравље коже."
  },
  {
    element: "Натријум:",
    quantity: 1,
    measurementUnits: "мг",
    description: "– Веома низак у натријуму, користан за одржавање здравог крвног притиска."
  },
  {
    element: "Калијум:",
    quantity: 162,
    measurementUnits: "мг",
    description: "– Добар извор калијума, који је важан за равнотежу течности и контракције мишића."
  },
  {
    element: "Угљени хидрати:",
    quantity: 9.6,
    measurementUnits: "г",
    description: "– Садржи природне шећере и дијететска влакна за енергију и варење."
  },
  {
    element: "Влакна:",
    quantity: 5.3,
    measurementUnits: "г",
    description: "– Богата дијететским влакнима, која промовишу здраво варење."
  },
  {
    element: "Шећер:",
    quantity: 4.9,
    measurementUnits: "г",
    description: "– Садржи природне шећере, нудећи слатки укус без доданих шећера."
  },
  {
    element: "Протеини:",
    quantity: 1.4,
    measurementUnits: "г",
    description: "– Пружа мали износ биљних протеина."
  },
  {
    element: "Витамин Ц:",
    quantity: 21,
    measurementUnits: "мг",
    description: "– Добар извор витамина Ц, важан за имунски систем и здравље коже."
  },
  {
    element: "Калцијум:",
    quantity: 29,
    measurementUnits: "мг",
    description: "– Пружа мали износ калцијума, што доприноси здрављу костију."
  },
  {
    element: "Гвожђе:",
    quantity: 0.6,
    measurementUnits: "мг",
    description: "– Садржи гвожђе, неопходно за здраву производњу црвених крвних зрнаца."
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.02,
    measurementUnits: "мг",
    description: "– Подржава метаболизам енергије."
  },
  {
    element: "Витамин Б6:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Важан за метаболизам протеина и здравље мозга."
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.03,
    measurementUnits: "мг",
    description: "– Доприноси производњи енергије и здрављу коже."
  },
  {
    element: "Магнезијум:",
    quantity: 20,
    measurementUnits: "мг",
    description: "– Пружа мали износ магнезијума, важан за функцију мишића и нерва."
  },
  {
    element: "Цинк:",
    quantity: 0.2,
    measurementUnits: "мг",
    description: "– Садржи трагове цинка, који подржавају имунски систем."
  },
  {
    element: "Витамин Е:",
    quantity: 0.87,
    measurementUnits: "мг",
    description: "– Садржи мале количине витамина Е, важног антиоксиданса."
  },
  {
    element: "Витамин А:",
    quantity: 305,
    measurementUnits: "ИУ",
    description: "– Садржи бета-каротен, који подржава здравље вида и имунски систем."
  }
],
cultivationHeading: `Купине су популарне воће познато по свом слатко-кисела укусу и обично се узгајају у умереним регијама. Могу се гајити како на комерцијалним фармама, тако и у баштама, и релативно су лаке за гајење у поређењу са другим воћем. Ево прегледа узгајања купина.`,
cultivation: [
  {
    id: 21,
    topic: "Клима",
    children: [
      {
        id: 211,
        topic: "Температура",
        text: "Купине добро расту у умерено топлим климама. Идеалне температуре за производњу купина су између 15°C и 30°C (59°F до 86°F). Могу да поднесу благи мраз, али треба их заштитити од екстремно хладног времена и касних пролећних мразева који могу оштетити нови раст.",
      },
      {
        id: 212,
        topic: "Светлост",
        text: "Купине захтевају пуну сунчеву светлост (барем 6 сати директне светлости дневно) како би произвеле велики принос и осигурале добар квалитет плода. Делимична сенка може смањити величину и слаткоћу плода.",
      },
    ],
  },
  {
    id: 22,
    topic: "Тло",
    children: [
      {
        id: 221,
        topic: "pH",
        text: "Купине воле благо кисела до неутрална тла, са pH вредношћу између 5.5 и 7.0. Треба урадити тестове земљишта како би се прилагодиле pH вредности ако је потребно.",
      },
      {
        id: 222,
        topic: "Тип тла",
        text: "Добро дренирана, лојана тла су идеална за купине. Могу поднети песковита или глинена тла, под условом да се побољшају органском материјом ради побољшања дренажних и плодних својстава.",
      },
      {
        id: 223,
        topic: "Припрема тла",
        text: "Пре садње, треба унети компост или другу органску материју у земљиште да би се повећала плодност и побољшала задржавање влаге. Подигнуте гредице или монтне редове могу се користити у подручјима са лошом дренажом.",
      },
    ],
  },
  {
    id: 23,
    topic: "Врсте",
    text: `Популарне врсте купина укључују:
                              - 'Честер', 'Навахо' и 'Апач' (без трнова, за кућне баште).
                              - 'Марион' и 'Црни дијамант' (познати по комерцијалној употреби и висококвалитетним плодовима).`,
  },
  {
    id: 24,
    topic: "Садња",
    children: [
      {
        id: 241,
        topic: "Време",
        text: "Најбоље време за садњу купина је у рано пролеће, након последњег мраза. Садња на јесен је такође могућа у топлијим климама.",
      },
      {
        id: 242,
        topic: "Размак",
        text: "Купине треба садити на растојању од 1.2 до 1.8 метара (4 до 6 стопа) у редовима који су удаљени око 2.4 метра (8 стопа). Одговарајући размак осигурава добар проток ваздуха и смањује ризик од болести.",
      },
      {
        id: 243,
        topic: "Пропагирање",
        text: "Купине се могу пропагирати из коренских резница, слојењем врхова или ткивном културом. Врсте без трнова су лакше за одржавање и обично се користе у кућним баштама.",
      },
    ],
  },
  {
    id: 25,
    topic: "Заливање",
    children: [
      {
        id: 251,
        topic: "Фаза успостављања",
        text: "Младе купине захтевају константну влажност током прве године раста како би се успоставио снажан коренов систем. Треба их дубоко залијевати, осигуравајући да земљиште остане влажно, али не и претрпано водом.",
      },
      {
        id: 252,
        topic: "Одрасле биљке",
        text: "Када се успоставе, купине треба редовно залијевати, посебно током сувих периода. Одрасле биљке захтевају око 25 до 50 мм (1 до 2 инча) воде недељно током вегетационог периода.",
      },
      {
        id: 253,
        topic: "Избегавање прекомерног заливања",
        text: "Прекомерно заливање може довести до труљења корена и гљивичних болести, па је важно осигурати добру дренажу и избегавати водом натопљена стања.",
      },
    ],
  },
  {
    id: 26,
    topic: "Орезивање",
    children: [
      {
        id: 261,
        topic: "Флоракани и примокани",
        text: "Купине рађају плодове на двогодишњим гранама (флораканима). После бербе, орезујте истрошене флоракане како бисте подстакли нови раст (примокане), који ће рађати плодове следеће године.",
      },
      {
        id: 262,
        topic: "Време орезивања",
        text: "Орезивање купина треба обавити касном зимом или раним пролећем, пре него што нови раст почне. Летње орезивање може бити потребно за уклањање мртвих или оштећених грана.",
      },
    ],
  },
  {
    id: 27,
    topic: "Ђубрење",
    children: [
      {
        id: 271,
        topic: "Нутријенти",
        text: "Купине користе редовне примене уравнотеженог ђубрива, као што је 10-10-10 NPK, или органски компост. Ђубрење помаже у промоцији снажног раста и производње плодова.",
      },
      {
        id: 272,
        topic: "Време примене",
        text: "Ђубрење треба обавити у раном пролећу и поново након плодоношења како би се подржао раст грана и развој плодова. Избегавајте прекомерно ђубрење, које може довести до прекомерног вегетативног раста на штету производње плодова.",
      },
    ],
  },
  {
    id: 28,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 281,
        topic: "Штеточине",
        text: "Уобичајене штеточине које нападају купине укључују афиде, паукове гриње и борце. Користите стратегије интегрисаног управљања штеточинама (IPM), као што су увођење корисних инсеката и употреба органских пестицида.",
      },
      {
        id: 282,
        topic: "Болести",
        text: "Купине су подложне болестима као што су антракноза, рђа и труљење грана. Правилно орезивање, добра циркулација ваздуха и фунгициди када је то потребно могу помоћи у превенцији ових проблема.",
      },
    ],
  },
  {
    id: 29,
    topic: "Берба",
    children: [
      {
        id: 291,
        topic: "Време бербе",
        text: "Купине се обично беру средином до краја лета. Тачно време зависи од врсте и климе. Купине не дозревају након бербе, па их треба брати када су у потпуности зреле.",
      },
      {
        id: 292,
        topic: "Знаци зрелости",
        text: "Зреле купине су пуне, тамне боје и лако се одвајају од биљке. Треба да буду слатке и благо мекане када се стисну.",
      },
      {
        id: 293,
        topic: "Руковање",
        text: "Купине су деликатне и лако се могу смачкати. Руке их треба пажљиво носити током бербе и складиштења како би се избегло оштећење.",
      },
    ],
  },
  {
    id: 30.2,
    topic: "Складиштење",
    text: "Свежи плодови купине могу се чувати у фрижидеру до 3-5 дана. Да би се продужио рок трајања, могу се смрзавати, сушити или правити од њих џемови, желе или конзерве.",
    children: [
      {
        id: 30.21,
        topic: `Очување`,
        text: "За смрзавање, распоредите купине у један слој на плочи за печење и замрзните их пре него што их пребаците у херметички затворене посуде или врећице за смрзавање.",
      },
    ],
  },
  {
    id: 31.2,
    topic: "Разређивање",
    text: "Разређивање купина подразумева уклањање неких грана како би се смањила гужва и побољшао квалитет плода и проток ваздуха. Ово треба урадити рано пролеће пре него што нови раст почне.",
  },
],
    },
    {
        id: 5,
name: "Боровница",
img: fruitsImages.blueberry,
inGeneralHeading: "Нутритивни моћни извор",
inGeneral: `Боровнице, мале и живописне, основни су део многих исхрана због свог импресивног нутритивног профила и бројних здравствених користи. Научно познате као Vaccinium corymbosum, ове бобице су богате антиоксидансима, нарочито антхоцијанинима, који им дају дубоку плаву боју. Антиоксиданси помажу у борби против оксидативног стреса, смањујући ризик од хроничних болести и подржавајући свеукупно здравље.
                Једна од најзначајнијих користи боровница је њихова улога у здрављу срца. Истраживања су показала да редовна конзумација може смањити крвни притисак и ниво холестерола, што доприноси здрављу кардиоваскуларног система. Поред тога, боровнице су нискокалоричне, али богате дијететским влакнима, што их чини одличним избором за контролу тежине. Садржај влакана помаже у варењу и промовише осећај ситости.
                Боровнице су такође повезане са здрављем мозга. Истраживања показују да антиоксиданси у боровницама могу побољшати когнитивну функцију, потенцијално одлажући старосно повезано погоршање. Богате су витамином Ц и К, који подржавају имунски систем и здравље костију.
                Укључивање боровница у исхрану је једноставно. Могу се јести свеже, смрзнуте или осушене, а могу се додавати у смутије, јогурт, салате и пецива. Као свестран састојак, могу побољшати како слатка, тако и слана јела.
                Укратко, боровнице нису само укусан десерт; оне су нутритивни моћни извор који је препун здравствених користи. Редовно укључивање боровница у вашу исхрану може допринети побољшању здравља и благостања, чинећи их паметним избором за сваки план оброка.`,
topic1: "Нутриција и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 57,
    measurementUnits: "ккал",
    description: "– Нискокалорично воће, што га чини одличном ужином за енергију без прекомерних калорија."
  },
  {
    element: "Масти:",
    quantity: 0.3,
    measurementUnits: "г",
    description: "– Веома ниско у мастима, са минималним засићеним мастима."
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0.0,
    measurementUnits: "г",
    description: "– Садржи занемарљиве количине засићених масти, што подржава здравље срца."
  },
  {
    element: "Витамин Б3 (Нијасин):",
    quantity: 0.418,
    measurementUnits: "мг",
    description: "– Важан за метаболизам енергије и одржавање здраве коже и нерва."
  },
  {
    element: "Натријум:",
    quantity: 1,
    measurementUnits: "мг",
    description: "– Веома низак у натријуму, доприноси здрављу срца."
  },
  {
    element: "Калијум:",
    quantity: 77,
    measurementUnits: "мг",
    description: "– Добар извор калијума, који је есенцијалан за функцију мишића и равнотежу течности."
  },
  {
    element: "Угљени хидрати:",
    quantity: 14.5,
    measurementUnits: "г",
    description: "– Богате угљеним хидратима, углавном из природних шећера и влакана."
  },
  {
    element: "Влакна:",
    quantity: 2.4,
    measurementUnits: "г",
    description: "– Висок садржај дијететских влакана, што подржава здраво варење."
  },
  {
    element: "Шећер:",
    quantity: 10,
    measurementUnits: "г",
    description: "– Садржи природне шећере, који обезбеђују слаткоћу без доданих шећера."
  },
  {
    element: "Протеини:",
    quantity: 0.7,
    measurementUnits: "г",
    description: "– Садржи мале количине протеина, који доприносе дневном уносу."
  },
  {
    element: "Витамин Ц:",
    quantity: 9.7,
    measurementUnits: "мг",
    description: "– Обезбеђује витамин Ц, који је важан за имунски систем и здравље коже."
  },
  {
    element: "Калцијум:",
    quantity: 6,
    measurementUnits: "мг",
    description: "– Садржи мале количине калцијума, што доприноси здрављу костију."
  },
  {
    element: "Гвожђе:",
    quantity: 0.28,
    measurementUnits: "мг",
    description: "– Садржи минималне количине гвожђа, важног за транспорт кисеоника у крви."
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.020,
    measurementUnits: "мг",
    description: "– Подржава метаболизам енергије претварањем угљених хидрата у енергију."
  },
  {
    element: "Витамин Б6:",
    quantity: 0.093,
    measurementUnits: "мг",
    description: "– Учествује у метаболизму и когнитивном развоју."
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.057,
    measurementUnits: "мг",
    description: "– Има улогу у производњи енергије и одржавању здраве коже."
  },
  {
    element: "Магнезијум:",
    quantity: 6,
    measurementUnits: "мг",
    description: "– Садржи мале количине магнезијума, који је важан за функцију мишића и нерва."
  },
  {
    element: "Цинк:",
    quantity: 0.24,
    measurementUnits: "мг",
    description: "– Пружа минимални цинк, који подржава имунски систем."
  },
  {
    element: "Витамин Е:",
    quantity: 0.57,
    measurementUnits: "мг",
    description: "– Садржи мале количине витамина Е, који има антиоксидативна својства."
  },
  {
    element: "Витамин А:",
    quantity: 54,
    measurementUnits: "ИУ",
    description: "– Садржи витамин А, који је важан за вид и имунски систем."
  }
],
cultivationHeading: `Боровнице су популарне бобице познате по свом слатко-киселом укусу и бројним здравственим предностима. Углавном се узгајају у хладнијим регијама и могу се гајити како на комерцијалним фармама, тако и у кућним баштама. Узгајање боровница захтева специфичне услове земљишта и животне средине за успешан раст. Ево прегледа узгајања боровница.`,
cultivation: [
  {
    id: 21,
    topic: "Клима",
    children: [
      {
        id: 211,
        topic: "Температура",
        text: "Боровнице најбоље расту у хладнијим климатама, иако неке врсте могу да се прилагоде топлијим условима. Идеалне температуре за раст су између 18°C и 24°C (65°F до 75°F). Боровнице захтевају зимски хлад (око 200 до 1.000 часова хладноће, у зависности од врсте) како би поставиле плодове, што их чини погодним за умерене регионе.",
      },
      {
        id: 212,
        topic: "Светлост",
        text: "Боровнице захтевају пуну сунчеву светлост (6 до 8 сати директне светлости дневно) за оптималан раст и производњу плода. Недостатак светлости може довести до смањеног приноса и лошијег квалитета плода.",
      },
    ],
  },
  {
    id: 22,
    topic: "Тло",
    children: [
      {
        id: 221,
        topic: "pH",
        text: "Боровнице воле веома кисела тла са pH вредношћу између 4.5 и 5.5. Важно је редовно тестирати pH тла и, ако је потребно, прилагодити га сумпором или другим киселим средствима.",
      },
      {
        id: 222,
        topic: "Тип тла",
        text: "Боровнице захтевају добро дренирана, песковита или лојана тла која задржавају влагу али не постају водоносна. Лоше дренирана или теška глинена тла могу довести до труљења корена.",
      },
      {
        id: 223,
        topic: "Припрема тла",
        text: "Пре садње, мијешајте органску материју као што је тресет или иглице бора у земљиште како бисте повећали киселост и побољшали структуру. Подигнуте гредице могу бити корисне у подручјима са лошом дренажом.",
      },
    ],
  },
  {
    id: 23,
    topic: "Врсте",
    text: `Популарне врсте боровница укључују:
                          - 'Highbush' (нпр. Bluecrop, Duke и Jersey), обично се гаји у умереним климатама.
                          - 'Rabbiteye' (нпр. Brightwell, Tifblue), погодне за топлије климате.
                          - 'Lowbush' (нпр. дивље боровнице), обично се налазе у хладнијим регионима.`,
  },
  {
    id: 24,
    topic: "Садња",
    children: [
      {
        id: 241,
        topic: "Време",
        text: "Најбоље време за садњу боровница је рано пролеће, када се тло отопи али пре него што нови раст почне. У топлијим климатама, садња на јесен је такође могућа.",
      },
      {
        id: 242,
        topic: "Размак",
        text: "Боровнице треба садити на растојању од 1.2 до 1.8 метара (4 до 6 стопа), а редове треба поставити на удаљености од 2.4 до 3 метра (8 до 10 стопа), у зависности од врсте. Правилно растојање осигурава добар проток ваздуха и смањује ризик од болести.",
      },
      {
        id: 243,
        topic: "Крос-полинизација",
        text: "Иако многе врсте боровница могу да се полинизују самостално, садња више врста може повећати принос и побољшати величину и квалитет плода због боље крос-полинизације.",
      },
    ],
  },
  {
    id: 25,
    topic: "Заливање",
    children: [
      {
        id: 251,
        topic: "Фаза успостављања",
        text: "Током прве године након садње, боровнице захтевају константну влагу како би успоставиле свој коренов систем. Заливајте дубоко и редовно како бисте одржали земљиште равномерно влажним, али не претрпано водом.",
      },
      {
        id: 252,
        topic: "Одрасле биљке",
        text: "Одрасле боровнице захтевају око 25 до 50 мм (1 до 2 инча) воде недељно током вегетационог периода, посебно у сувим периодима. Мулчење може помоћи у задржавању влаге у тлу.",
      },
      {
        id: 253,
        topic: "Избегавање прекомерног заливања",
        text: "Прекомерно заливање може довести до труљења корена, посебно у лоше дренираним земљиштима. Осигурајте добру дренажу и избегавајте натопљеност корена.",
      },
    ],
  },
  {
    id: 26,
    topic: "Орезивање",
    children: [
      {
        id: 261,
        topic: "Формирање",
        text: "Орезивајте боровнице како бисте подстакли отворену структуру, омогућавајући сунчевој светлости и ваздуху да уђу у средину биљке. Ово подстиче бољу производњу плода и смањује ризик од болести.",
      },
      {
        id: 262,
        topic: "Време орезивања",
        text: "Орезивање треба обавити током периода мировања, обично крајем зиме или раним пролећем. Уклоните слабе, мртве или старе гране како бисте подстакли нови раст.",
      },
    ],
  },
  {
    id: 27,
    topic: "Ђубрење",
    children: [
      {
        id: 271,
        topic: "Нутријенти",
        text: "Боровнице користе ђубрива која су специјално формулисана за биљке које воле кисела тла. Уравнотежено ђубриво као што је 10-10-10 или ђубриво са високим садржајем амонијум-сулфата може помоћи у обезбеђивању потребних нутријената.",
      },
      {
        id: 272,
        topic: "Време примене",
        text: "Примена ђубрива треба да буде у раном пролећу, чим нови раст почне. Избегавајте прекомерну употребу ђубрива, јер боровнице могу бити осетљиве на вишак хранљивих материја, посебно азота.",
      },
    ],
  },
  {
    id: 28,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 281,
        topic: "Штеточине",
        text: "Уобичајене штеточине које нападају боровнице укључују афиде, паукове гриње и воћне црве. Стратегије интегрисаног управљања штеточинама (IPM), као што су коришћење корисних инсеката и органских пестицида, могу помоћи у контроли популација штеточина.",
      },
      {
        id: 282,
        topic: "Болести",
        text: "Боровнице су подложне болестима као што су болест мумии бобица, прашкаста плесан и труљење корена. Превентивне мере укључују правилно орезивање, одржавање киселости тла и примена фунгицида ако је потребно.",
      },
    ],
  },
  {
    id: 29,
    topic: "Жетва",
    children: [
      {
        id: 291,
        topic: "Време жетве",
        text: "Боровнице се обично бербују од средине до краја лета, у зависности од врсте и климе. Важно је убрати их када су потпуно зреле, јер неће више сазревати након бербе.",
      },
      {
        id: 292,
        topic: "Знаци зрелости",
        text: "Зреле боровнице су равномерно плаве боје, напете и слатке. Бобице које су зелене или црвенкасте још нису зреле и треба их оставити да сазру на грани.",
      },
      {
        id: 293,
        topic: "Руковање",
        text: "Боровнице треба пажљиво убирати како би се избегло оштећење плода. Лако се модри, па их треба пажљиво преносити и складиштити.",
      },
    ],
  },
  {
    id: 30.2,
    topic: "Складиштење",
    text: "Свежи плодови боровнице могу се чувати у фрижидеру до 7 до 10 дана. Да би се продужио рок трајања, могу се смрзавати, сушити или правити џемови, желе или конзерве.",
    children: [
      {
        id: 30.21,
        topic: `Очување`,
        text: "За смрзавање, распоредите боровнице у један слој на плочи за печење и замрзните их пре него што их пребаците у херметички затворене посуде или врећице за смрзавање.",
      },
    ],
  },
  {
    id: 31.2,
    topic: "Разређивање",
    text: "Разређивање није обавезно за боровнице, али повремено орезивање старијих грана помаже у одржавању здравља биљке и подстиче раст продуктивнијих младих грана.",
  },
],
    },
    {
        id: 6,
name: "Трешња",
img: fruitsImages.cherry,
inGeneralHeading: "Природни слатки драгуљи",
inGeneral: `Трешње, мале, округле бобице које припадају роду Prunus, веома су цењене због своје дивне слаткоће и живописне боје. Долазе у две основне врсте: слатке трешње, које се обично уживају свеже, и киселе трешње, које се често користе у кувању и печењу.
                Слатке трешње, као што су Бинг и Раиниер, сочне су и богате антиоксидансима, укључујући антхоцијанине који им дају дубоку црвену боју. Ови антиоксиданси помажу у борби против оксидативног стреса и упале у телу, доприносећи свеукупном здрављу. Слатке трешње су такође добар извор витамина Ц и А, који подржавају имунски систем и промовишу здраву кожу.
                Киселе трешње, као што су Монморонси, познате су по свом јаком укусу и често се користе за прављење пита, џемова и сокова. Посебно су примећене по високом садржају мелатонина, хормона који регулише обрасце спавања. Конзумирање киселих трешњи може побољшати квалитет сна и помоћи у опоравку после физичког напора, што их чини омиљеним воћем међу атлетичарима.
                Трешње нису само укусне, већ су и свестране у кулинарским употребама. Могу се јести свеже, додавати у салате, мешати у смутије или кувати у сосове. Њихова природна слаткоћа чини их фантастичним састојком у десертима, док њихова киселост додаје освежавајући контраст сланим јелима.
                Укратко, трешње су воће богато нутритивним својствима које нуди бројне здравствене користи и кулинарске могућности. Њихови слатки и кисели укуси чине их дивним додатком свакој исхрани, пружајући и укус и нутритивну вредност у сваком залогају.`,
topic1: "Нутриција и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 63,
    measurementUnits: "ккал",
    description: "– Нискокалорично, што га чини освежавајућом и здравом ужином."
  },
  {
    element: "Масти:",
    quantity: 0.2,
    measurementUnits: "г",
    description: "– Веома ниско у мастима, што доприноси њеном здравом профилу."
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0,
    measurementUnits: "г",
    description: "– Не садржи засићене масти, што подржава здравље срца."
  },
  {
    element: "Витамин Б3 (Нијасин):",
    quantity: 0.2,
    measurementUnits: "мг",
    description: "– Подржава метаболизам и помаже у одржавању здраве коже."
  },
  {
    element: "Натријум:",
    quantity: 1,
    measurementUnits: "мг",
    description: "– Веома низак у натријуму, користан за контролу крвног притиска."
  },
  {
    element: "Калијум:",
    quantity: 222,
    measurementUnits: "мг",
    description: "– Добар извор калијума, који је есенцијалан за функцију мишића и равнотежу течности."
  },
  {
    element: "Угљени хидрати:",
    quantity: 16,
    measurementUnits: "г",
    description: "– Садржи природне шећере, који обезбеђују брз извор енергије."
  },
  {
    element: "Влакна:",
    quantity: 1.6,
    measurementUnits: "г",
    description: "– Садржи дијететска влакна, која подржавају здраво варење."
  },
  {
    element: "Шећер:",
    quantity: 12.8,
    measurementUnits: "г",
    description: "– Садржи природне шећере, који доприносе његовој слаткоћи."
  },
  {
    element: "Протеини:",
    quantity: 1.1,
    measurementUnits: "г",
    description: "– Обезбеђује малу количину биљних протеина."
  },
  {
    element: "Витамин Ц:",
    quantity: 7,
    measurementUnits: "мг",
    description: "– Добар извор витамина Ц, важан за имунски систем и здравље коже."
  },
  {
    element: "Калцијум:",
    quantity: 18,
    measurementUnits: "мг",
    description: "– Обезбеђује малу количину калцијума, што доприноси здрављу костију."
  },
  {
    element: "Гвожђе:",
    quantity: 0.2,
    measurementUnits: "мг",
    description: "– Садржи трагове гвожђа, потребног за здраву производњу црвених крвних зрнаца."
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.02,
    measurementUnits: "мг",
    description: "– Подржава метаболизам енергије."
  },
  {
    element: "Витамин Б6:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Важан за метаболизам протеина и здравље мозга."
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.03,
    measurementUnits: "мг",
    description: "– Доприноси производњи енергије и здрављу коже."
  },
  {
    element: "Магнезијум:",
    quantity: 11,
    measurementUnits: "мг",
    description: "– Обезбеђује малу количину магнезијума, који је важан за функцију мишића и нерва."
  },
  {
    element: "Цинк:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Садржи трагове цинка, који подржавају имунски систем."
  },
  {
    element: "Витамин Е:",
    quantity: 0.07,
    measurementUnits: "мг",
    description: "– Садржи мале количине витамина Е, важног антиоксиданта."
  },
  {
    element: "Витамин А:",
    quantity: 64,
    measurementUnits: "ИУ",
    description: "– Садржи бета-каротен, који подржава вид и здравље имунског система."
  }
],
cultivationHeading: `Трешње су укусни плодови познати по свом слатком укусу и често се користе у десертима, џемовима и напитцима. Могу се узгајати у комерцијалним воћњацима и кућним баштама. Ево прегледа узгајања трешње.`,
cultivation: [
  {
    id: 21,
    topic: "Клима",
    children: [
      {
        id: 211,
        topic: "Температура",
        text: "Трешње успевају у умереним климатама, са хладним зимама и топлим летима. Захтевају период зимског хлада (између 700 и 1.200 часова хладноће) за правилан развој пупољака. Идеална температура за дрвеће Трешње током вегетације је између 18°C и 24°C (65°F до 75°F).",
      },
      {
        id: 212,
        topic: "Светлост",
        text: "Трешње захтевају пуну сунчеву светлост за оптималан раст и родност. Потребно је минимум 6 до 8 сати директне светлости дневно да би се произвео висококвалитетан плод.",
      },
    ],
  },
  {
    id: 22,
    topic: "Тло",
    children: [
      {
        id: 221,
        topic: "pH",
        text: "Дрвеће трешње преферира добро дренирана, благо кисела тла са pH вредношћу између 6.0 и 7.0. pH тла треба тестирати и прилагодити кречом или сумпором по потреби.",
      },
      {
        id: 222,
        topic: "Тип тла",
        text: "Песковита или лојана тла су идеална за дрвеће трешње, јер пружају добру дренажу. трешње су осетљиве на труљење корена у лоше дренираним или водозасићеним тлима.",
      },
      {
        id: 223,
        topic: "Припрема тла",
        text: "Пре садње, органска материја као што је компост или добро распаднут стајњак треба да се унесе у тло ради побољшања плодности и структуре. Подигнути лејци могу бити корисни у подручјима са тешким земљиштем.",
      },
    ],
  },
  {
    id: 23,
    topic: "Врсте",
    text: `Популарне врсте трешње укључују:
                          - 'Слатке трешње' (нпр. Бинг, Рајниер и Стела) су најбоље за јело свеже.
                          - 'Киселе трешње' (нпр. Монтморенси и Морељо) често се користе за кување, печење и конзервирање.`,
  },
  {
    id: 24,
    topic: "Садња",
    children: [
      {
        id: 241,
        topic: "Време",
        text: "Најбоље време за садњу дрвећа трешње је рано пролеће, након последњег мраза, или касне јесени када је дрво у стању мировања. Садња у пролеће омогућава дрвећу да успостави корење пре зиме.",
      },
      {
        id: 242,
        topic: "Размак",
        text: "Дрвеће трешње треба садити на растојању од 5 до 7 метара (16 до 23 стопе), у зависности од врсте. Правилно растојање омогућава циркулацију ваздуха и продор сунчеве светлости, смањујући ризик од болести.",
      },
      {
        id: 243,
        topic: "Полинизација",
        text: "Многе сорте слатких трешњи нису самоплодне и захтевају компатибилног опрашивача у близини за постављање плода. Киселе трешње су обично самоплодне, али могу имати користи од крос-полинизације за бољи принос.",
      },
    ],
  },
  {
    id: 25,
    topic: "Заливање",
    children: [
      {
        id: 251,
        topic: "Фаза успостављања",
        text: "Дрвеће трешње захтева константну влагу током првих неколико година након садње како би успоставило свој коренов систем. Заливајте дубоко и редовно, посебно током сувих периода.",
      },
      {
        id: 252,
        topic: "Одрасле биљке",
        text: "Након успостављања, дрвеће трешње захтева око 25 до 50 мм (1 до 2 инча) воде недељно током вегетационог периода. Мулчење помаже у задржавању влаге у тлу и регулисању температуре.",
      },
      {
        id: 253,
        topic: "Избегавање прекомерног заливања",
        text: "Трешње су осетљиве на прекомерно заливање и водозасићено тло, што може довести до болести корена. Осигурајте добру дренажу како бисте спречили ове проблеме.",
      },
    ],
  },
  {
    id: 26,
    topic: "Орезивање",
    children: [
      {
        id: 261,
        topic: "Формирање",
        text: "Орезивајте дрвеће трешње да развијете јаку, отворену структуру која омогућава сунчевој светлости да допре до унутрашњих грана. Ово побољшава квалитет плода и смањује ризик од болести.",
      },
      {
        id: 262,
        topic: "Време орезивања",
        text: "Орезивање дрвећа трешње треба обавити током периода мировања, обично касне зиме или раног пролећа. Уклоните све мртве, болесне или прекршене гране да бисте одржали здрав раст.",
      },
    ],
  },
  {
    id: 27,
    topic: "Ђубрење",
    children: [
      {
        id: 271,
        topic: "Нутријенти",
        text: "Дрвеће трешње користи уравнотежена ђубрива (нпр. 10-10-10 NPK) или органски компост. Тестирање тла може открити да ли недостају одређени нутријенти као што су азот или калијум.",
      },
      {
        id: 272,
        topic: "Време примене",
        text: "Примена ђубрива треба да се обави рано пролеће, пре него што почне нови раст. Избегавајте касно ђубрење, које може подстаћи мекан раст осетљив на зимске повреде.",
      },
    ],
  },
  {
    id: 28,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 281,
        topic: "Штеточине",
        text: "Уобичајене штеточине које нападају трешње укључују воћну мушицу, афиде и гусенице. Стратегије интегрисаног управљања штеточинама (IPM), укључујући коришћење замки, корисних инсеката и органских прскалица, помажу у контроли штеточина.",
      },
      {
        id: 282,
        topic: "Болести",
        text: "Трешње су подложне болестима као што су смеђа трулеж, бактеријски рана и прашкаста плесан. Правилно орезивање, добра циркулација ваздуха и примена фунгицида помажу у управљању овим болестима.",
      },
    ],
  },
  {
    id: 29,
    topic: "Жетва",
    children: [
      {
        id: 291,
        topic: "Време",
        text: "Слатке трешње се обично беру крајем пролећа до почетка лета, док киселе трешње сазревају нешто касније. Време бербе зависи од врсте и локалне климе.",
      },
      {
        id: 292,
        topic: "Знаци зрелости",
        text: "Зреле Трешње су чврсте, слатке (за слатке сорте) и потпуно обојене. Киселе трешње се беру када постигну пуну боју, иако могу бити и даље киселе.",
      },
      {
        id: 293,
        topic: "Руковање",
        text: "Трешње се лако мрве и треба их пажљиво брати. Не настављају да сазревају након брања, па треба брати само потпуно зрело воће.",
      },
    ],
  },
  {
    id: 30.2,
    topic: "Складиштење",
    text: "Свежа трешња може се чувати у фрижидеру до 10 дана. Да би се продужио рок трајања, може се смрзавати, сушити или прерађивати у џемове, желе или конзерве.",
    children: [
      {
        id: 30.21,
        topic: `Очување`,
        text: "Да бисте смрзли трешње, оперите и уклоните коштуљицу, распоредите их у један слој на плочи за печење да се замрзну, а затим их пренесите у херметички затворене посуде или врећице за замрзавање.",
      },
    ],
  },
  {
    id: 31.2,
    topic: "Разређивање",
    text: "Дрвеће трешње се природно разређује, али ако има превише малих плодова, ручно разређивање у раном пролећу може побољшати величину и квалитет преосталих трешњи.",
  },
],
    },
    {
        id: 7,
name: "Брусница",
img: fruitsImages.cranberry,
inGeneralHeading: "Мале супер хране",
inGeneral: `Бруснице, мале, киселе бобице које припадају роду Vaccinium, познате су по својим здравственим предностима и специфичном укусу. Често се могу наћи у Северној Америци, а ове светло црвене бобице обично се повезују са празничном сезоном, али су хранљиви додатак исхрани током целе године.
                  Једна од најзапаженијих карактеристика брусница је њихов висок садржај антиоксиданата, посебно проантоцијанидина, који помажу у превенцији уринарних инфекција (УТИ) тако што спречавају штетне бактерије да се прикаче на зидове бешике. Ово чини бруснице популарним избором за оне који траже природне лекове за превенцију УТИ.
                  Бруснице су такође богате витамином Ц, Е и К, као и есенцијалним минералима као што је манган. Витамин Ц је кључан за подршку имунитету и здравље коже, док витамин Е делује као антиоксидант који помаже у заштити ћелија од оштећења. Поред тога, бруснице садрже дијететска влакна, која промовишу здравље дигестивног система и помажу у контроли тежине.
                  Ове бобице могу се конзумирати у различитим облицима, од свежих и сушених до сока и соса. Иако свеже бруснице могу бити сувише киселе за неке, савршене су у салатама, пецивама и сосовима, побољшавајући и укус и нутритивну вредност. Сушене бруснице, често заслађене, чине удобну ужину или додатак граноли и мешавинама за планинаре.
                  Укратко, бруснице нису само сезонски специјалитет већ и моћна храна која доприноси свеукупном здрављу. Њихов јединствени укус и значајне здравствене предности чине их вредним додатком свакој исхрани.`,
topic1: "Нутриција и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 46,
    measurementUnits: "ккал",
    description: "– Нискокалорично, што га чини хранљивим додатком оброцима и ужинама."
  },
  {
    element: "Масти:",
    quantity: 0.1,
    measurementUnits: "г",
    description: "– Веома ниско у мастима, што доприноси здравој исхрани."
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0,
    measurementUnits: "г",
    description: "– Не садржи засићене масти, што подржава здравље срца."
  },
  {
    element: "Натријум:",
    quantity: 1,
    measurementUnits: "мг",
    description: "– Веома низак у натријуму, користан за контролу крвног притиска."
  },
  {
    element: "Калијум:",
    quantity: 61,
    measurementUnits: "мг",
    description: "– Садржи калијум, који је есенцијалан за функцију мишића и равнотежу течности."
  },
  {
    element: "Угљени хидрати:",
    quantity: 12.2,
    measurementUnits: "г",
    description: "– Садржи природне шећере и влакна, који обезбеђују брз извор енергије."
  },
  {
    element: "Влакна:",
    quantity: 4.6,
    measurementUnits: "г",
    description: "– Висок садржај дијететских влакана, која промовишу здраво варење."
  },
  {
    element: "Шећер:",
    quantity: 4.3,
    measurementUnits: "г",
    description: "– Садржи природне шећере, који доприносе њеном благо слатком укусу."
  },
  {
    element: "Протеини:",
    quantity: 0.1,
    measurementUnits: "г",
    description: "– Обезбеђује малу количину биљних протеина."
  },
  {
    element: "Витамин Ц:",
    quantity: 14,
    measurementUnits: "мг",
    description: "– Добар извор витамина Ц, важан за имунски систем и здравље коже."
  },
  {
    element: "Калцијум:",
    quantity: 3,
    measurementUnits: "мг",
    description: "– Обезбеђује трагове калцијума, што доприноси здрављу костију."
  },
  {
    element: "Гвожђе:",
    quantity: 0.2,
    measurementUnits: "мг",
    description: "– Садржи трагове гвожђа, потребног за здраву производњу црвених крвних зрнаца."
  },
  {
    element: "Магнезијум:",
    quantity: 6,
    measurementUnits: "мг",
    description: "– Обезбеђује мале количине магнезијума, важног за функцију мишића и нерва."
  },
  {
    element: "Цинк:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Садржи трагове цинка, који подржавају имунски систем."
  },
  {
    element: "Витамин Е:",
    quantity: 0.2,
    measurementUnits: "мг",
    description: "– Садржи мале количине витамина Е, важног антиоксиданта."
  },
  {
    element: "Витамин А:",
    quantity: 1,
    measurementUnits: "ИУ",
    description: "– Садржи мале количине витамина А, који подржава вид и здравље имунског система."
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.02,
    measurementUnits: "мг",
    description: "– Подржава метаболизам енергије."
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.02,
    measurementUnits: "мг",
    description: "– Доприноси производњи енергије и здрављу коже."
  },
  {
    element: "Витамин Б3 (Нијасин):",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Подржава метаболизам и помаже у одржавању здраве коже."
  },
  {
    element: "Витамин Б6:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Важан за метаболизам протеина и здравље мозга."
  }
],
cultivationHeading: `Бруснице су кисели, црвени плодови познати по свом коришћењу у соковима, сосовима и разним кулинарским апликацијама. Они се углавном узгајају у одређеним регионима Северне Америке и захтевају специфичне услове за раст. Ево прегледа узгајања бруснице.`,
cultivation: [
  {
    id: 21,
    topic: "Клима",
    children: [
      {
        id: 211,
        topic: "Температура",
        text: "Бруснице успешно расту у хладним климатама, преферирајући температуре између 16°C и 22°C (60°F до 72°F). Требају хладне зиме за мировање, али су осетљиве на касне мразеве који могу оштетити цветове.",
      },
      {
        id: 212,
        topic: "Светлост",
        text: "Бруснице захтевају пуну сунчеву светлост за оптималан раст и производњу плода. Требају бар 6 до 8 сати директне сунчеве светлости дневно током вегетационог периода.",
      },
    ],
  },
  {
    id: 22,
    topic: "Тло",
    children: [
      {
        id: 221,
        topic: "pH",
        text: "Бруснице преферирају кисела тла са pH вредношћу између 4.5 и 5.5. Препоручује се тестирање тла како би се осигурала исправна киселост.",
      },
      {
        id: 222,
        topic: "Тип тла",
        text: "Најбоље расту у песковитим, добро дренираним тлима која задржавају влагу, али не постају водозасићена. Тешка глинена тла могу бити штетна за раст бруснице.",
      },
      {
        id: 223,
        topic: "Припрема тла",
        text: "Пре садње, потребно је обогатити тло органском материјом као што је трска маховина или компост како би се побољшала способност задржавања влаге и доступност хранљивих материја.",
      },
    ],
  },
  {
    id: 23,
    topic: "Врсте",
    text: `Популарне врсте брусница укључују:
                          - 'Еарли Блек' (позната по високом приносу и издржљивости)
                          - 'Хоуз' (слатко-кисели укус, одличне за свеже конзумирање и прераду)
                          - 'Бен Лир' (производи велике бобице и отпорна је на болести).`,
  },
  {
    id: 24,
    topic: "Садња",
    children: [
      {
        id: 241,
        topic: "Време",
        text: "Најбоље време за садњу брусница је пролеће након последњег мраза или рана јесен када је време хладно, омогућавајући биљкама да се успоставе пре зиме.",
      },
      {
        id: 242,
        topic: "Размак",
        text: "Садите стабљике бруснице на растојању од 1 метра (3 стопе) у редовима који су размакнути 1.5 до 2 метра (5 до 6 стопа) да би се омогућио добар проток ваздуха и раст.",
      },
      {
        id: 243,
        topic: "Полинизација",
        text: "Бруснице су самоплодне, али имају користи од крос-полинизације. Садња више врста може побољшати постављање плода и принос.",
      },
    ],
  },
  {
    id: 25,
    topic: "Заливање",
    children: [
      {
        id: 251,
        topic: "Фаза успостављања",
        text: "Током прве године након садње, бруснице захтевају редовно заливање да би успоставиле коренов систем. Очувајте константну влажност, посебно током сушних периода.",
      },
      {
        id: 252,
        topic: "Одрасле биљке",
        text: "Након успостављања, бруснице захтевају око 25 до 50 мм (1 до 2 инча) воде недељно. Најбоље успевају у влажним условима, али избегавајте водозасићеност, што може довести до труљења корена.",
      },
      {
        id: 253,
        topic: "Поплаве",
        text: "Бруснице се често узгајају у поплављеним условима током бербе, али стајаћа вода треба да се избегава током вегетације како би се спречиле болести.",
      },
    ],
  },
  {
    id: 26,
    topic: "Орезивање",
    children: [
      {
        id: 261,
        topic: "Одржавање",
        text: "Орезивање је од виталног значаја за одржавање здравља биљке и промовисање производње плода. Орезујте старе гране и уклоните све мртве или болесне гране у касну зиму или рано пролеће.",
      },
      {
        id: 262,
        topic: "Време орезивања",
        text: "Орезујте бруснице пре него што започне нови раст, обично у касну зиму, како бисте подстакли јак раст током вегетационог периода.",
      },
    ],
  },
  {
    id: 27,
    topic: "Ђубрење",
    children: [
      {
        id: 271,
        topic: "Хранљиве материје",
        text: "Бруснице имају користи од органских ђубрива, као што су компост или добро распаднут стајњак, као и уравнотежених ђубрива која су ниска у азоту и висока у калијуму и фосфору.",
      },
      {
        id: 272,
        topic: "Време примене",
        text: "Примена ђубрива треба да се обави рано пролеће, пре почетка новог раста, и поново касно лето како би се подржао развој плода.",
      },
    ],
  },
  {
    id: 28,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 281,
        topic: "Штеточине",
        text: "Уобичајене штеточине укључују брусничне жучне бубе, афиде и плодне црви. Стратегије интегрисаног управљања штеточинама (IPM) помажу у контроли ових штеточина уз помоћ корисних инсеката и органских инсектицида.",
      },
      {
        id: 282,
        topic: "Болести",
        text: "Бруснице су подложне болестима као што су труљење плода, ботритис и труљење корена. Добра дренажа, добра циркулација ваздуха и примена фунгицида када је потребно помажу у контроли ових проблема.",
      },
    ],
  },
  {
    id: 29,
    topic: "Берба",
    children: [
      {
        id: 291,
        topic: "Време",
        text: "Бруснице се обично беру у јесен, од краја септембра до почетка новембра, у зависности од врсте и локалне климе.",
      },
      {
        id: 292,
        topic: "Знаци зрелости",
        text: "Зреле бруснице су чврсте, пуне и имају дубоку црвену боју. Могу се убирати када достигну пуну боју и укус.",
      },
      {
        id: 293,
        topic: "Руковање",
        text: "Бруснице треба пажљиво берити како би се избегло њихово повређивање. Често се берба обавља помоћу специјализоване опреме која поплављује поља како би се бобице лакше сакупиле.",
      },
    ],
  },
  {
    id: 30.2,
    topic: "Складиштење",
    text: "Свежа брусница може се чувати у фрижидеру до 4 недеље. За продужени рок трајања, може се замрзнути до годину дана.",
    children: [
      {
        id: 30.21,
        topic: `Очување`,
        text: "Да бисте замрзли бруснице, оперите их, осушите и ставите у херметички затворене посуде или врећице за замрзавање. Могу се користити директно из замрзивача у кувању и печењу.",
      },
    ],
  },
  {
    id: 31.2,
    topic: "Проређивање",
    text: "Проређивање није обавезно за бруснице, али уклањање вишка плода током вегетационог периода може помоћи у побољшању величине и квалитета преосталих бобица.",
  },
],
    },
    {
        id: 8,
name: "Рибизла",
img: fruitsImages.currants,
inGeneralHeading: "Мале бобице, велика нутриција",
inGeneral: `Рибизла, мале и живописне бобице из рода Ribes, пуне су хранљивих материја и имају оштар укус. Долазе у различитим врстама, укључујући црне, црвене и беле рибизле, свако са својим карактеристичним укусом и здравственим предностима. Ове бобице се често користе у слатким и сланим јелима, ценене су због своје киселости и свестраности.
                  Једна од најистакнутијих карактеристика рибизли, посебно црне рибизле, је њихов висок садржај витамина Ц. Црне рибизле садрже неколико пута више витамина Ц од наранџи, што их чини одличним за подршку имунолошком систему, промовисање здраве коже и помоћ у апсорпцији гвожђа. Поред тога, рибизле су богате антиоксидансима, укључујући антоцијанине и флавоноиде, који помажу у смањењу упале и заштити ћелија од оштећења изазваних слободним радикалима.
                  Рибизле су такође добар извор дијететских влакана, која подржавају здравље дигестивног система и помажу у регулисању нивоа шећера у крви. Ово их чини паметним избором за оне који желе да одрже здраву телесну тежину или управљају стањима као што је дијабетес. Штавише, црне рибизле су познате по високим нивоима гама-линоленске киселине (ГЛА), омега-6 масне киселине која подржава здравље срца.
                  У кулинарству, рибизле се могу користити на разне начине. Често се уживају у џемовима, желеима, сосовима или печеним производима као што су сконси и мафини. Свежи плодови могу се додавати у салате или десерте за јачи укус.
                  Укратко, рибизле су плодови богати нутријентима који нуде бројне здравствене предности. Њихов живи укус и свестраност чине их одличним додатком свакој исхрани, побољшавајући и укус и нутрицију.`,
topic1: "Нутриција и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 70,
    measurementUnits: "ккал",
    description: "– Нискокалоричне, што их чини здравим додатком ужинама и оброцима."
  },
  {
    element: "Масти:",
    quantity: 0.3,
    measurementUnits: "г",
    description: "– Веома ниско у мастима, што доприноси њиховом здравом профилу."
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0,
    measurementUnits: "г",
    description: "– Не садрже засићене масти, што подржава здравље срца."
  },
  {
    element: "Натријум:",
    quantity: 1,
    measurementUnits: "мг",
    description: "– Веома низак у натријуму, користан за контролу крвног притиска."
  },
  {
    element: "Калијум:",
    quantity: 322,
    measurementUnits: "мг",
    description: "– Добар извор калијума, који је есенцијалан за функцију мишића и равнотежу течности."
  },
  {
    element: "Угљени хидрати:",
    quantity: 15.5,
    measurementUnits: "г",
    description: "– Богат угљеним хидратима, који пружају брз извор енергије."
  },
  {
    element: "Влакна:",
    quantity: 4.3,
    measurementUnits: "г",
    description: "– Висок садржај дијететских влакана, која подржавају здраво варење."
  },
  {
    element: "Шећер:",
    quantity: 8.0,
    measurementUnits: "г",
    description: "– Садржи природне шећере, који доприносе њиховом слатко-кислом укусу."
  },
  {
    element: "Протеини:",
    quantity: 1.6,
    measurementUnits: "г",
    description: "– Обезбеђује малу количину биљних протеина."
  },
  {
    element: "Витамин Ц:",
    quantity: 41,
    measurementUnits: "мг",
    description: "– Добар извор витамина Ц, важан за имунски систем и здравље коже."
  },
  {
    element: "Калцијум:",
    quantity: 55,
    measurementUnits: "мг",
    description: "– Обезбеђује нешто калцијума, који доприноси здрављу костију."
  },
  {
    element: "Гвожђе:",
    quantity: 1.0,
    measurementUnits: "мг",
    description: "– Садржи гвожђе, које је потребно за здраву производњу црвених крвних зрнаца."
  },
  {
    element: "Магнезијум:",
    quantity: 13,
    measurementUnits: "мг",
    description: "– Обезбеђује мале количине магнезијума, важног за функцију мишића и нерва."
  },
  {
    element: "Цинк:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Садржи трагове цинка, који подржавају имунски систем."
  },
  {
    element: "Витамин Е:",
    quantity: 0.2,
    measurementUnits: "мг",
    description: "– Садржи мале количине витамина Е, важног антиоксиданта."
  },
  {
    element: "Витамин А:",
    quantity: 45,
    measurementUnits: "ИУ",
    description: "– Садржи бета-каротен, који подржава вид и здравље имунског система."
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.03,
    measurementUnits: "мг",
    description: "– Подржава метаболизам енергије."
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.02,
    measurementUnits: "мг",
    description: "– Доприноси производњи енергије и здрављу коже."
  },
  {
    element: "Витамин Б3 (Нијасин):",
    quantity: 0.3,
    measurementUnits: "мг",
    description: "– Подржава метаболизам и помаже у одржавању здраве коже."
  },
  {
    element: "Витамин Б6:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Важан за метаболизам протеина и здравље мозга."
  }
],
cultivationHeading: `Рибизле су мале, киселе бобице које долазе у различитим бојама, укључујући црвену, црну и белу. Широко се користе у џемовима, желејима, десертима и напитцима. Рибизле су отпорне биљке које могу успевати у различитим условима, што их чини погодним за комерцијалну производњу и кућне баште. Ево прегледа узгајања рибизле.`,
cultivation: [
  {
    id: 21,
    topic: "Клима",
    children: [
      {
        id: 211,
        topic: "Температура",
        text: "Рибизле преферирају умерену климу, најбоље расту у регионима са хладним летом и хладним зимама. Најбоље расту уз дневне температуре између 15°C и 25°C (59°F до 77°F) и захтевају период хлађења за правилан развој пупољака.",
      },
      {
        id: 212,
        topic: "Светлост",
        text: "Рибизле требају пуно сунце за производњу висококвалитетних плодовa, али могу поднети и делимичну сенку. Идеално, требају добити најмање 6 сати сунчеве светлости дневно.",
      },
    ],
  },
  {
    id: 22,
    topic: "Тло",
    children: [
      {
        id: 221,
        topic: "pH",
        text: "Рибизле најбоље расту на добро дренираним, плодним тлима са pH између 6.0 и 7.0. Блага киселост тла такође може подржати здрав раст.",
      },
      {
        id: 222,
        topic: "Тип тла",
        text: "Најбоља су тла са пешчаном или лојевитом структуром, која задржавају влагу, али омогућавају добру дренажу. Тешка глинена тла могу довести до труљења корена и других проблема.",
      },
      {
        id: 223,
        topic: "Припрема тла",
        text: "Пре садње, обогатите тло органским материјама, као што су компост или добро распаднут стајњак, како би се побољшала плодност и структура тла.",
      },
    ],
  },
  {
    id: 23,
    topic: "Врсте",
    text: `Популарне врсте рибизле укључују:
                          - Црвена рибизла (позната по свом киселом укусу и светло црвеној боји)
                          - Црна рибизла (богата антиоксидансима и често се користи за џемове и сокове)
                          - Бела рибизла (слађа варијанта, често се конзумира свежа).`,
  },
  {
    id: 24,
    topic: "Садња",
    children: [
      {
        id: 241,
        topic: "Време",
        text: "Најбоље време за садњу рибизле је у рано пролеће или касну јесен, када су биљке у стању мировања.",
      },
      {
        id: 242,
        topic: "Размак",
        text: "Грмови рибизле треба да буду размацирани 1.2 до 1.5 метара (4 до 5 стопа) како би се омогућио добар проток ваздуха и раст.",
      },
      {
        id: 243,
        topic: "Полинизација",
        text: "Већина врста рибизле је самоплодна, али садња више врста може побољшати постављање плода и принос.",
      },
    ],
  },
  {
    id: 25,
    topic: "Заливање",
    children: [
      {
        id: 251,
        topic: "Фаза успостављања",
        text: "Током прве године након садње, рибизле захтевају редовно заливање како би успоставиле јак коренов систем. Тло треба да буде константно влажно, али не водозасићено.",
      },
      {
        id: 252,
        topic: "Одрасле биљке",
        text: "Након успостављања, рибизле обично захтевају око 25 до 50 мм (1 до 2 инча) воде недељно, посебно током сувих периода.",
      },
      {
        id: 253,
        topic: "Избегавање прекомерног заливања",
        text: "Прекомерна влага може довести до труљења корена и других гљивичних болести, па је важно обезбедити добру дренажу.",
      },
    ],
  },
  {
    id: 26,
    topic: "Орезивање",
    children: [
      {
        id: 261,
        topic: "Одржавање",
        text: "Орезивање је важно за одржавање здравља биљке и максимизирање производње плода. Уклоните мртве или болесне гране и проредите густе делове како бисте побољшали циркулацију ваздуха.",
      },
      {
        id: 262,
        topic: "Време орезивања",
        text: "Орезујте рибизле у касну зиму или рано пролеће, пре него што почне нови раст. Ово подстиче јачи раст и већи принос.",
      },
    ],
  },
  {
    id: 27,
    topic: "Ђубрење",
    children: [
      {
        id: 271,
        topic: "Хранљиве материје",
        text: "Рибизле имају користи од уравнотежених ђубрива која обезбеђују основне хранљиве материје. Органски компост такође може побољшати плодност тла.",
      },
      {
        id: 272,
        topic: "Време примене",
        text: "Примените ђубриво у раном пролећу, непосредно пре почетка новог раста. Избегавајте прекомерну примену ђубрива, која може довести до прекомерног вегетативног раста и нижег приноса плода.",
      },
    ],
  },
  {
    id: 28,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 281,
        topic: "Штеточине",
        text: "Уобичајене штеточине које погађају рибизле укључују афиде, паучне гриње и рибизловог корова. Стратегије интегрисаног управљања штеточинама (IPM), као што су корисни инсекти и органски пестициди, могу помоћи у контроли ових штеточина.",
      },
      {
        id: 282,
        topic: "Болести",
        text: "Рибизле могу бити подложне болестима као што су прашкаста плесни, рђа и мрље на листовима. Добра циркулација ваздуха, правилно размакање и употреба отпорних сорти могу помоћи у спречавању ових проблема.",
      },
    ],
  },
  {
    id: 29,
    topic: "Берба",
    children: [
      {
        id: 291,
        topic: "Време",
        text: "Рибизле су обично спремне за бербу у средини до крају лета, у зависности од врсте и климе.",
      },
      {
        id: 292,
        topic: "Знаци зрелости",
        text: "Зреле рибизле су пуне, чврсте и достигле своју пуну боју (црвену, црну или белу). Треба их убрати када су потпуно зреле за најбољи укус.",
      },
      {
        id: 293,
        topic: "Руковање",
        text: "Рибизле су деликатне и треба их пажљиво руковати како би се избегло наљуштавање. За бербу користите маказе или сечива како бисте смањили оштећења.",
      },
    ],
  },
  {
    id: 30.2,
    topic: "Складиштење",
    text: "Свежа рибизла може се чувати у фрижидеру до 1 недеље. За продужени рок трајања, може се замрзнути до годину дана.",
    children: [
      {
        id: 30.21,
        topic: `Очување`,
        text: "Да бисте замрзли рибизле, оперите их и осушите пре него што их ставите у херметички затворене посуде или врећице за замрзавање. Могу се користити директно из замрзивача у кувању, печењу или смутијима.",
      },
    ],
  },
  {
    id: 31.2,
    topic: "Танкирање",
    text: "Танкирање није обавезно за рибизле, али уклањање вишка плода током вегетационог периода може помоћи у побољшању величине и квалитета преосталих бобица.",
  },
],
    },
    {
        id: 9,
name: "Смокве",
img: fruitsImages.figs,
inGeneralHeading: `Природни слатки укус`,
inGeneral: `Смокве, са стабла Фицус карика, су древни плодови који се уживају због своје јединствене слаткоће, меке текстуре и значајних нутритивних предности. Често препознатљиве по свом карактеристичном облику у облику сузе и жваквој пулпи испуњеној малим семенима, смокве су исто толико хранљиве колико и укусне.
              Једна од најистакнутијих карактеристика смокви је висок садржај влакана, који помажу у дигестији, промовишу редовност и подржавају здравље црева. Ово их чини одличним избором за оне који желе да побољшају свој дигестивни систем. Комбинација растворљивих и нерастворљивих влакана у смоквама такође помаже у регулацији нивоа шећера у крви, што доприноси бољем управљању тежином и свеукупном метаболичком здрављу.
              Смокве су добар извор есенцијалних минерала као што су калијум, калцијум и магнезијум. Калијум помаже у балансу ефеката натријума и подржава здравље срца регулишући крвни притисак, док су калцијум и магнезијум витални за одржавање јаких костију и функцију мишића. Смокве такође садрже разне антиоксиданте, као што су полифеноли, који штите ћелије од оксидативног стреса и упале.
              Смокве се могу уживати свеже и суве. Свеже смокве су сочне и деликатне, што их чини савршеним за салате, десерте или чак у комбинацији са сланим јелима попут сира и прошутоа. Суве смокве, с друге стране, нуде концентрисану слаткоћу и представљају погодан ужину или састојак у печеним производима, енергетским плочицама и житарицама.
              Укратко, смокве су плодови богати нутритивним својствима који не само да задовољавају слатке жеље, већ пружају и значајне здравствене користи. Њихов јединствен укус, у комбинацији са њиховом свестраношћу, чини их вредним додатком свакој исхрани.`,
topic1: "Нутриција и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 74,
    measurementUnits: "кцал",
    description:
      "– Ниска калоричност, што чини смокве нутритивним избором за ужину.",
  },
  {
    element: "Масти:",
    quantity: 0.3,
    measurementUnits: "г",
    description:
      "– Врло ниске количине масти, што доприноси здравој исхрани срца.",
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0.0,
    measurementUnits: "г",
    description:
      "– Садрже незначајне количине засићених масних киселина, што промовише свеукупно здравље.",
  },
  {
    element: "Витамин Б3 (Нијацин):",
    quantity: 0.4,
    measurementUnits: "мг",
    description:
      "– Подржава метаболизам и важан је за одржавање здраве коже и нерва.",
  },
  {
    element: "Натријум:",
    quantity: 1,
    measurementUnits: "мг",
    description:
      "– Врло низак садржај натријума, што га чини здравим избором за срце.",
  },
  {
    element: "Калијум:",
    quantity: 232,
    measurementUnits: "мг",
    description:
      "– Добар извор калијума, који је есенцијалан за функцију мишића и баланс течности.",
  },
  {
    element: "Угљени хидрати:",
    quantity: 19.2,
    measurementUnits: "г",
    description:
      "– Богат извор угљених хидрата, углавном из природних шећера и влакана.",
  },
  {
    element: "Влакна:",
    quantity: 3.0,
    measurementUnits: "г",
    description:
      "– Висок садржај влакана, што подстиче здраву дигестију и редовност.",
  },
  {
    element: "Шећери:",
    quantity: 16.3,
    measurementUnits: "г",
    description:
      "– Садрже природне шећере, пружајући слаткоћу и енергију.",
  },
  {
    element: "Протеини:",
    quantity: 0.8,
    measurementUnits: "г",
    description:
      "– Садрже минималне количине протеина, што доприноси укупном уносу нутријената.",
  },
  {
    element: "Витамин Ц:",
    quantity: 2.0,
    measurementUnits: "мг",
    description:
      "– Пружа мале количине витамина Ц, који подржава имунолошку функцију и здравље коже.",
  },
  {
    element: "Калцијум:",
    quantity: 35,
    measurementUnits: "мг",
    description:
      "– Садржи калцијум, што доприноси здрављу костију.",
  },
  {
    element: "Железо:",
    quantity: 0.17,
    measurementUnits: "мг",
    description:
      "– Садржи минималне количине гвожђа, важног за пренос кисеоника у крви.",
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.06,
    measurementUnits: "мг",
    description:
      "– Подржава енергетски метаболизам претварањем угљених хидрата у енергију.",
  },
  {
    element: "Витамин Б6:",
    quantity: 0.1,
    measurementUnits: "мг",
    description:
      "– Учествује у метаболизму и когнитивним функцијама.",
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.04,
    measurementUnits: "мг",
    description:
      "– Има улогу у производњи енергије и одржавању здраве коже.",
  },
  {
    element: "Магнезијум:",
    quantity: 17,
    measurementUnits: "мг",
    description:
      "– Садржи мале количине магнезијума, важног за функцију мишића и нерва.",
  },
  {
    element: "Цинк:",
    quantity: 0.17,
    measurementUnits: "мг",
    description:
      "– Пружа минималне количине цинка, који подржава имунолошку функцију.",
  },
  {
    element: "Витамин Е:",
    quantity: 0.2,
    measurementUnits: "мг",
    description:
      "– Садржи мале количине витамина Е, који има антиоксидативна својства.",
  },
  {
    element: "Витамин А:",
    quantity: 0,
    measurementUnits: "IU",
    description:
      "– Смокве нису значајан извор витамина А.",
  }
],
cultivationHeading: `Смокве су слатки, сочни плодови познати по свом јединственом укусу и нутрицијским предностима. Они се углавном узгајају у топлим, умереним регионима и могу се гајити у комерцијалним воћњацима и породичним баштама. Ево прегледа узгајања смокви`,
cultivation: [
  {
    id: 21,
    topic: "Клима",
    children: [
      {
        id: 211,
        topic: "Температура",
        text: "Смокве напредују у топлим, умереним климатским условима са дугим, топлим летима. Преферирају температуре између 20°C и 30°C (68°F до 86°F) током сезоне раста и осетљиве су на мраз.",
      },
      {
        id: 212,
        topic: "Сунчева светлост",
        text: "Смоквама је потребно пуно сунца да би произвеле квалитетан плод, потребно им је најмање 6 до 8 сати директне сунчеве светлости дневно.",
      },
    ],
  },
  {
    id: 22,
    topic: "Тло",
    children: [
      {
        id: 221,
        topic: "pH",
        text: "Смоквама одговарају добро дренирана тла са pH вредношћу између 6.0 и 7.0. Могу поднети благо алкална тла, али могу имати проблема у веома киселим тлима.",
      },
      {
        id: 222,
        topic: "Тип тла",
        text: "За смокве су идеална лојана или песковита тла са добром дренажом. Тешка глине може довести до труљења корена и других проблема.",
      },
      {
        id: 223,
        topic: "Припрема тла",
        text: "Умешавање органских материја, као што су компост или добро сажвакана стајњак, у тло пре садње ће побољшати плодност и дренажу.",
      },
    ],
  },
  {
    id: 23,
    topic: "Варијанте",
    text: `Популарне варијанте смокви укључују:
                            - Црне мисије (познате по слатком укусу и тамно љубичастој кожи)
                            - Кадота (зелена кожа и блажи слатки укус, одличне за припрему џема)
                            - Смеђи Турски (велики, слатки плодови са црвенкасто-смеђом кожом).`,
  },
  {
    id: 24,
    topic: "Садња",
    children: [
      {
        id: 241,
        topic: "Време",
        text: "Најбоље време за садњу смокви је рано пролеће или јесен када су дрвећа у миру.",
      },
      {
        id: 242,
        topic: "Размак",
        text: "Смокве треба садити на удаљености од 3 до 4 метра (10 до 13 стопа) како би им се омогућио довољан простор за раст и циркулацију ваздуха.",
      },
      {
        id: 243,
        topic: "Опрашивање",
        text: "Већина варијанти смокви је самопрашивајућа, али неке могу захтевати опрашивање одређене врсте осе да би произвеле плод, нарочито у случају Смирана смокви.",
      },
    ],
  },
  {
    id: 25,
    topic: "Заливање",
    children: [
      {
        id: 251,
        topic: "Фаза успостављања",
        text: "Ново засадене смокве треба редовно заливање да би успоставиле јак коренов систем. Земљиште треба бити константно влажно, али не и поплављено.",
      },
      {
        id: 252,
        topic: "Зрела дрвећа",
        text: "Када се успоставе, смокве су отпорне на сушу, али ће производити боље плодове ако имају константну влагу. Обично им је потребно око 500 до 800 мм (20 до 31 инч) воде годишње.",
      },
      {
        id: 253,
        topic: "Избегавање прекомерног заливања",
        text: "Прекомерно заливање може довести до труљења корена и гљивичних болести, па је важно обезбедити добру дренажу.",
      },
    ],
  },
  {
    id: 26,
    topic: "Орезивање",
    children: [
      {
        id: 261,
        topic: "Облик",
        text: "Орезивање помаже у одржавању облика дрвета и подстиче здраву производњу плодова. Смокве се често орезују у облик вазе ради боље циркулације ваздуха.",
      },
      {
        id: 262,
        topic: "Време",
        text: "Орезујте смокве касном зимом или рано пролеће пре него што започне нови раст како бисте уклонили мртве или пренатоварене гране.",
      },
    ],
  },
  {
    id: 27,
    topic: "Ђубрење",
    children: [
      {
        id: 271,
        topic: "Нутријенти",
        text: "Смоквама користи уравнотежено ђубриво које пружа есенцијалне хранљиве материје, посебно азот, фосфор и калијум. Органски компост такође може побољшати плодност тла.",
      },
      {
        id: 272,
        topic: "Време",
        text: "Примена ђубрива треба да се врши рано пролеће, пре него што започне нови раст. Избегавајте прекомерну примену ђубрива касно у растућој сезони.",
      },
    ],
  },
  {
    id: 28,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 281,
        topic: "Штеточине",
        text: "Чести штеточини који погађају смокве укључују аписе, смоквине бубе и воћне мушице. Стратегије интегрисаног управљања штеточинама (IPM), као што су корисни инсекти и органски пестициди, могу помоћи у контроли ових штеточина.",
      },
      {
        id: 282,
        topic: "Болести",
        text: "Смокве могу бити подложне болестима као што су труљење корена, прашкасти плесни и рђа смокви. Добра циркулација ваздуха, правилне праксе заливања и коришћење отпорних варијанти могу помоћи у превенцији ових проблема.",
      },
    ],
  },
  {
    id: 29,
    topic: "Жетва",
    children: [
      {
        id: 291,
        topic: "Време",
        text: "Смокве су обично спремне за жетву од касног лета до ране јесени, у зависности од сорте и климе.",
      },
      {
        id: 292,
        topic: "Знакови зрелости",
        text: "Зреле смокве су мекане на додир, потпуно обојене и могу почети да се спуштају са гране. Треба их убрати када су потпуно зреле за најбољи укус.",
      },
      {
        id: 293,
        topic: "Руковање",
        text: "Смокве су деликатне и треба их пажљиво руковати како би се избегло нагињање. Уберајте плод са стабла, а не повлачењем.",
      },
    ],
  },
  {
    id: 30.2,
    topic: "Чување",
    text: "Свежи плодови смокви имају кратак рок трајања и најбоље је да се конзумирају одмах после жетве. Могу се чувати у фрижидеру до 3 дана.",
    children: [
      {
        id: 30.21,
        topic: `Очување`,
        text: "Смокве такође могу бити сушене или прављене у џемове и конзерве како би се продужио рок трајања.",
      },
    ],
  },
  {
    id: 31.2,
    topic: "Проређивање",
    text: "Проређивање није често потребно за смокве, али уклањање неких незрелих плодова може помоћи у побољшању величине и квалитета преосталих смокви.",
  },
],
    },
    {
        id: 10,
name: "Грожђе",
img: fruitsImages.grapes,
inGeneralHeading: `Мали плодови, велике користи`,
inGeneral: `Грожђе, из рода Витис, су мали, сочни плодови који се широм света конзумирају због свог слатког, киселкастог укуса и значајног нутрицијског профила. Доступни су у зеленим, црвеним, црним и љубичастим варијантама, а могу се конзумирати свеже, суво (као грожђице) или користити за прављење вина, сока и џемова.
                  Једна од кључних здравствених користи грожђа је висок садржај антиоксиданата, посебно ресвератрола, који је најприсутнији у црвеном и љубичастом грожђу. Ресвератрол је повезан са здрављем срца, помажући у смањењу крвног притиска, снижавању холестерола и спречавању стварања крвних угрушака. Такође може играти улогу у заштити од неких врста рака и успоравању прогресије неуродегенеративних болести као што је Алцхајмерова болест.
                  Грожђе су такође богате витаминима Ц и К. Витамин Ц подржава имунолошки систем, промовише здравље коже и помаже у лечењу рана, док је витамин К важан за здравље костију и правилно згрушавање крви. Грожђе су хидријујући плодови због високог садржаја воде, чинећи их одличним избором за одржавање свежине.
                  Поред антиоксиданата и витамина, грожђе садржи влакна, која подржавају варење и помажу у регулисању нивоа шећера у крви. Једу се са малим бројем калорија, што их чини одличним снацком за управљање тежином.
                  Грожђе су невероватно разноврсне у кухињи. Могу се јести свеже, додавати у салате или користити у десертима и сланим јелима. Суво грожђе (грожђице) популарна је састојак у житарицама, пецивима и снацковима.
                  Укратко, грожђе је укусни и хранљиви плод који нуди широк спектар здравствених користи. Њихова разноврсност и освежавајући укус чине их основом у многим дијетама широм света.`,
topic1: "Нутриција и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 69,
    measurementUnits: "кцал",
    description: "– Низак садржај калорија, чинећи их освежавајућим и здравим снацком."
  },
  {
    element: "Масти:",
    quantity: 0.2,
    measurementUnits: "г",
    description: "– Врло низак садржај масти, што доприноси њиховом здравом профилу."
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0,
    measurementUnits: "г",
    description: "– Не садрже засићене масти, што промовише здравље срца."
  },
  {
    element: "Натријум:",
    quantity: 1,
    measurementUnits: "мг",
    description: "– Врло низак садржај натријума, користан за управљање крвним притиском."
  },
  {
    element: "Калијум:",
    quantity: 191,
    measurementUnits: "мг",
    description: "– Добар извор калијума, који је есенцијалан за функцију мишића и равнотежу течности."
  },
  {
    element: "Угљени хидрати:",
    quantity: 18.1,
    measurementUnits: "г",
    description: "– Богат угљеним хидратима, који пружају брзи извор енергије."
  },
  {
    element: "Влакна:",
    quantity: 0.9,
    measurementUnits: "г",
    description: "– Садрже дијетална влакна, која промовишу здраво варење."
  },
  {
    element: "Шећери:",
    quantity: 15.5,
    measurementUnits: "г",
    description: "– Садрже природне шећере, што доприноси њиховом слатком укусу."
  },
  {
    element: "Протеини:",
    quantity: 0.7,
    measurementUnits: "г",
    description: "– Пружају малу количину биљних протеина."
  },
  {
    element: "Витамин Ц:",
    quantity: 10.8,
    measurementUnits: "мг",
    description: "– Добар извор витамина Ц, који је важан за имунолошку функцију и здравље коже."
  },
  {
    element: "Калцијум:",
    quantity: 18,
    measurementUnits: "мг",
    description: "– Пружа малу количину калцијума, који доприноси здрављу костију."
  },
  {
    element: "Гвожђе:",
    quantity: 0.5,
    measurementUnits: "мг",
    description: "– Садржи трагове гвожђа, који су неопходни за здраву производњу црвених крвних зрнаца."
  },
  {
    element: "Магнезијум:",
    quantity: 18,
    measurementUnits: "мг",
    description: "– Пружа малу количину магнезијума, који је важан за функцију мишића и нерва."
  },
  {
    element: "Цинк:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Садржи трагове цинка, који подржавају имунолошку функцију."
  },
  {
    element: "Витамин Е:",
    quantity: 0.2,
    measurementUnits: "мг",
    description: "– Садржи мале количине витамина Е, који је важан антиоксиданс."
  },
  {
    element: "Витамин А:",
    quantity: 66,
    measurementUnits: "ИУ",
    description: "– Садржи бета-каротен, који подржава здравље вида и имунолошку функцију."
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.07,
    measurementUnits: "мг",
    description: "– Подржава метаболизам енергије."
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.06,
    measurementUnits: "мг",
    description: "– Доприноси производњи енергије и здрављу коже."
  },
  {
    element: "Витамин Б3 (Никотинска киселина):",
    quantity: 0.3,
    measurementUnits: "мг",
    description: "– Подржава метаболизам и помаже у одржавању здраве коже."
  },
  {
    element: "Витамин Б6:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Важан за метаболизам протеина и здравље мозга."
  }
],
cultivationHeading: `Грожђе је једно од најшире узгајаних воћа на свету, цењено због свог слатког укуса и свестраности у производњи вина, сока и за свежу конзумацију. Ево прегледа узгајања грожђа.`,
cultivation: [
  {
    id: 21,
    topic: "Клима",
    children: [
      {
        id: 211,
        topic: "Температура",
        text: "Грожђе најбоље успева у топлим, умереним климатама. Идеалне температуре за раст су од 20°C до 30°C (68°F до 86°F) током сезоне раста, уз потребу за хладном зимом како би се обезбедила мировање.",
      },
      {
        id: 212,
        topic: "Сунчева светлост",
        text: "Винова лоза захтева пуну сунчеву светлост за оптималну производњу плода, потребно је најмање 6 до 8 сати директне сунчеве светлости дневно.",
      },
    ],
  },
  {
    id: 22,
    topic: "Тло",
    children: [
      {
        id: 221,
        topic: "pH",
        text: "Грожђе најбоље расте на добро дренираним земљиштима са pH вредношћу између 5,5 и 7,0. Благо кисела до неутрална земљишта су идеална за узгајање грожђа.",
      },
      {
        id: 222,
        topic: "Тип земљишта",
        text: "Лоамска или пешчана земљишта са добром дренажом су најбоља за грожђе. Тешка глиничка земљишта могу довести до труљења корена и других проблема.",
      },
      {
        id: 223,
        topic: "Припрема земљишта",
        text: "Укључивање органске материје као што је компост у земљиште пре садње може побољшати структуру земљишта и плодноћу.",
      },
    ],
  },
  {
    id: 23,
    topic: "Врсте",
    text: `Популарне врсте грожђа укључују:
                - Каберне Совињон (познато по свом робусном укусу и потенцијалу за старење)
                - Шардоне (свестрано бело грожђе које се користи за производњу како мирних тако и пенушавих вина)
                - Конкорд (слатко столно грожђе популарно за јело и прављење сокова).`,
  },
  {
    id: 24,
    topic: "Садња",
    children: [
      {
        id: 241,
        topic: "Време",
        text: "Најбоље време за садњу грожђа је у рано пролеће, након последњег мраза или у јесен пре него што земља замрзне.",
      },
      {
        id: 242,
        topic: "Размак",
        text: "Винова лоза треба да буде размака од око 1,5 до 2 метра (5 до 6 стопа) у редовима који су удаљени 2 до 3 метра (6 до 10 стопа) како би се омогућио добар проток ваздуха и излагање сунчевој светлости.",
      },
      {
        id: 243,
        topic: "Опрашивање",
        text: "Већина врста грожђа је самопрашивајућа, тако да додатни опрашивачи обично нису потребни за формирање плода.",
      },
    ],
  },
  {
    id: 25,
    topic: "Заливање",
    children: [
      {
        id: 251,
        topic: "Фаза успостављања",
        text: "Ново засадљене винове лозе захтевају редовно заливање како би успоставиле јак коренски систем, држећи земљиште константно влажним али не и натопљеним водом.",
      },
      {
        id: 252,
        topic: "Озбиљне лозе",
        text: "Једном када се успоставе, грожђе је отпорно на сушу, али им је потребно око 500 до 800 мм (20 до 31 инча) воде годишње за оптималну производњу плода.",
      },
      {
        id: 253,
        topic: "Избегавање прекомерног заливања",
        text: "Прекомерно заливање може довести до труљења корена, па је важно обезбедити добру дренажу земљишта.",
      },
    ],
  },
  {
    id: 26,
    topic: "Орезивање",
    children: [
      {
        id: 261,
        topic: "Облик",
        text: "Орезивање је кључно за одржавање облика лозе и подстицање здраве производње плода. Винова лоза се често орезује тако да има уравнотежену структуру, што омогућава добар проток ваздуха.",
      },
      {
        id: 262,
        topic: "Време",
        text: "Орезивање треба обавити крајем зиме или рано пролеће пре него што нови раст започне како би се уклониле мртве, болесне или пренатрпане гране.",
      },
    ],
  },
  {
    id: 27,
    topic: "Ђубрење",
    children: [
      {
        id: 271,
        topic: "Нутријенти",
        text: "Грожђе има користи од уравнотежених ђубрива која обезбеђују есенцијалне нутријенте, посебно азот, фосфор и калијум. Тестови земљишта могу помоћи у одређивању специфичних потреба за нутријентима.",
      },
      {
        id: 272,
        topic: "Време",
        text: "Ђубриво треба применити у рано пролеће пре него што нови раст започне. Избегавајте прекомерно ђубрење касно у сезони раста како бисте спречили прекомерни вегетативни раст.",
      },
    ],
  },
  {
    id: 28,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 281,
        topic: "Штеточине",
        text: "Уобичајени штеточини који утичу на грожђе укључују афиде, паукове гриње и мотоце грожђа. Стратегије интегрисаног управљања штеточинама (IPM), као што су корисни инсекти и органски инсектициди, могу помоћи у контроли ових штеточина.",
      },
      {
        id: 282,
        topic: "Болести",
        text: "Грожђе може бити подложно болестима као што су прашкаста плијесан, долијева плијесан и ботритисно труљење грозда. Превентивне мере укључују правилно орезивање, добар проток ваздуха и коришћење отпорних врста.",
      },
    ],
  },
  {
    id: 29,
    topic: "Жетва",
    children: [
      {
        id: 291,
        topic: "Време",
        text: "Грожђе је обично спремно за жетву од касног лета до ране јесени, у зависности од врсте и климе.",
      },
      {
        id: 292,
        topic: "Знаци зрелости",
        text: "Зрело грожђе је округло, потпуно обојено и слатко на укус. Треба га убрати када је потпуно зрело за најбољи укус.",
      },
      {
        id: 293,
        topic: "Руковање",
        text: "Грожђе треба пажљиво руковати како би се избегло удубљење. Кластери треба пажљиво одсећи са лозе како би се минимизирала оштећења.",
      },
    ],
  },
  {
    id: 30.2,
    topic: "Чување",
    text: "Свежи грожђе може се чувати у фрижидеру око недељу дана. Најбоље је конзумирати свеже, али се такође могу замрзнути за дужи рок чувања.",
    children: [
      {
        id: 30.21,
        topic: `Очување`,
        text: "Грожђе такође може бити осушено да би се произвеле суве грожђице које се могу чувати дуго.",
      },
    ],
  },
  {
    id: 31.2,
    topic: "Орезивање гроздова",
    text: "Орезивање гроздова у раном лету може побољшати величину и квалитет плода смањујући конкуренцију за нутријенте и сунчеву светлост.",
  },
]
    },
    {
        id: 11,
name: "Грејпфрут",
img: fruitsImages.grapefruit,
inGeneralHeading: `Цитрусна енергија`,
inGeneral: `Грејпфрут, велики, кисели плод из врсте Цитрус × парадиси, познат је по свом киселом укусу и бројним здравственим предностима. Доступан у варијантама од беле до ружичасте и рубин црвене боје, грејпфрут је пун нутријената који га чине одличним избором за здраву исхрану.
Једна од најважнијих предности грејпфрута је висок садржај витамина Ц, који подржава имунолошки систем, промовише здравље коже и делује као снажан антиоксиданс који помаже у заштити ћелија од оштећења узрокованих слободним радикалима. Грејпфрут је такође богат влакнима, која подржавају варење, помажу у регулисању нивоа шећера у крви и промовишу осећај ситости, што помаже у управљању тежином.
Грејпфрут је такође познат по ниском садржају калорија и високом проценту воде, што га чини хидратантним, освежавајућим плодом који се одлично уклапа у дијете за мршављење. Поред тога, садржи калијум, који је есенцијалан за здравље срца и одржавање правилног крвног притиска.
Овај плод такође садржи моћне биљне супстанце попут ликопена (посебно у ружичастој и црвеној варијанти), који је повезан са смањеним ризиком од одређених врста рака, као и флавоноиде који имају антиинфламаторна својства.
У кулинарству, грејпфрут се може конзумирати на разне начине. Може се јести сам, исциједити као сок, додавати у салате или користити у смоотхијима. Његова киселост такође се одлично уклапа са слатким и сланим јелима.
Укратко, грејпфрут је плод пун нутријената који пружа бројне здравствене предности, укључујући подршку имунолошком систему, здрављу срца и помоћ у управљању тежином. Његов освежавајући укус и разноврсност чине га одличним додатком свакој исхрани.`,
topic1: "Нутриција и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 42,
    measurementUnits: "кцал",
    description: "– Низак садржај калорија, чинећи га одличним избором за здрави снацк."
  },
  {
    element: "Масти:",
    quantity: 0.1,
    measurementUnits: "г",
    description: "– Врло низак садржај масти, што доприноси здравој исхрани."
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0.0,
    measurementUnits: "г",
    description: "– Садржи занемарљиве количине засићених масти."
  },
  {
    element: "Витамин Б3 (Никотинска киселина):",
    quantity: 0.4,
    measurementUnits: "мг",
    description: "– Подржава метаболизам и помаже у одржавању здраве коже и нерва."
  },
  {
    element: "Натријум:",
    quantity: 1,
    measurementUnits: "мг",
    description: "– Изузетно низак садржај натријума, користан за здравље срца."
  },
  {
    element: "Калијум:",
    quantity: 135,
    measurementUnits: "мг",
    description: "– Добар извор калијума, који је есенцијалан за равнотежу течности и функцију мишића."
  },
  {
    element: "Угљени хидрати:",
    quantity: 10.7,
    measurementUnits: "г",
    description: "– Извор угљених хидрата, углавном из природних шећера и дијеталних влакана."
  },
  {
    element: "Влакна:",
    quantity: 1.4,
    measurementUnits: "г",
    description: "– Садржи дијетална влакна, која подржавају здраво варење."
  },
  {
    element: "Шећери:",
    quantity: 7.3,
    measurementUnits: "г",
    description: "– Садржи природне шећере, који пружају слаткоћу."
  },
  {
    element: "Протеини:",
    quantity: 0.8,
    measurementUnits: "г",
    description: "– Садржи минималне количине протеина, који доприносе укусу."
  },
  {
    element: "Витамин Ц:",
    quantity: 31.2,
    measurementUnits: "мг",
    description: "– Одличан извор витамина Ц, који подржава имунолошку функцију и здравље коже."
  },
  {
    element: "Калцијум:",
    quantity: 18,
    measurementUnits: "мг",
    description: "– Пружа малу количину калцијума, који доприноси здрављу костију."
  },
  {
    element: "Гвожђе:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Садржи минималне количине гвожђа, који је важан за транспорт кисеоника у крви."
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Подржава метаболизам енергије конвертујући угљене хидрате у енергију."
  },
  {
    element: "Витамин Б6:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Учествује у метаболизму и когнитивној функцији."
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.03,
    measurementUnits: "мг",
    description: "– Има улогу у производњи енергије и одржавању здраве коже."
  },
  {
    element: "Магнезијум:",
    quantity: 10,
    measurementUnits: "мг",
    description: "– Садржи мале количине магнезијума, који је важан за функцију мишића и нерва."
  },
  {
    element: "Цинк:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Пружа минималне количине цинка, који подржавају имунолошку функцију."
  },
  {
    element: "Витамин Е:",
    quantity: 0.2,
    measurementUnits: "мг",
    description: "– Садржи мале количине витамина Е, који има антиоксидативна својства."
  },
  {
    element: "Витамин А:",
    quantity: 0,
    measurementUnits: "ИУ",
    description: "– Грејпфрут није значајан извор витамина А."
  }
],
cultivationHeading: `Грејпфрут је цитрусно воће познато по свом киселкастом укусу и сочности. Често се конзумира свеж, у облику сока или у разним кулинарским јелима. Грејпфрут успева у топлим климатима и може се гајити комерцијално или у кућним баштама. Ево прегледа култивације грејпфрута`,
cultivation: [
  {
    id: 21,
    topic: "Клима",
    children: [
      {
        id: 211,
        topic: "Температура",
        text: "Грејпфрут успева у суптропској до тропској клими, захтевајући топле температуре. Идеалне температуре за раст су од 20°C до 30°C (68°F до 86°F), а осетљив је на мраз.",
      },
      {
        id: 212,
        topic: "Сунчева светлост",
        text: "Грејпфрут захтева пуно сунчеве светлости за оптималан раст и производњу плодова, са најмање 6 до 8 сати директне сунчеве светлости дневно.",
      },
    ],
  },
  {
    id: 22,
    topic: "Земљиште",
    children: [
      {
        id: 221,
        topic: "pH",
        text: "Грејпфрут преферира добро дренирано, песковито или иловасто земљиште са pH вредношћу између 5,5 и 6,5 за оптималан раст.",
      },
      {
        id: 222,
        topic: "Тип земљишта",
        text: "Песковита земљишта су идеална јер пружају добру дренажу и мање су склона задржавању воде, што грејпфрут не подноси.",
      },
      {
        id: 223,
        topic: "Припрема земљишта",
        text: "Пре садње, додајте органску материју попут компоста како бисте побољшали структуру и плодност земљишта.",
      },
    ],
  },
  {
    id: 23,
    topic: "Сорте",
    text: `Популарне сорте грејпфрута укључују:
                            - Ruby Red (позната по свом слатком укусу и јарко црвеној боји)
                            - Pink (нуди баланс између слатког и киселог укуса)
                            - White (крупнија са више киселкастим укусом).`,
  },
  {
    id: 24,
    topic: "Садња",
    children: [
      {
        id: 241,
        topic: "Време",
        text: "Најбоље време за садњу грејпфрута је пролеће након последњег мраза, омогућавајући стаблима да се успоставе пре врелог лета.",
      },
      {
        id: 242,
        topic: "Размак",
        text: "Стабла грејпфрута треба поставити на раздаљини од око 5 до 6 метара (16 до 20 стопа) како би се омогућила адекватна циркулација ваздуха и сунчева светлост.",
      },
      {
        id: 243,
        topic: "Опрашивање",
        text: "Грејпфрут је обично самоопрашујући, али садња више сорти може побољшати квалитет и количину плодова.",
      },
    ],
  },
  {
    id: 25,
    topic: "Заливање",
    children: [
      {
        id: 251,
        topic: "Фаза успостављања",
        text: "Новосађена стабла грејпфрута захтевају редовно заливање како би се помогло у успостављању корена, држећи земљиште стално влажним, али не и преплављеним.",
      },
      {
        id: 252,
        topic: "Зрела стабла",
        text: "Када се успоставе, стаблима грејпфрута је потребно око 600 до 800 мм (24 до 31 инч) воде годишње. Пожељно је дубоко заливање како би се подстакло дубоко укорењивање.",
      },
      {
        id: 253,
        topic: "Избегавање претераног заливања",
        text: "Превише влаге може довести до труљења корена; стога осигурајте добру дренажу у области садње.",
      },
    ],
  },
  {
    id: 26,
    topic: "Орезивање",
    children: [
      {
        id: 261,
        topic: "Облик",
        text: "Орезивање помаже у одржавању пожељног облика и побољшању циркулације ваздуха унутар крошње, смањујући ризик од болести.",
      },
      {
        id: 262,
        topic: "Време",
        text: "Орезивање се треба обављати крајем зиме или рано у пролеће пре него што почне нови раст, како би се уклониле мртве, оболеле или пренатрпане гране.",
      },
    ],
  },
  {
    id: 27,
    topic: "Ђубрење",
    children: [
      {
        id: 271,
        topic: "Хранљиве материје",
        text: "Стаблима грејпфрута користи редовно ђубрење уравнотеженим ђубривом (нпр. 8-8-8 NPK) како би се подржао здрав раст и плодоношење.",
      },
      {
        id: 272,
        topic: "Време",
        text: "Ђубриво треба наносити рано у пролеће и поново крајем лета како би се обезбедила адекватна доступност хранљивих материја током вегетације.",
      },
    ],
  },
  {
    id: 28,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 281,
        topic: "Штеточине",
        text: "Честе штеточине укључују ваши, инсекте вага и лисне минере. Примена интегрисаних стратегија управљања штеточинама (IPM) може ефикасно помоћи у контроли ових штеточина.",
      },
      {
        id: 282,
        topic: "Болести",
        text: "Грејпфрут може бити погођен болестима као што су цитрусно зеленило, труљење корена и чађава буђ. Правилна нега и праћење могу помоћи у спречавању ових проблема.",
      },
    ],
  },
  {
    id: 29,
    topic: "Берба",
    children: [
      {
        id: 291,
        topic: "Време",
        text: "Грејпфрут је обично спреман за бербу зими до раног пролећа, у зависности од сорте и климе.",
      },
      {
        id: 292,
        topic: "Знаци зрелости",
        text: "Зрео грејпфрут је чврст на додир, има јарку боју и емитује пријатан цитрусни мирис. Треба га убрати када је потпуно зрео за најбољи укус.",
      },
      {
        id: 293,
        topic: "Руковање",
        text: "Са грејпфрутом треба поступати пажљиво како би се избегло модрице, а након бербе треба га складиштити на хладном и сувом месту.",
      },
    ],
  },
  {
    id: 30.2,
    topic: "Складиштење",
    text: "Грејпфрут се може складиштити на собној температури до недељу дана или у фрижидеру до 2 недеље. Правилно складиштење помаже у одржавању свежине.",
    children: [
      {
        id: 30.21,
        topic: `Очување`,
        text: "Грејпфрут се такође може исцедити у сок или користити у кувању како би се продужила његова употреба ван свежег конзумирања.",
      },
    ],
  },
  {
    id: 31.2,
    topic: "Проређивање",
    text: "Проређивање сувишних плодова током вегетације може побољшати величину и квалитет плодова смањењем конкуренције за хранљиве материје.",
  },
],
    },
    {
        id: 12,
name: "Киви",
img: fruitsImages.kiwi,
inGeneralHeading: `Нутријентска моћ у малом паковању`,
inGeneral: `Киви, такође познат као Actinidia deliciosa, је мали, смеђи, љуљасти плод са живо зеленом или жутом пулпом и ситним црним семенкама. Познат по свом слатко-киселом укусу, киви је пун есенцијалних нутријената и нуди бројне здравствене предности.
Једна од најистакнутијих карактеристика кивија је висок садржај витамина Ц. Заправо, један киви пружа више од дневно препорученог уноса витамина Ц, који помаже у јачању имунолошког система, промовише здравље коже и делује као моћан антиоксиданс који штити организам од оксидативног стреса. Киви је такође богат дијеталним влакнима, која помажу у варењу, подржавају здравље црева и помажу у регулисању нивоа шећера у крви.
Поред витамина Ц, киви садржи и друге важне нутријенте као што је витамин К, који подржава здравље костију и правилно згрушавање крви, и калијум, који помаже у регулисању крвног притиска и подржава здравље срца. Киви такође садржи антиоксиданте као што су лутеин и зеаксантин, који су корисни за здравље очију, помажући у заштити од старосног дегенеративног обољења макуле.
Киви је плод са ниским калоријским садржајем који се лако може укључити у било коју исхрану. Може се јести самостално, додавати у воћне салате, блендирати у смоотхије или користити као топинг за јогурт и житарице. Његов кисели укус такође се одлично уклапа са слатким и сланим јелима.
Укратко, киви је плод богат нутријентима који нуди низ здравствених предности, од јачања имунитета до подршке здрављу срца и варењу. Његов јединствен укус и разноврсност чине га деликатесом која је савршен додатак здравој исхрани.`,
topic1: "Нутриција и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 61,
    measurementUnits: "кцал",
    description: "– Низак садржај калорија, чинећи га хранљивим и освежавајућим снацком."
  },
  {
    element: "Масти:",
    quantity: 0.5,
    measurementUnits: "г",
    description: "– Врло низак садржај масти, доприносећи његовом здравом профилу."
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0.1,
    measurementUnits: "г",
    description: "– Садржи минималне количине засићених масти, што подржава здравље срца."
  },
  {
    element: "Натријум:",
    quantity: 3,
    measurementUnits: "мг",
    description: "– Врло низак садржај натријума, користан за регулисање крвног притиска."
  },
  {
    element: "Калијум:",
    quantity: 312,
    measurementUnits: "мг",
    description: "– Добар извор калијума, који је есенцијалан за функцију мишића и равнотежу течности."
  },
  {
    element: "Угљени хидрати:",
    quantity: 14.7,
    measurementUnits: "г",
    description: "– Богат угљеним хидратима, пружа брз извор енергије."
  },
  {
    element: "Влакна:",
    quantity: 3,
    measurementUnits: "г",
    description: "– Висок садржај дијеталних влакана, која подржавају здраво варење."
  },
  {
    element: "Шећери:",
    quantity: 8.99,
    measurementUnits: "г",
    description: "– Садржи природне шећере, који доприносе слатком укусу."
  },
  {
    element: "Протеини:",
    quantity: 1.1,
    measurementUnits: "г",
    description: "– Пружа малу количину протеина из биљних извора."
  },
  {
    element: "Витамин Ц:",
    quantity: 92.7,
    measurementUnits: "мг",
    description: "– Одличан извор витамина Ц, који је важан за имунолошку функцију и здравље коже."
  },
  {
    element: "Калцијум:",
    quantity: 18,
    measurementUnits: "мг",
    description: "– Пружа малу количину калцијума, који доприноси здрављу костију."
  },
  {
    element: "Гвожђе:",
    quantity: 0.31,
    measurementUnits: "мг",
    description: "– Садржи трагове гвожђа, неопходног за производњу здравих црвених крвних зрнаца."
  },
  {
    element: "Магнезијум:",
    quantity: 17,
    measurementUnits: "мг",
    description: "– Пружа малу количину магнезијума, који је важан за функцију мишића и нерва."
  },
  {
    element: "Цинк:",
    quantity: 0.14,
    measurementUnits: "мг",
    description: "– Садржи трагове цинка, који подржавају имунолошку функцију."
  },
  {
    element: "Витамин Е:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Садржи мале количине витамина Е, важног антиоксиданса."
  },
  {
    element: "Витамин А:",
    quantity: 87,
    measurementUnits: "ИУ",
    description: "– Садржи бета-каротен, који подржава здравље вида и имунитета."
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.02,
    measurementUnits: "мг",
    description: "– Подржава метаболизам енергије."
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.04,
    measurementUnits: "мг",
    description: "– Доприноси производњи енергије и здрављу коже."
  },
  {
    element: "Витамин Б3 (Никотинска киселина):",
    quantity: 0.3,
    measurementUnits: "мг",
    description: "– Подржава метаболизам и помаже у одржавању здраве коже."
  },
  {
    element: "Витамин Б6:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Важан за метаболизам протеина и здравље мозга."
  }
],
cultivationHeading: `Киви, такође познат као киви плод, је мали, нутритивно богат плод са јединственим укусом и скупим кором. Првенствено се гаји у умереним подручјима и захтева специфичне услове за успешну култивацију. Ево прегледа култивације кивија.`,
cultivation: [
  {
    id: 21,
    topic: "Клима",
    children: [
      {
        id: 211,
        topic: "Температура",
        text: "Киви расте у умереној клими и захтева баланс топлих лета и хладних зиме. Идеалне температуре за раст су од 15°C до 25°C (59°F до 77°F) током растне сезоне.",
      },
      {
        id: 212,
        topic: "Осетљивост на мраз",
        text: "Киви је осетљив на мраз, посебно током цветања и развоја плода. Период без мраза од око 200 дана је идеалан за успешну култивацију.",
      },
    ],
  },
  {
    id: 22,
    topic: "Тло",
    children: [
      {
        id: 221,
        topic: "pH",
        text: "Киви преферира добро дренирано, плодном тло са pH вредношћу између 6.0 и 7.0.",
      },
      {
        id: 222,
        topic: "Тип тла",
        text: "Лоамско или пешчано тло су идеални, јер омогућавају добро одводњавање и аерацију. Киви не подноси натопљене услове.",
      },
      {
        id: 223,
        topic: "Припрема тла",
        text: "Убацивање органске материје, као што су компост или добро разграђени стајњак, у тло пре садње побољшава плодност и структуру тла.",
      },
    ],
  },
  {
    id: 23,
    topic: "Врсте",
    text: `Популарне врсте кивија укључују:
                            - Хејворд (најчешће гајени, познат по свом слатком укусу и зеленој пулпи)
                            - Арктички киви (издржљивија врста која може поднети хладније климе)
                            - Издржљиви киви (производи мање, глатке плодове са јединственим укусом).`,
  },
  {
    id: 24,
    topic: "Садња",
    children: [
      {
        id: 241,
        topic: "Време",
        text: "Најбоље време за садњу кивија је пролеће, након последњег мраза, или јесен пре првог мраза, омогућавајући коренима да се утврде пре растне сезоне.",
      },
      {
        id: 242,
        topic: "Размак",
        text: "Киви лозе треба да буду распоређене на око 3 до 4 метра (10 до 13 стопа) како би омогућиле адекватан раст и проток ваздуха.",
      },
      {
        id: 243,
        topic: "Опрашивање",
        text: "Већина сорти кивија је дихотомијска, што значи да су мушки и женски цветови на различитим биљкама. Садња и мушких и женских сорта је неопходна за формирање плода.",
      },
    ],
  },
  {
    id: 25,
    topic: "Заливање",
    children: [
      {
        id: 251,
        topic: "Фаза успостављања",
        text: "Ново посађене лозе кивија захтевају константно заливање како би се утврдили корени, држећи тло константно влажним, али не и натопљеним.",
      },
      {
        id: 252,
        topic: "Зреле лозе",
        text: "Када се утврде, лозе кивија захтевају око 500 до 800 мм (20 до 31 инча) воде годишње. Дубоко заливање се преферира како би се подстакао дубок раст корена.",
      },
      {
        id: 253,
        topic: "Избегавајте прекомерно заливање",
        text: "Лозе кивија су подложне труљењу корена, па је важно избегавати прекомерно заливање и осигурати правилно одводњавање.",
      },
    ],
  },
  {
    id: 26,
    topic: "Орезивање",
    children: [
      {
        id: 261,
        topic: "Облик",
        text: "Орезивање помаже у одржавању жељеног облика и величине лозе кивија, истовремено подстичући циркулацију ваздуха и продор светлости.",
      },
      {
        id: 262,
        topic: "Време",
        text: "Орезивање треба да се изврши касне зиме или раног пролећа пре него што започне нови раст, уклањајући сву мртву или оштећену грађу.",
      },
    ],
  },
  {
    id: 27,
    topic: "Ђубрење",
    children: [
      {
        id: 271,
        topic: "Нутријенти",
        text: "Лозе кивија имају користи од редовног ђубрења са уравнотеженим ђубривом (нпр. 10-10-10 NPK) за подршку здравом расту и рађању плода.",
      },
      {
        id: 272,
        topic: "Време",
        text: "Ђубриво треба применити рано пролеће пре почетка новог раста, а поново у средини лета како би се подстакао развој плода.",
      },
    ],
  },
  {
    id: 28,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 281,
        topic: "Штеточине",
        text: "Уобичајене штеточине које погађају киви укључују афиде, паукове гриње и љуске. Примена интегрисаних стратегија за управљање штеточинама (IPM) може помоћи у ефикасној контроли ових штеточина.",
      },
      {
        id: 282,
        topic: "Болести",
        text: "Лозе кивија могу бити погођене болестима као што су труљење корена, бактеријски рак и прашкасти плесан. Превентивне мере укључују правилну праксу наводњавања и праћење симптома.",
      },
    ],
  },
  {
    id: 29,
    topic: "Жетва",
    children: [
      {
        id: 291,
        topic: "Време",
        text: "Киви је обично спреман за жетву у касну јесен до рану зиму, зависно од сорте и климе.",
      },
      {
        id: 292,
        topic: "Знаци зрењa",
        text: "Зрео киви је благо мекан на додир и има ароматичан мирис. Треба га убрати када је потпуно зрео за најбољи укус.",
      },
      {
        id: 293,
        topic: "Руковање",
        text: "Киви треба пажљиво руковати како би се избегло удубљење и треба га складиштити на хладном, сувом месту након жетве.",
      },
    ],
  },
  {
    id: 30.2,
    topic: "Складиштење",
    text: "Киви се може чувати на собној температури неколико дана даље сазри или у фрижидеру до 2 до 3 недеље. Правилно складиштење помаже у одржавању свежине.",
    children: [
      {
        id: 30.21,
        topic: "Очување",
        text: "Киви се такође може користити у смутијима, десертима или салатама како би се продужила његова употреба ван свеже конзумације.",
      },
    ],
  },
  {
    id: 31.2,
    topic: "Проређивање",
    text: "Откидање вишка плода током растне сезоне може побољшати величину и квалитет плода смањењем конкуренције за хранљиве материје.",
  },
]
    },
    {
        id: 13,
name: "Лимун",
img: fruitsImages.lemon,
inGeneralHeading: `Освежавајући цитрусни суперстар`,
inGeneral: `Лимуни, научно познати као Citrus limon, су живо жути плодови који су ценени због свог освежавајућег укуса и бројних здравствених предности. Познати по свом киселом укусу, лимун је основни састојак у кухињама широм света, користи се у свему, од пића до десерта и сланих јела.
Једна од најзначајнијих предности лимунa је његов висок садржај витамина Ц. Један лимун може да обезбеди значајан део дневно препорученог уноса витамина Ц, који је есенцијалан за имунолошку функцију, здравље коже и производњу колагена. Овај моћан антиоксиданс помаже у заштити ћелија од оштећења узрокованих слободним радикалима, подржавајући укупно здравље и добробит.
Лимуни такође садрже разне корисне биљне компоне, укључујући флавоноиде, који имају антиинфламаторна и антиоксидативна својства. Ови компони могу допринети смањењу ризика од хроничних болести, као што су болести срца и рак. Поред тога, лимун је добар извор калијума, који игра важну улогу у регулисању крвног притиска и подршци здрављу срца.
Укључивање лимуна у исхрану је лако. Сок од свежег лимуна може побољшати укус воде, дресинга за салате, маринада и пецива. Лимунова кора додаје мирисну ноту разним јелима, а лимун се може користити и у пићима као што су лимонада или коктели.
Укратко, лимун је разноврсан плод који нуди бројне здравствене предности, укључујући јачање имунитета и подршку здрављу срца. Његов живописни укус и кулинарска разноврсност чине га основним састојком у многим јелима, побољшавајући и укус и исхрану.`,
topic1: "Нутриција и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 29,
    measurementUnits: "кцал",
    description: "– Низак садржај калорија, што га чини освежавајућим додацима разним јелима и пићима."
  },
  {
    element: "Масти:",
    quantity: 0.3,
    measurementUnits: "г",
    description: "– Врло низак садржај масти, што подржава здраву исхрану."
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0.1,
    measurementUnits: "г",
    description: "– Садржи занемарљиве количине засићених масти."
  },
  {
    element: "Витамин Б3 (Никотинска киселина):",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Подржава метаболизам и игра улогу у одржавању здраве коже и нервног система."
  },
  {
    element: "Натријум:",
    quantity: 1,
    measurementUnits: "мг",
    description: "– Врло низак садржај натријума, користан за здравље срца."
  },
  {
    element: "Калијум:",
    quantity: 138,
    measurementUnits: "мг",
    description: "– Добар извор калијума, који је есенцијалан за равнотежу течности и функцију мишића."
  },
  {
    element: "Угљени хидрати:",
    quantity: 9.3,
    measurementUnits: "г",
    description: "– Садржи угљене хидрате углавном из природних шећера и влакана."
  },
  {
    element: "Влакна:",
    quantity: 2.8,
    measurementUnits: "г",
    description: "– Висок садржај дијеталних влакана, која подржавају здраво варење."
  },
  {
    element: "Шећери:",
    quantity: 2.5,
    measurementUnits: "г",
    description: "– Садржи природне шећере, који пружају благу слаткоћу."
  },
  {
    element: "Протеини:",
    quantity: 1.1,
    measurementUnits: "г",
    description: "– Садржи минималне количине протеина, доприносећи укупном уносу нутријената."
  },
  {
    element: "Витамин Ц:",
    quantity: 53,
    measurementUnits: "мг",
    description: "– Одличан извор витамина Ц, који подржава имунолошку функцију и здравље коже."
  },
  {
    element: "Калцијум:",
    quantity: 26,
    measurementUnits: "мг",
    description: "– Пружа неки калцијум, који доприноси здрављу костију."
  },
  {
    element: "Гвожђе:",
    quantity: 0.6,
    measurementUnits: "мг",
    description: "– Садржи минималне количине гвожђа, важно за транспорт кисеоника у крви."
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.08,
    measurementUnits: "мг",
    description: "– Подржава метаболизам енергије претварањем угљених хидрата у енергију."
  },
  {
    element: "Витамин Б6:",
    quantity: 0.08,
    measurementUnits: "мг",
    description: "– Укључен у метаболизам и когнитивне функције."
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.02,
    measurementUnits: "мг",
    description: "– Има улогу у производњи енергије и одржавању здраве коже."
  },
  {
    element: "Магнезијум:",
    quantity: 8,
    measurementUnits: "мг",
    description: "– Садржи мале количине магнезијума, који је важан за функцију мишића и нерва."
  },
  {
    element: "Цинк:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Пружа минималне количине цинка, који подржавају имунолошку функцију."
  },
  {
    element: "Витамин Е:",
    quantity: 0.2,
    measurementUnits: "мг",
    description: "– Садржи мале количине витамина Е, који има антиоксидативна својства."
  },
  {
    element: "Витамин А:",
    quantity: 0,
    measurementUnits: "ИУ",
    description: "– Лимуни нису значајан извор витамина А."
  }
],
cultivationHeading: `Лимун је веома цењен због свог киселкастог укуса и широко се користи у кулинарским применама, пићима и као природни конзерванс. Најбоље расте у топлим климатским условима и може се гајити како у комерцијалним воћњацима, тако и у кућним вртовима. Ево прегледа култивације лимуна.`,
cultivation: [
  {
    id: 21,
    topic: "Клима",
    children: [
      {
        id: 211,
        topic: "Температура",
        text: "Лимунова стабла најбоље расту у топлим, суптропским до тропским климатским условима. Идеалан температурни распон за оптималан раст је између 20°C и 30°C (68°F до 86°F).",
      },
      {
        id: 212,
        topic: "Осетљивост на мраз",
        text: "Лимунова стабла су осетљива на мраз и могу претрпети оштећења када температуре падну испод -2°C (28°F). Заштита стабала током хладних таласа је неопходна у хладнијим климама.",
      },
    ],
  },
  {
    id: 22,
    topic: "Тло",
    children: [
      {
        id: 221,
        topic: "pH",
        text: "Лимунова стабла преферирају добро дренирано, песковито или лоамско тло са pH вредношћу између 5.5 и 6.5.",
      },
      {
        id: 222,
        topic: "Тип тла",
        text: "Тла са добрим одводњавањем су од кључне важности, јер лимунова стабла не подносе натопљене услове. Подигнути кревети или брда могу помоћи у побољшању одводњавања.",
      },
      {
        id: 223,
        topic: "Припрема тла",
        text: "Додавање органске материје, као што је компост, у тло пре садње побољшава плодност и одводњавање.",
      },
    ],
  },
  {
    id: 23,
    topic: "Врсте",
    text: `Популарне врсте лимуна укључују:
                            - Еурека (честа за комерцијалну производњу, позната по сочном плоду).
                            - Лисабон (сличан Еурека, али са мање трња).
                            - Мајер (хибрид са слатким укусом и танком кожом).`,
  },
  {
    id: 24,
    topic: "Садња",
    children: [
      {
        id: 241,
        topic: "Време",
        text: "Најбоље време за садњу лимунових стабала је пролеће или рано лето када је ризик од мраза прошао.",
      },
      {
        id: 242,
        topic: "Размак",
        text: "Лимунова стабла треба посадити на раздаљини од 4 до 6 метара (13 до 20 стопа) како би се омогућио адекватан раст и циркулација ваздуха.",
      },
      {
        id: 243,
        topic: "Опрашивање",
        text: "Већина лимунових врста је самопрашивајућа, али садња више стабала може повећати принос плода.",
      },
    ],
  },
  {
    id: 25,
    topic: "Заливање",
    children: [
      {
        id: 251,
        topic: "Фаза успостављања",
        text: "Ново посађена лимунова стабла захтевају редовно заливање како би успоставила корене, држећи тло константно влажним, али не натопљеним.",
      },
      {
        id: 252,
        topic: "Зрела стабла",
        text: "Када се утврде, лимунова стабла захтевају око 50 до 100 мм (2 до 4 инча) воде месечно током расадачке сезоне. Преферира се дубоко заливање како би се подстакнуо дубок раст корена.",
      },
      {
        id: 253,
        topic: "Избегавање прекомерног заливања",
        text: "Прекомерно заливање може довести до труљења корена, па је важно осигурати добру одводњу и прилагодити учесталост заливања у зависности од количине падавина.",
      },
    ],
  },
  {
    id: 26,
    topic: "Орезивање",
    children: [
      {
        id: 261,
        topic: "Облик",
        text: "Орезивање помаже у одржавању уравнотеженог облика стабла, уклањањем мртвих или болесних грана и подстиче циркулацију ваздуха.",
      },
      {
        id: 262,
        topic: "Време",
        text: "Орезивање лимунових стабала треба обавити касно у зими или рано пролеће пре него што почне нови раст, како би се подстакнуо здрав развој.",
      },
    ],
  },
  {
    id: 27,
    topic: "Ђубрење",
    children: [
      {
        id: 271,
        topic: "Нутријенти",
        text: "Лимунова стабла имају користи од редовног ђубрења са уравнотеженим ђубривом (нпр. 10-10-10 NPK) или ђубривом специјално формулисаним за цитрусне биљке.",
      },
      {
        id: 272,
        topic: "Време",
        text: "Ђубриво треба применити рано пролеће, са другом применом касно у лето како би се подржао развој плода.",
      },
    ],
  },
  {
    id: 28,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 281,
        topic: "Штеточине",
        text: "Уобичајене штеточине укључују афиде, паукове гриње и цитрусне лисне рударе. Применом интегрисаног управљања штеточинама (IPM) може се ефикасно контролисати ове штеточине.",
      },
      {
        id: 282,
        topic: "Болести",
        text: "Лимунова стабла су подложна болестима као што су труљење корена, лимунова краста и зелена болест. Добре културне праксе и праћење симптома могу помоћи у спречавању ових проблема.",
      },
    ],
  },
  {
    id: 29,
    topic: "Жетва",
    children: [
      {
        id: 291,
        topic: "Време",
        text: "Лимунови плодови обично достижу зрелост 6 до 9 месеци након цветања, у зависности од врсте и услова раста.",
      },
      {
        id: 292,
        topic: "Знаци зрењa",
        text: "Зрели лимунови су светло жути, чврсти и благо мекани на додир. Треба их убрати када су потпуно зрели за најбољи укус.",
      },
      {
        id: 293,
        topic: "Руковање",
        text: "Лимунове треба пажљиво руковати како би се избегло настајање модрица и складиштити их на хладном, сувом месту након жетве.",
      },
    ],
  },
  {
    id: 30.2,
    topic: "Складиштење",
    text: "Лимунове се могу чувати на собној температури око недељу дана или у фрижидеру 2 до 3 недеље. Правилно складиштење помаже у одржавању свежине.",
    children: [
      {
        id: 30.21,
        topic: "Очување",
        text: "Лимунове такође можете исцедити, нарендати или користити у разним кулинарским применама како бисте продужили њихову употребу ван свеже конзумације.",
      },
    ],
  },
  {
    id: 31.2,
    topic: "Осимавање",
    text: "Осимавање вишка плода током раста сезоне може побољшати величину и квалитет плода смањењем конкуренције за хранљиве материје.",
  },
],

    },
    {
        id: 14,
name: "Манго",
img: fruitsImages.mango,
inGeneralHeading: `Краљ воћа`,
inGeneral: `Манго, научно познат као Mangifera indica, често се слави као "краљ воћа" због своје дивне слаткоће и богата укуса. Ова тропска воћка, која долази у различитим облицима, величинама и бојама, ужива широку популарност због свог укусног укуса и бројних здравствених предности.
Једна од најзначајнијих особина манга је његов висок садржај витамина Ц. Један манго може да обезбеди више од 100% дневно препорученог уноса овог есенцијалног витамина, који је кључан за јачање имуног система, подршку здрављу коже и помоћ у лечењу рана. Поред тога, манго је богат витамином А, који подржава здравље очију и игра важну улогу у одржавању здраве коже.
Мангои су такође пуни антиоксиданата, укључујући бета-каротен и полифеноле, који помажу у борби против оксидативног стреса и смањују инфламацију у телу. Ови антиоксиданти могу допринети смањењу ризика од хроничних болести, као што су болести срца и неки облици рака. Штавише, манго садржи дијетална влакна, која помажу у варењу и промовишу осећај ситости, што га чини одличним избором за дијете за контролу тежине.
Кулинарски, манго је невероватно разноврстан. Може се конзумирати свеже, стављати у смутије, додавати у салате или користити у десертима. Његов слатки укус такође се добро слаже са зачињеним јелима, чинећи га популарним састојком у салсама и маринадама.
Укратко, манго је воће богато нутријентима које нуди диван укус и бројне здравствене предности, што га чини омиљеним међу љубитељима воћа свуда.`,
topic1: "Нутриција и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 60,
    measurementUnits: "кцал",
    description: "– Низак садржај калорија, што га чини слатким и хранљивим снацком."
  },
  {
    element: "Масти:",
    quantity: 0.4,
    measurementUnits: "г",
    description: "– Врло низак садржај масти, доприноси здравом профилу."
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0.1,
    measurementUnits: "г",
    description: "– Садржи минималне количине засићених масти, што промовише здравље срца."
  },
  {
    element: "Натријум:",
    quantity: 1,
    measurementUnits: "мг",
    description: "– Врло низак садржај натријума, користан за регулисање крвног притиска."
  },
  {
    element: "Калијум:",
    quantity: 168,
    measurementUnits: "мг",
    description: "– Добар извор калијума, који је есенцијалан за функцију мишића и равнотежу течности."
  },
  {
    element: "Угљени хидрати:",
    quantity: 15,
    measurementUnits: "г",
    description: "– Богат угљеним хидратима, пружа брз извор енергије."
  },
  {
    element: "Влакна:",
    quantity: 1.6,
    measurementUnits: "г",
    description: "– Садржи дијетална влакна, која подржавају здраво варење."
  },
  {
    element: "Шећери:",
    quantity: 13.7,
    measurementUnits: "г",
    description: "– Садржи природне шећере, који доприносе његовом слатком укусу."
  },
  {
    element: "Протеини:",
    quantity: 0.8,
    measurementUnits: "г",
    description: "– Пружа малу количину протеина из биљних извора."
  },
  {
    element: "Витамин Ц:",
    quantity: 36.4,
    measurementUnits: "мг",
    description: "– Одличан извор витамина Ц, важан за имунолошку функцију и здравље коже."
  },
  {
    element: "Калцијум:",
    quantity: 18,
    measurementUnits: "мг",
    description: "– Пружа малу количину калцијума, који доприноси здрављу костију."
  },
  {
    element: "Гвожђе:",
    quantity: 0.16,
    measurementUnits: "мг",
    description: "– Садржи трагове гвожђа, неопходног за здраву производњу црвених крвних зрнаца."
  },
  {
    element: "Магнезијум:",
    quantity: 10,
    measurementUnits: "мг",
    description: "– Пружа малу количину магнезијума, који је важан за функцију мишића и нерва."
  },
  {
    element: "Цинк:",
    quantity: 0.16,
    measurementUnits: "мг",
    description: "– Садржи трагове цинка, који подржава имунолошку функцију."
  },
  {
    element: "Витамин Е:",
    quantity: 0.16,
    measurementUnits: "мг",
    description: "– Садржи мале количине витамина Е, важног антиоксиданса."
  },
  {
    element: "Витамин А:",
    quantity: 1086,
    measurementUnits: "ИУ",
    description: "– Висок садржај витамина А, који подржава здравље очију и имунитет."
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.05,
    measurementUnits: "мг",
    description: "– Подржава метаболизам енергије."
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.06,
    measurementUnits: "мг",
    description: "– Доприноси производњи енергије и здрављу коже."
  },
  {
    element: "Витамин Б3 (Никотинска киселина):",
    quantity: 0.6,
    measurementUnits: "мг",
    description: "– Подржава метаболизам и помаже одржавање здраве коже."
  },
  {
    element: "Витамин Б6:",
    quantity: 0.2,
    measurementUnits: "мг",
    description: "– Важан за метаболизам протеина и здравље мозга."
  }
],
cultivationHeading: `Манго је једно од најпопуларнијих и најшире конзумираних воћа на свету, познато по свом слатком, сочном месу и живописном укусу. Првенствено се гаји у тропским и суптропским регионима. Ево прегледа култивације манга.`,
cultivation: [
  {
    id: 21,
    topic: "Клима",
    children: [
      {
        id: 211,
        topic: "Температура",
        text: "Манговa стабла најбоље расту у топлим тропским и суптропским климама. Идеална температура за раст манга је између 24°C и 30°C (75°F до 86°F).",
      },
      {
        id: 212,
        topic: "Осетљивост на мраз",
        text: "Мангова стабла су осетљива на мраз и могу претрпети оштећења када температуре падну испод 0°C (32°F). Заштита младих стабала од мраза је важна у хладнијим регионима.",
      },
    ],
  },
  {
    id: 22,
    topic: "Тло",
    children: [
      {
        id: 221,
        topic: "pH",
        text: "Мангова стабла преферирају добро дренирано, песковито или лоамско тло са pH вредношћу између 5.5 и 7.5.",
      },
      {
        id: 222,
        topic: "Тип тла",
        text: "Добра одводњавање је кључно за мангова стабле, јер не подносе наводњена тла. Подигнути кревети могу помоћи у побољшању одводњавања.",
      },
      {
        id: 223,
        topic: "Припрема тла",
        text: "Умешавање органске материје, као што је компост, у тло пре садње побољшава плодност и задржавање влаге.",
      },
    ],
  },
  {
    id: 23,
    topic: "Врсте",
    text: `Популарне врсте манга укључују:
                            - Алфонсо (познат по свом богатом укусу и слаткоћи).
                            - Хејден (тропски укус, добар за свежу конзумацију).
                            - Томми Аткинс (чест за комерцијалну производњу, са добрим роком трајања).`,
  },
  {
    id: 24,
    topic: "Садња",
    children: [
      {
        id: 241,
        topic: "Време",
        text: "Најбоље време за садњу мангових стабала је пролеће, након што прође последњи мраз.",
      },
      {
        id: 242,
        topic: "Размак",
        text: "Мангова стабле треба посадити на удаљености од 8 до 10 метара (26 до 33 стопе) како би се омогућило њихово велико лишће.",
      },
      {
        id: 243,
        topic: "Опрашивање",
        text: "Мангова стабле су углавном самопрашивајуће, али садња више врста може побољшати оплодњу и принос.",
      },
    ],
  },
  {
    id: 25,
    topic: "Заливање",
    children: [
      {
        id: 251,
        topic: "Фаза успостављања",
        text: "Млада мангова стабла захтевају редовно заливање како би успоставила корене, одржавајући тло константно влажним, али не натопљеним.",
      },
      {
        id: 252,
        topic: "Зрела стабла",
        text: "Након што се стабла утврде, мангова стабле захтевају дубоко заливање свака 2 до 4 недеље, у зависности од падавина, како би се подстакнуо дубок раст корена.",
      },
      {
        id: 253,
        topic: "Избегавање прекомерног заливања",
        text: "Прекомерно заливање може довести до труљења корена и других болести. Осигурајте добро одводњавање и прилагодите заливање у зависности од временских услова.",
      },
    ],
  },
  {
    id: 26,
    topic: "Орезивање",
    children: [
      {
        id: 261,
        topic: "Облик",
        text: "Орезивање помаже у одржавању уравнотеженог облика, подстиче здрав раст и побољшава циркулацију ваздуха унутар стабла.",
      },
      {
        id: 262,
        topic: "Време",
        text: "Орезивање мангових стабала треба обавити након бербе или касно у зиму пре него што почне нови раст како би се уклониле мртве или болесне гране.",
      },
    ],
  },
  {
    id: 27,
    topic: "Ђубрење",
    children: [
      {
        id: 271,
        topic: "Нутријенти",
        text: "Мангова стабле имају користи од редовног ђубрења са уравнотеженим ђубривом (нпр. 10-10-10 NPK) или ђубривом специјално формулисаним за воћке.",
      },
      {
        id: 272,
        topic: "Време",
        text: "Ђубриво треба применити рано пролеће и поново касно лето како би се подржао раст и развој плода.",
      },
    ],
  },
  {
    id: 28,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 281,
        topic: "Штеточине",
        text: "Уобичајене штеточине укључују мангове бубе, воћне мушице и афиде. Применом интегрисаног управљања штеточинама (IPM) могу се ефикасно контролисати ове штеточине.",
      },
      {
        id: 282,
        topic: "Болести",
        text: "Мангова стабле су подложне болестима као што су антракноза, прашкаста плесан и бактеријски канцер. Добре културне праксе и праћење симптома могу помоћи у спречавању ових проблема.",
      },
    ],
  },
  {
    id: 29,
    topic: "Жетва",
    children: [
      {
        id: 291,
        topic: "Време",
        text: "Манго обично сазрева 3 до 6 месеци након цветања, у зависности од врсте и услова раста.",
      },
      {
        id: 292,
        topic: "Знаци зрелости",
        text: "Зрели манго је ароматичан, има благу мекоћу када се нежно стисне и показује промену боје (жута/наранџаста, у зависности од врсте).",
      },
      {
        id: 293,
        topic: "Руковање",
        text: "Мангови треба пажљиво руковати како би се избегле модрице и складиштити на хладном, сувом месту након жетве.",
      },
    ],
  },
  {
    id: 30.2,
    topic: "Складиштење",
    text: "Мангови се могу чувати на собној температури док не постану зрели, а затим се могу ставити у фрижидер до недељу дана. Правилно складиштење помаже у одржавању свеже.",
    children: [
      {
        id: 30.21,
        topic: "Очување",
        text: "Мангови се такође могу сушити, конзервирати или претворити у смутије и десерте како би се продужила њихова употреба ван свеже конзумације.",
      },
    ],
  },
  {
    id: 31.2,
    topic: "Реткоње",
    text: "Реткоње вишка плода током раста сезоне може побољшати величину и квалитет плода смањењем конкуренције за хранљиве материје.",
  },
],
    },
    {
id: 15,
name: "Диња",
img: fruitsImages.melon,
inGeneralHeading: "Освежавајући ужитак",
inGeneral: `Диња, породица воћа која припада породици Cucurbitaceae, слави се због свог освежавајућег укуса и високог садржаја воде, што је чини савршеним летњим посластицама. Најчешће врсте укључују лубеницу, канталупу и меденку, свака са својим јединственим укусима и текстурама.
                Диња, са својим упадљивим црвеним или ружичастим месом, позната је по томе што садржи преко 90% воде, што је чини изузетно хидратантном. Она је одличан извор витамина А и Ц, као и антиоксиданата попут ликопена, који је повезан са здрављем срца и може смањити ризик од неких врста рака. Једење лубенице такође може помоћи у надокнади електролита након физичке активности, што је чини омиљеном међу спортистима.
                Канталупа, са слатким наранџастим месом, богата је витаминима А и Ц, који промовишу здравље коже и имунолошку функцију. Такође је одличан извор калијума, који помаже у одржавању здравог крвног притиска. Меденка, са светло зеленим месом, је слатка и сочна, пружа добру количину витамина Ц и дијеталних влакана.
                Диње су изузетно разноврсне у кулинарској примени. Могу се јести свеже, стављати у смутије или користити у салатама и салсама. Њихова природна слаткоћа такође добро се комбинује са сланим јелима, побољшавајући укусе и додајући освежавајући контраст.
                Укратко, диње нису само укусне, већ су и пуне есенцијалних нутријената и здравствених предности. Њихова хидратантна својства и разноврсност чине их идеалним избором за здраву исхрану, посебно током топлих месеци.`,
topic1: "Нутриција и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 34,
    measurementUnits: "кцал",
    description:
      "– Низак садржај калорија, чинећи је освежавајућим и хидратантним воћем.",
  },
  {
    element: "Масти:",
    quantity: 0.2,
    measurementUnits: "г",
    description:
      "– Врло низак садржај масти, што доприноси њеним здравственим предностима.",
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0.1,
    measurementUnits: "г",
    description: "– Садржи занемарљиве количине засићених масти.",
  },
  {
    element: "Витамин Б3 (Никотинска киселина):",
    quantity: 0.5,
    measurementUnits: "мг",
    description:
      "– Подржава метаболизам и помаже у одржавању здраве коже и нерва.",
  },
  {
    element: "Натријум:",
    quantity: 1,
    measurementUnits: "мг",
    description:
      "– Врло низак садржај натријума, користан за здравље срца.",
  },
  {
    element: "Калијум:",
    quantity: 267,
    measurementUnits: "мг",
    description:
      "– Добар извор калијума, који је есенцијалан за равнотежу течности и функцију мишића.",
  },
  {
    element: "Угљени хидрати:",
    quantity: 8.1,
    measurementUnits: "г",
    description:
      "– Садржи угљене хидрате, углавном из природних шећера.",
  },
  {
    element: "Влакна:",
    quantity: 0.9,
    measurementUnits: "г",
    description:
      "– Пружа дијетална влакна, која промовишу здраво варење.",
  },
  {
    element: "Шећери:",
    quantity: 8.0,
    measurementUnits: "г",
    description:
      "– Садржи природне шећере, што доприноси њеном слатком укусу.",
  },
  {
    element: "Протеини:",
    quantity: 0.8,
    measurementUnits: "г",
    description:
      "– Садржи минималну количину протеина, али доприноси укупном уносу нутријената.",
  },
  {
    element: "Витамин Ц:",
    quantity: 36.7,
    measurementUnits: "мг",
    description:
      "– Добар извор витамина Ц, који подржава имунолошку функцију и здравље коже.",
  },
  {
    element: "Калцијум:",
    quantity: 18,
    measurementUnits: "мг",
    description:
      "– Пружа малу количину калцијума, који доприноси здрављу костију.",
  },
  {
    element: "Гвожђе:",
    quantity: 0.2,
    measurementUnits: "мг",
    description:
      "– Садржи минимално гвожђе, важно за транспорт кисеоника у крви.",
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.03,
    measurementUnits: "мг",
    description:
      "– Подржава метаболизам енергије претварањем угљених хидрата у енергију.",
  },
  {
    element: "Витамин Б6:",
    quantity: 0.1,
    measurementUnits: "мг",
    description:
      "– Учествује у метаболизму и когнитивној функцији.",
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.01,
    measurementUnits: "мг",
    description:
      "– Има улогу у производњи енергије и одржавању здраве коже.",
  },
  {
    element: "Магнезијум:",
    quantity: 10,
    measurementUnits: "мг",
    description:
      "– Садржи мале количине магнезијума, који је важан за функцију мишића и нерва.",
  },
  {
    element: "Цинк:",
    quantity: 0.2,
    measurementUnits: "мг",
    description:
      "– Пружа минималне количине цинка, који подржава имунолошку функцију.",
  },
  {
    element: "Витамин Е:",
    quantity: 0.1,
    measurementUnits: "мг",
    description:
      "– Садржи мале количине витамина Е, који има антиоксидативна својства.",
  },
  {
    element: "Витамин А:",
    quantity: 338,
    measurementUnits: "ИЕ",
    description:
      "– Добар извор витамина А, који је важан за вид и имунолошку функцију.",
  }
],
cultivationHeading: `Диње су слатки, сочни плодови који су популарни током топлих сезона и долазе у различитим типовима, укључујући канталупе, медену дињу и лубеницу. Првенствено се гаје у топлим климама и могу се узгајати како у комерцијалним пољима, тако и у домаћим баштама. Ево прегледа култивације диња.`,
cultivation: [
  {
    id: 21,
    topic: "Клима",
    children: [
      {
        id: 211,
        topic: "Температура",
        text: "Диње успешно расту у топлим климама, преферирају температуре између 21°C и 35°C (70°F до 95°F) током сезоне раста. Потребно им је пуно сунца како би произвели слатке плодове.",
      },
      {
        id: 212,
        topic: "Осетљивост на мраз",
        text: "Растељке диње су осетљиве на мраз и треба их садити после последњег мраза у пролеће. Заштита младих биљака од хладних температура је од суштинског значаја за успешну жетву.",
      },
    ],
  },
  {
    id: 22,
    topic: "Тло",
    children: [
      {
        id: 221,
        topic: "pH",
        text: "Диње преферирају добро дренирана, песковита или лоамска тла са pH вредношћу између 6.0 и 7.5.",
      },
      {
        id: 222,
        topic: "Тип тла",
        text: "Добра одводњавање је кључно за биљке диње, јер су подложне труљењу корена у условима наводњених тла. Подигнути кревети могу побољшати одводњавање.",
      },
      {
        id: 223,
        topic: "Припрема тла",
        text: "Умешавање органске материје, као што је компост или добро развијен стајњак, у тло пре садње побољшава плодност и задржавање влаге.",
      },
    ],
  },
  {
    id: 23,
    topic: "Врсте",
    text: `Популарне врсте диња укључују:
                            - Канталупа (слатка, наранџаста целулоза).
                            - Медена диња (зелена целулоза са слатким укусом).
                            - Лубеница (велика, освежавајућа и хидратишућа).`,
  },
  {
    id: 24,
    topic: "Садња",
    children: [
      {
        id: 241,
        topic: "Време",
        text: "Најбоље време за садњу диња је касно пролеће, након што се тло загреје на најмање 18°C (65°F).",
      },
      {
        id: 242,
        topic: "Размак",
        text: "Биљке диње треба садити на удаљености од 90 до 120 цм (3 до 4 стопе) у редовима, како би се омогућио довољан раст и проток ваздуха.",
      },
      {
        id: 243,
        topic: "Опрашивање",
        text: "Диње су углавном самопрашивајуће, али садња цветова у близини може привући опрашиваче, побољшавајући сетву плода.",
      },
    ],
  },
  {
    id: 25,
    topic: "Заливање",
    children: [
      {
        id: 251,
        topic: "Фаза успостављања",
        text: "Младим биљкама диње је потребна константна влаžnost за успостављање јаког кореновог система, посебно током сувих периода.",
      },
      {
        id: 252,
        topic: "Зреле биљке",
        text: "Када се успоставе, диње захтевају дубоко заливање отприлике једном недељно, осигуравајући да тло остане влажно, али не натопљено.",
      },
      {
        id: 253,
        topic: "Избегавање прекомерног заливања",
        text: "Наводњено тло може довести до труљења корена. Малчирање може помоћи у задржавању влаге у тлу и регулисању температуре.",
      },
    ],
  },
  {
    id: 26,
    topic: "Орезивање",
    children: [
      {
        id: 261,
        topic: "Облик",
        text: "Диње се обично узгајају као раширене лозе. Орезивање прекомерног раста може помоћи побољшању протока ваздуха и квалитета плода.",
      },
      {
        id: 262,
        topic: "Време",
        text: "Орезивање треба обавити рано током сезоне раста како би се подстакнуо здрав раст и развој плода.",
      },
    ],
  },
  {
    id: 27,
    topic: "Ђубрење",
    children: [
      {
        id: 271,
        topic: "Нутријенти",
        text: "Диње користе уравнотежена ђубрива, висока у калијуму и фосфору, како би подржала развој плода.",
      },
      {
        id: 272,
        topic: "Време",
        text: "Ђубрење треба обавити током садње и поново када биљке почну да цветају, осигуравајући да су нутријенти доступни за плодове.",
      },
    ],
  },
  {
    id: 28,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 281,
        topic: "Штеточине",
        text: "Уобичајене штеточине укључују афиде, бубе краставца и паукове гриње. Примена стратегија интегрисаног управљања штеточинама (IPM) може ефикасно контролисати ове штеточине.",
      },
      {
        id: 282,
        topic: "Болести",
        text: "Диње могу бити погођене болестима као што су прашкаста плесан, downy плесан и фузаријумска увенућа. Превентивне мере укључују правилно размакнутости, добар проток ваздуха и коришћење отпорних сорти.",
      },
    ],
  },
  {
    id: 29,
    topic: "Жетва",
    children: [
      {
        id: 291,
        topic: "Време",
        text: "Диње обично сазревају 70 до 90 дана након садње, у зависности од врсте.",
      },
      {
        id: 292,
        topic: "Знаци зрелости",
        text: "Зреле диње ће испуштати слатки мирис, а кора ће променити боју или развити лагани отпор када се нежно стисне.",
      },
      {
        id: 293,
        topic: "Руковање",
        text: "Диње треба пажљиво руковати како би се избегле модрице, а након жетве их треба складиштити на хладном, сувом месту.",
      },
    ],
  },
  {
    id: 30.2,
    topic: "Складиштење",
    text: "Диње се могу чувати на собној температури док не постану зреле. Након што сазру, могу се ставити у фрижидер до недељу дана да би се одржала свеже.",
    children: [
      {
        id: 30.21,
        topic: `Очување`,
        text: "Диње се такође могу исциједити, помешати или претворити у салате и десерте како би се продужила њихова употреба ван свеже конзумације.",
      },
    ],
  },
  {
    id: 31.2,
    topic: "Проређивање",
    text: "Проређивање вишка плода у раним фазама може побољшати величину и квалитет плода смањењем конкуренције за нутријенте.",
  },
],
    },
    {
        id: 16,
name: "Нектарина",
img: fruitsImages.nectarine,
inGeneralHeading: "Сочно камено воће",
inGeneral: `Нектарине, научно класификоване као Prunus persica, су воће са глатком кожом која подсећа на брескве, али се разликују по томе што немају длаке. Са слатким и киселкастим укусом, нектарине су омиљено летње воће које се може јести свеже, кувано или печено.
                  Једна од главних здравствених предности нектарина је њихов богат нутриционисти профил. Низак садржај калорија и висок садржај есенцијалних витамина, посебно витамина Ц, који игра важну улогу у јачању имунолошког система, промовисању здраве коже и помагању у производњи колагена. Средња нектарина може обезбедити око 10% дневно препорученог уноса витамина Ц.
                  Нектарине су такође добар извор дијеталних влакана, која подржавају здравље варења и помажу у регулацији нивоа шећера у крви. Влакна доприносе осећају ситости, што нектарине чини задовољавајућим снацком за оне који желе одржати здраву тежину. Поред тога, нектарине садрже калијум, који је важан за здравље срца и помаже у регулацији крвног притиска.
                  Антиоксиданти које се налазе у нектаринама, као што су бета-каротен и флавоноиди, помажу у заштити организма од оксидативног стреса и упале, што потенцијално смањује ризик од хроничних болести као што су болести срца и одређени облики рака.
                  У кулинарској примени, нектарине су изузетно разноврсне. Могу се јести свеже, додавати у воћне салате, стављати у смутије или користити у десертима као што су пита и крембл. Њихов слатки укус такође се добро комбинује са сланим јелима, чинећи их одличним додатком за салате и салсе.
                  Укратко, нектарине су укусно и хранљиво воће које нуди широк спектар здравствених предности и кулинарских могућности, чинећи их омиљеним избором за многе.`,
topic1: "Нутриција и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 44,
    measurementUnits: "кцал",
    description:
      "– Низак садржај калорија, што га чини освежавајућим и здравим снацком.",
  },
  {
    element: "Масти:",
    quantity: 0.3,
    measurementUnits: "г",
    description:
      "– Врло низак садржај масти, што доприноси њеном здравом профилу.",
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0.1,
    measurementUnits: "г",
    description: "– Садржи минималне количине засићених масти, што промовише здравље срца.",
  },
  {
    element: "Натријум:",
    quantity: 0,
    measurementUnits: "мг",
    description: "– Не садржи натријум, што је корисно за управљање крвним притиском.",
  },
  {
    element: "Калијум:",
    quantity: 201,
    measurementUnits: "мг",
    description:
      "– Добар извор калијума, есенцијалан за функцију мишића и равнотежу течности.",
  },
  {
    element: "Угљени хидрати:",
    quantity: 10.6,
    measurementUnits: "г",
    description:
      "– Садржи природне шећере, што пружа брз извор енергије.",
  },
  {
    element: "Влакна:",
    quantity: 1.5,
    measurementUnits: "г",
    description:
      "– Садржи дијетална влакна, која подржавају здраво варење.",
  },
  {
    element: "Шећери:",
    quantity: 8.4,
    measurementUnits: "г",
    description:
      "– Садржи природне шећере, што доприноси њеном слатком укусу.",
  },
  {
    element: "Протеини:",
    quantity: 0.9,
    measurementUnits: "г",
    description:
      "– Пружа малу количину биљних протеина.",
  },
  {
    element: "Витамин Ц:",
    quantity: 7,
    measurementUnits: "мг",
    description:
      "– Добар извор витамина Ц, важан за имунолошку функцију и здравље коже.",
  },
  {
    element: "Калцијум:",
    quantity: 18,
    measurementUnits: "мг",
    description:
      "– Пружа малу количину калцијума, који доприноси здрављу костију.",
  },
  {
    element: "Гвожђе:",
    quantity: 0.2,
    measurementUnits: "мг",
    description:
      "– Садржи трагове гвожђа, које је потребно за здраву производњу црвених крвних зрнаца.",
  },
  {
    element: "Магнезијум:",
    quantity: 10,
    measurementUnits: "мг",
    description:
      "– Пружа малу количину магнезијума, који је важан за функцију мишића и нерва.",
  },
  {
    element: "Цинк:",
    quantity: 0.1,
    measurementUnits: "мг",
    description:
      "– Садржи трагове цинка, који подржава имунолошку функцију.",
  },
  {
    element: "Витамин А:",
    quantity: 489,
    measurementUnits: "ИЕ",
    description:
      "– Садржи бета-каротен, који подржава вид и здравље имуног система.",
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.02,
    measurementUnits: "мг",
    description:
      "– Подржава метаболизам енергије.",
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.02,
    measurementUnits: "мг",
    description:
      "– Доприноси производњи енергије и здрављу коже.",
  },
  {
    element: "Витамин Б3 (Никотинска киселина):",
    quantity: 0.6,
    measurementUnits: "мг",
    description:
      "– Подржава метаболизам и помаже у одржавању здраве коже.",
  },
  {
    element: "Витамин Б6:",
    quantity: 0.1,
    measurementUnits: "мг",
    description:
      "– Важан за метаболизам протеина и здравље мозга.",
  },
],
cultivationHeading: `Нектарине су плодови глатке коже слични бресквама, познати по слатком укусу и сочној текстури. Гаје се у умереним регионима и могу се узгајати у комерцијалним воћњацима и породичним баштама. Ево прегледа култивације нектарина.`,
cultivation: [
  {
    id: 21,
    topic: "Клима",
    children: [
      {
        id: 211,
        topic: "Температура",
        text: "Нектарине најбоље расту у топлим климама са умереном сезоном раста. Идеалне температуре током сезоне раста крећу се од 20°C до 30°C (68°F до 86°F).",
      },
      {
        id: 212,
        topic: "Осетљивост на мраз",
        text: "Нектарине су осетљиве на мраз, посебно током цветања. Заштита цветова од касних пролећних мразева је кључна за успешну жетву.",
      },
    ],
  },
  {
    id: 22,
    topic: "Тло",
    children: [
      {
        id: 221,
        topic: "pH",
        text: "Нектарине преферирају добро дренирана, лоамска тла са pH вредношћу између 6.0 и 7.0.",
      },
      {
        id: 222,
        topic: "Тип тла",
        text: "Лоамска или песковита лоамска тла пружају најбољу одводњавање и аерацију, јер су нектарине подложне труљењу корена у тешким, глинастим тлима.",
      },
      {
        id: 223,
        topic: "Припрема тла",
        text: "Пре садње, обогатите тло органском материјом као што је компост да бисте побољшали плодност и структуру.",
      },
    ],
  },
  {
    id: 23,
    topic: "Врсте",
    text: `Популарне врсте нектарина укључују:
                            - Фантазија (позната по слатком укусу и великој величини).
                            - Арктичка звезда (слободно-каменчаста сорта са одличним укусом).
                            - Сунчано црвена (ранија сорта са светло црвеном кожом).`,
  },
  {
    id: 24,
    topic: "Садња",
    children: [
      {
        id: 241,
        topic: "Време",
        text: "Најбоље време за садњу нектарина је током периода мировања, обично касно у зими или рано пролеће, пре него што почне нови раст.",
      },
      {
        id: 242,
        topic: "Размак",
        text: "Дрвеће нектарине треба садити на удаљености од 4 до 5 метара (13 до 16 стопа) да би се омогућио довољан раст и циркулација ваздуха.",
      },
      {
        id: 243,
        topic: "Опрашивање",
        text: "Већина нектарина је самопрашивајућа, али садња различитих сорти у близини може побољшати сетву плода и квалитет.",
      },
    ],
  },
  {
    id: 25,
    topic: "Заливање",
    children: [
      {
        id: 251,
        topic: "Фаза успостављања",
        text: "Дрвећу нектарине је потребно редовно заливање током првих неколико година након садње да би се успоставио јак коренов систем.",
      },
      {
        id: 252,
        topic: "Матурантне биљке",
        text: "Када се успоставе, они захтевају дубоко заливање, око 25 до 50 мм (1 до 2 инча) недељно током сезоне раста, у зависности од временских услова.",
      },
      {
        id: 253,
        topic: "Избегавање прекомерног заливања",
        text: "Прекомерна влажност може довести до труљења корена. Малчирање помаже да се задржи влага у тлу и спречава раст корова.",
      },
    ],
  },
  {
    id: 26,
    topic: "Орезивање",
    children: [
      {
        id: 261,
        topic: "Облик",
        text: "Дрвеће нектарине се обично орезује да развије облик отвореног центра или вазе, што побољшава продор сунчеве светлости и циркулацију ваздуха.",
      },
      {
        id: 262,
        topic: "Време",
        text: "Орезивање треба обавити током периода мировања (касно зими) како би се уклонило мртво или болесно дрво и обликовало дрво за оптималан раст.",
      },
    ],
  },
  {
    id: 27,
    topic: "Ђубрење",
    children: [
      {
        id: 271,
        topic: "Нутријенти",
        text: "Нектарине имају користи од уравнотежених ђубрива која су богата калијумом и фосфором како би подржала развој плода.",
      },
      {
        id: 272,
        topic: "Време",
        text: "Ђубрење треба обавити рано пролеће, пре него што започне нови раст, са додатним ђубрењем током сезоне раста ако је потребно.",
      },
    ],
  },
  {
    id: 28,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 281,
        topic: "Штеточине",
        text: "Уобичајене штеточине укључују бораца на дрвету брескве, афиде и паукове гриње. Применом стратегија интегрисаног управљања штеточинама (IPM) може се контролисати ове штеточине.",
      },
      {
        id: 282,
        topic: "Болести",
        text: "Нектарине су подложне болестима као што су браон трулеж, бактеријски канкер и прашкаста плесан. Правилно размакнутост и добар проток ваздуха помажу у превенцији болести.",
      },
    ],
  },
  {
    id: 29,
    topic: "Жетва",
    children: [
      {
        id: 291,
        topic: "Време",
        text: "Нектарине обично достигну зрелост и спремне су за жетву средином или крајем лета, у зависности од сорте.",
      },
      {
        id: 292,
        topic: "Знаци зрелости",
        text: "Зреле нектарине треба да имају пријатан мирис, да буду благо меке на додир и да имају богату боју, обично жуту или црвену, у зависности од сорте.",
      },
      {
        id: 293,
        topic: "Руковање",
        text: "Руковање нектаринама треба бити нежно како би се избегле модрице, а након жетве треба их чувати на хладном, сувом месту.",
      },
    ],
  },
  {
    id: 30.2,
    topic: "Складиштење",
    text: "Нектарине се могу чувати на собној температури док не постану потпуно зреле. Након што сазру, треба их ставити у фрижидер да би се продужила свежина до једне недеље.",
    children: [
      {
        id: 30.21,
        topic: `Очување`,
        text: "Нектарине се такође могу користити у десертима, салатама или конзервирати или замрзавати како би се уживало у њима и ван сезоне.",
      },
    ],
  },
  {
    id: 31.2,
    topic: "Проређивање",
    text: "Проређивање вишка плода у раним фазама може побољшати величину и квалитет плода смањењем конкуренције за нутријенте међу развијајућим плодовима.",
  },
],
    },
    {
        id: 17,
name: "Поморанџа",
img: fruitsImages.orange,
inGeneralHeading: "Омиљено цитрусно воће",
inGeneral: `Поморанџе, научно познате као Citrus sinensis, једно су од најпопуларнијих и најшире конзумираних воћа широм света. Познате по својој живој боји и освежавајућем укусу, поморанџе нису само укусне, већ су и богате есенцијалним нутријентима и здравственим предностима.
                  Једна од најистакнутијих карактеристика поморанџи је њихов изузетно висок садржај витамина Ц. Средња поморанџа обезбеђује више од 100% дневно препорученог уноса овог виталног нутријента, који је кључан за подршку имунолошком систему, промоцију здраве коже и помагање у синтези колагена. Витамин Ц такође делује као моћан антиоксиданс, штитећи ћелије од оксидативног оштећења.
                  Поморанџе су такође одличан извор дијеталних влакана, која помажу варењу и регулишу ниво шећера у крви. Влакна у поморанџама доприносе осећају ситости, чинећи их задовољавајућим и хранљивим снацком. Поред тога, поморанџе садрже калијум, који је есенцијалан за одржавање здравља срца и регулисање крвног притиска.
                  Антиоксиданти које садрже поморанџе, као што су флавоноиди и каротеноиди, такође могу играти улогу у смањењу упале и смањењу ризика од хроничних болести, укључујући болести срца и одређене типове рака.
                  У кулинарској употреби, поморанџе су изузетно разноврсне. Могу се јести свеже, исцедити као сок или додати у салате, десерте и слана јела. Кора поморанџе такође може побољшати укусе у пецивама и маринадама.
                  Укратко, поморанџе су воће богато нутријентима које нуди бројне здравствене предности. Њихов укус и разноврсност чине их омиљеним избором за ужину и кување, пружајући освежавајући укус и исхрану.`,
topic1: "Нутриција и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 47,
    measurementUnits: "кцал",
    description:
      "– Низак садржај калорија, што чини освежавајући и хранљиви снацк.",
  },
  {
    element: "Масти:",
    quantity: 0.1,
    measurementUnits: "г",
    description:
      "– Врло низак садржај масти, чинећи га здравим избором за срце.",
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0.02,
    measurementUnits: "г",
    description: "– Садржи занемарљиве количине засићених масти.",
  },
  {
    element: "Витамин Б3 (Никотинска киселина):",
    quantity: 0.4,
    measurementUnits: "мг",
    description:
      "– Подржава метаболизам и промовише здраву кожу и нерве.",
  },
  {
    element: "Натријум:",
    quantity: 1,
    measurementUnits: "мг",
    description:
      "– Врло низак садржај натријума, што је корисно за здравље срца.",
  },
  {
    element: "Калијум:",
    quantity: 181,
    measurementUnits: "мг",
    description:
      "– Добар извор калијума, есенцијалан за равнотежу течности и функцију мишића.",
  },
  {
    element: "Угљени хидрати:",
    quantity: 11.8,
    measurementUnits: "г",
    description:
      "– Садржи угљене хидрате углавном из природних шећера.",
  },
  {
    element: "Влакна:",
    quantity: 2.4,
    measurementUnits: "г",
    description:
      "– Пружа дијетална влакна, која промовишу здраво варење.",
  },
  {
    element: "Шећери:",
    quantity: 9.4,
    measurementUnits: "г",
    description:
      "– Садржи природне шећере, што доприноси њеном слатком укусу.",
  },
  {
    element: "Протеини:",
    quantity: 0.9,
    measurementUnits: "г",
    description:
      "– Садржи минималну количину протеина, али доприноси укупном уносу нутријената.",
  },
  {
    element: "Витамин Ц:",
    quantity: 53.2,
    measurementUnits: "мг",
    description:
      "– Богат извор витамина Ц, који подржава имунолошку функцију и здравље коже.",
  },
  {
    element: "Калцијум:",
    quantity: 40,
    measurementUnits: "мг",
    description:
      "– Пружа малу количину калцијума, који доприноси здрављу костију.",
  },
  {
    element: "Гвожђе:",
    quantity: 0.1,
    measurementUnits: "мг",
    description:
      "– Садржи минимално гвожђе, које је важно за транспорт кисеоника у крви.",
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.1,
    measurementUnits: "мг",
    description:
      "– Подржава метаболизам енергије претварањем угљених хидрата у енергију.",
  },
  {
    element: "Витамин Б6:",
    quantity: 0.1,
    measurementUnits: "мг",
    description:
      "– Учествује у метаболизму и когнитивној функцији.",
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.04,
    measurementUnits: "мг",
    description:
      "– Има улогу у производњи енергије и одржавању здраве коже.",
  },
  {
    element: "Магнезијум:",
    quantity: 10,
    measurementUnits: "мг",
    description:
      "– Садржи мале количине магнезијума, који је важан за функцију мишића и нерва.",
  },
  {
    element: "Цинк:",
    quantity: 0.1,
    measurementUnits: "мг",
    description:
      "– Пружа минимални цинк, који подржава имунолошку функцију.",
  },
  {
    element: "Витамин Е:",
    quantity: 0.2,
    measurementUnits: "мг",
    description:
      "– Садржи мале количине витамина Е, који има антиоксидативна својства.",
  },
  {
    element: "Витамин А:",
    quantity: 225,
    measurementUnits: "ИЕ",
    description:
      "– Садржи мале количине витамина А, важног за вид и имунолошку функцију.",
  }
],
cultivationHeading: `Наранџе су један од најпопуларнијих и најшире конзумираних плодова широм света, познате по свом слатко-киселом укусу и високом садржају витамина Ц. Гаје се углавном у топлим, суптропским и тропским климатама. Ево прегледа култивације наранџи.`,
cultivation: [
  {
    id: 21,
    topic: "Клима",
    children: [
      {
        id: 211,
        topic: "Температура",
        text: "Наранџе расту у топлим, суптропским до тропским климатама. Идеалан температурни опсег за оптималан раст је између 20°C и 30°C (68°F до 86°F).",
      },
      {
        id: 212,
        topic: "Осетљивост на мраз",
        text: "Наранџе су осетљиве на мраз, посебно током цветања и развоја плода. Заштита стабала од касних пролећних мразева је неопходна да би се спречила штета на цветовима и плодовима.",
      },
    ],
  },
  {
    id: 22,
    topic: "Тло",
    children: [
      {
        id: 221,
        topic: "pH",
        text: "Наранџе преферирају добро дренирана тла са pH вредношћу између 5.5 и 6.5, што подржава здрав развој корена.",
      },
      {
        id: 222,
        topic: "Тип тла",
        text: "Песковита лоамска или лоамска тла су идеална за стабла наранџи, јер пружају добру одводњу и аерацију. Тешка глинаста тла треба избегавати због лоше одводње.",
      },
      {
        id: 223,
        topic: "Припрема тла",
        text: "Пре садње, убаците органску материју као што је компост да бисте побољшали плодност и структуру тла.",
      },
    ],
  },
  {
    id: 23,
    topic: "Врсте",
    text: `Популарне врсте наранџи укључују:
                            - Валенсија (позната по сочној и слаткој природи, идеална за сокове).
                            - Навел (без семенки и слатка, одлична за свеже једење).
                            - Крвна наранџа (по боји и укусу различита, често се користи у салатама и десертима).`,
  },
  {
    id: 24,
    topic: "Садња",
    children: [
      {
        id: 241,
        topic: "Време",
        text: "Најбоље време за садњу стабала наранџи је пролеће, након што опасност од мраза прође.",
      },
      {
        id: 242,
        topic: "Размак",
        text: "Наранџе треба садити на удаљености од 5 до 7 метара (16 до 23 стопе) како би имали довољно простора за раст и циркулацију ваздуха.",
      },
      {
        id: 243,
        topic: "Опрашивање",
        text: "Већина врста наранџи је самопрашивајућа, али садња више стабала може побољшати принос и квалитет плода.",
      },
    ],
  },
  {
    id: 25,
    topic: "Заливање",
    children: [
      {
        id: 251,
        topic: "Фаза успостављања",
        text: "Стабла наранџи захтевају редовно заливање током првих неколико година након садње како би успоставили јак коренов систем.",
      },
      {
        id: 252,
        topic: "Матурантна стабла",
        text: "Када се стабла успоставе, треба их залијевати дубоко, али ретко, око 25 до 50 мм (1 до 2 инча) воде недељно током сезоне раста.",
      },
      {
        id: 253,
        topic: "Избегавање прекомерног заливања",
        text: "Преливање може довести до труљења корена. Малчирање помаже задржавању влаге у тлу и спречава раст корова.",
      },
    ],
  },
  {
    id: 26,
    topic: "Орезивање",
    children: [
      {
        id: 261,
        topic: "Облик",
        text: "Стабла наранџи се обично орезују да одрже отворену круну, што омогућава продор светлости и побољшава циркулацију ваздуха.",
      },
      {
        id: 262,
        topic: "Време",
        text: "Орезивање треба обавити током мировања (крајем зиме) да би се уклонило мртво или болесно дрво и обликовало стабло за оптималан раст.",
      },
    ],
  },
  {
    id: 27,
    topic: "Ђубрење",
    children: [
      {
        id: 271,
        topic: "Нутријенти",
        text: "Наранџе имају користи од уравнотежених ђубрива богата азотом, фосфором и калијумом како би подржале здрав раст и производњу плода.",
      },
      {
        id: 272,
        topic: "Време",
        text: "Ђубрење треба обавити у рано пролеће пре него што започне нови раст, са додатним ђубрењем током сезоне раста ако је потребно.",
      },
    ],
  },
  {
    id: 28,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 281,
        topic: "Штеточине",
        text: "Уобичајене штеточине које нападају стабла наранџи укључују афиде, рударе на листовима цитруса и инсекте љуске. Стратегије интегрисаног управљања штеточинама (IPM) могу помоћи у контроли ових штеточина.",
      },
      {
        id: 282,
        topic: "Болести",
        text: "Наранџе су подложне болестима као што су цитрусно зеленило, прашкаста плесан и труљење корена. Добре културне праксе и благовремене примене фунгицида помажу у управљању овим проблемима.",
      },
    ],
  },
  {
    id: 29,
    topic: "Жетва",
    children: [
      {
        id: 291,
        topic: "Време",
        text: "Наранџе су обично спремне за жетву зими до раног пролећа, у зависности од сорте и климе.",
      },
      {
        id: 292,
        topic: "Знаци зрелости",
        text: "Зреле наранџе треба да имају светлу боју, буду тешке за своју величину и имају благо мекану текстуру када се нежно стисну.",
      },
      {
        id: 293,
        topic: "Руковање",
        text: "Наранџе треба пажљиво ручно убирати како би се избегла модрица, а након жетве треба их чувати на хладном, сувом месту.",
      },
    ],
  },
  {
    id: 30.2,
    topic: "Складиштење",
    text: "Наранџе се могу чувати на собној температури кратко време. За дуже складиштење, треба их ставити у фрижидер како би се одржала свежина до две недеље.",
    children: [
      {
        id: 30.21,
        topic: `Очување`,
        text: "Наранџе се такође могу исцедити у сок или користити у разним јелима, џемовима и конзервама како би се уживало у њиховом укусу ван сезоне.",
      },
    ],
  },
  {
    id: 31.2,
    topic: "Проређивање",
    text: "Проређивање вишка плода у раном пролећу може побољшати величину и квалитет плода смањењем конкуренције за хранљиве материје међу развијајућим плодовима.",
  },
],
    },
    {
        id: 18,
name: "Бресква",
img: fruitsImages.peach,
inGeneralHeading: "Сочно камено воће",
inGeneral: `Брескве, научно познате као Prunus persica, омиљено су летње воће познато по свом слатком, сочном месу и ароматичном мирису. Са својом меком, пахуљастом кожом и живописним бојама које варирају од жуте до црвене, брескве нису само визуелно привлачне, већ су и богате есенцијалним нутријентима и здравственим предностима.
                  Једна од кључних нутриционалних предности брескви је висок садржај витамина Ц, који подржава имунолошки систем, промовише здраву кожу и помаже у производњи колагена. Средња бресква обезбеђује око 10% дневног препорученог уноса витамина Ц, чинећи је укусним начином да побољшате свој унос нутријената.
                  Брескве су такође добар извор дијеталних влакана, која помажу варењу, регулишу ниво шећера у крви и промовишу осећај ситости. Ово чини брескве задовољавајућим снацком за оне који желе да управљају својом тежином. Поред тога, садрже калијум, који је есенцијалан за здравље срца и помаже у регулисању крвног притиска.
                  Антиоксиданти који се налазе у бресквама, укључујући бета-каротен и фенолне компојунте, помажу у заштити организма од оксидативног стреса и упале. Ови антиоксиданти такође могу допринети смањењу ризика од хроничних болести, као што су болести срца и одређени рак.
                  У кулинарској употреби, брескве су изузетно разноврсне. Могу се јести свеже, печене, коришћене у десертима или додате у салате и смутије. Њихова природна слаткоћа добро се слаже и са сланим и са слатким јелима.
                  Укратко, брескве су укусно и хранљиво воће које нуди разне здравствене предности. Њихов сочан укус и разноврсност чине их омиљеним избором за летње уживање и здраво грицкање.`,
topic1: "Нутриција и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 39,
    measurementUnits: "кцал",
    description: "– Низак садржај калорија, чинећи их освежавајућим и здравим снацком."
  },
  {
    element: "Масти:",
    quantity: 0.3,
    measurementUnits: "г",
    description: "– Врло низак садржај масти, што доприноси њиховом здравом профилу."
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0.1,
    measurementUnits: "г",
    description: "– Садржи минималне количине засићених масти, што промовише здравље срца."
  },
  {
    element: "Натријум:",
    quantity: 0,
    measurementUnits: "мг",
    description: "– Не садржи натријум, корисно за управљање крвним притиском."
  },
  {
    element: "Калијум:",
    quantity: 190,
    measurementUnits: "мг",
    description: "– Добар извор калијума, есенцијалан за функцију мишића и равнотежу течности."
  },
  {
    element: "Угљени хидрати:",
    quantity: 9.5,
    measurementUnits: "г",
    description: "– Садржи природне шећере, пружајући брзи извор енергије."
  },
  {
    element: "Влакна:",
    quantity: 1.5,
    measurementUnits: "г",
    description: "– Садржи дијетална влакна, која промовишу здраво варење."
  },
  {
    element: "Шећери:",
    quantity: 8.4,
    measurementUnits: "г",
    description: "– Садржи природне шећере, што доприноси њеном слатком укусу."
  },
  {
    element: "Протеини:",
    quantity: 0.9,
    measurementUnits: "г",
    description: "– Пружа малу количину биљних протеина."
  },
  {
    element: "Витамин Ц:",
    quantity: 6.6,
    measurementUnits: "мг",
    description: "– Добар извор витамина Ц, важан за имунолошку функцију и здравље коже."
  },
  {
    element: "Калцијум:",
    quantity: 18,
    measurementUnits: "мг",
    description: "– Пружа малу количину калцијума, који доприноси здрављу костију."
  },
  {
    element: "Гвожђе:",
    quantity: 0.2,
    measurementUnits: "мг",
    description: "– Садржи трагове гвожђа, који су неопходни за здраву производњу црвених крвних зрнаца."
  },
  {
    element: "Магнезијум:",
    quantity: 10,
    measurementUnits: "мг",
    description: "– Пружа малу количину магнезијума, који је важан за функцију мишића и нерва."
  },
  {
    element: "Цинк:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Садржи трагове цинка, који подржава имунолошку функцију."
  },
  {
    element: "Витамин А:",
    quantity: 489,
    measurementUnits: "ИЕ",
    description: "– Садржи бета-каротен, који подржава вид и здравље имунолошког система."
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.02,
    measurementUnits: "мг",
    description: "– Подржава метаболизам енергије."
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.02,
    measurementUnits: "мг",
    description: "– Доприноси производњи енергије и здрављу коже."
  },
  {
    element: "Витамин Б3 (Никотинска киселина):",
    quantity: 0.6,
    measurementUnits: "мг",
    description: "– Подржава метаболизам и помаже у одржавању здраве коже."
  },
  {
    element: "Витамин Б6:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Важан за метаболизам протеина и здравље мозга."
  }
],
cultivationHeading: `Брескве су воће са коштњачом које је веома цењено због свог слатког укуса и сочне текстуре. Гаје се у многим умереним пределима широм света и могу се култивисати како у комерцијалним воћњацима тако и у баштама. Ево прегледа култивације брескви.`,
cultivation: [
  {
    id: 21,
    topic: "Клима",
    children: [
      {
        id: 211,
        topic: "Температура",
        text: "Брескве расту у топлим, умереним климатама. Потребна им је хладна зима за мировање, а идеалан температурни опсег током сезоне раста је између 20°C и 30°C (68°F до 86°F).",
      },
      {
        id: 212,
        topic: "Осетљивост на мраз",
        text: "Стабла брескви су осетљива на касне пролећне мразеве, посебно током цветања и формирања плода, што може оштетити цветове и смањити принос.",
      },
    ],
  },
  {
    id: 22,
    topic: "Тло",
    children: [
      {
        id: 221,
        topic: "pH",
        text: "Брескве преферирају добро дренирана, песковита или лоамска тла са pH вредношћу између 6.0 и 7.0.",
      },
      {
        id: 222,
        topic: "Тип тла",
        text: "Добра дренажа је од суштинске важности, јер стабла брескви не подносе водене услове. Тешка глинаста тла треба избегавати.",
      },
      {
        id: 223,
        topic: "Припрема тла",
        text: "Убацивање органске материје, као што је компост или добро одлежана стајњака, у тло пре садње може побољшати плодноћу и структуру тла.",
      },
    ],
  },
  {
    id: 23,
    topic: "Врсте",
    text: `Популарне врсте брескви укључују:
                            - Клинстоун (идеална за конзервирање и кување).
                            - Фристоун (одлична за свеже конзумирање).
                            - Донут брескве (плоснате и слатке, често се једу свеже).`,
  },
  {
    id: 24,
    topic: "Садња",
    children: [
      {
        id: 241,
        topic: "Време",
        text: "Најбоље време за садњу стабала брескви је током зимског мировања, обично крајем зиме до раног пролећа, пре него што започне нови раст.",
      },
      {
        id: 242,
        topic: "Размак",
        text: "Стабла брескви треба садити на удаљености од 4,5 до 5,5 метара (15 до 18 стопа) како би имали довољно простора за раст и циркулацију ваздуха.",
      },
      {
        id: 243,
        topic: "Опрашивање",
        text: "Већина врста брескви је самопрашивајућа, али садња више различитих врста може побољшати принос и квалитет плода.",
      },
    ],
  },
  {
    id: 25,
    topic: "Заливање",
    children: [
      {
        id: 251,
        topic: "Фаза успостављања",
        text: "Редовно заливање је кључно током првих неколико година након садње како би се успоставили јак коренов систем.",
      },
      {
        id: 252,
        topic: "Зрела стабла",
        text: "Када се стабла успоставе, треба их залијевати дубоко али ретко, потребно је око 25 до 50 мм (1 до 2 инча) воде недељно током сезоне раста.",
      },
      {
        id: 253,
        topic: "Избегавање прекомерног заливања",
        text: "Преливање може довести до труљења корена и других болести, тако да је правилна дренажа од суштинске важности.",
      },
    ],
  },
  {
    id: 26,
    topic: "Орезивање",
    children: [
      {
        id: 261,
        topic: "Облик",
        text: "Стабла брескви се обично орезују да би се одржао отворени облик, што омогућава продор светлости и побољшава циркулацију ваздуха.",
      },
      {
        id: 262,
        topic: "Време",
        text: "Орезивање треба обавити током зимског мировања (крајем зиме) како би се уклонило мртво или болесно дрво и обликовало стабло.",
      },
    ],
  },
  {
    id: 27,
    topic: "Ђубрење",
    children: [
      {
        id: 271,
        topic: "Нутријенти",
        text: "Брескве имају користи од уравнотежених ђубрива богата азотом, фосфором и калијумом како би подржале здрав раст и производњу плода.",
      },
      {
        id: 272,
        topic: "Време",
        text: "Ђубрење треба обавити у раном пролећу, пре него што започне нови раст, а може се додатно применити током сезоне раста по потреби.",
      },
    ],
  },
  {
    id: 28,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 281,
        topic: "Штеточине",
        text: "Уобичајене штеточине које нападају стабла брескви укључују афиде, паукове гриње и разараче гранчица брескви. Стратегије интегрисаног управљања штеточинама (IPM) могу помоћи у контроли ових штеточина.",
      },
      {
        id: 282,
        topic: "Болести",
        text: "Брескве су подложне болестима као што су браон трулеж, свилени лист брескви и бактеријска мрља. Добре културне праксе, као што су орезивање и примене фунгицида, могу помоћи у управљању овим проблемима.",
      },
    ],
  },
  {
    id: 29,
    topic: "Жетва",
    children: [
      {
        id: 291,
        topic: "Време",
        text: "Брескве су обично спремне за жетву средином до крајем лета, зависно од врсте и климе.",
      },
      {
        id: 292,
        topic: "Знаци зрелости",
        text: "Зреле брескве треба да имају живу боју, благу мекоћу када се нежно стисну и мирисну арому.",
      },
      {
        id: 293,
        topic: "Руковање",
        text: "Брескве треба пажљиво руковати да би се избегла модрица, јер су осетљиво воће. Чувајте их на хладном месту након жетве.",
      },
    ],
  },
  {
    id: 30.2,
    topic: "Складиштење",
    text: "Брескве се могу чувати на собној температури неколико дана како би дозреле. За дуготрајније складиштење, треба их ставити у фрижидер како би се одржала свежина до недељу дана.",
    children: [
      {
        id: 30.21,
        topic: `Очување`,
        text: "Брескве се такође могу конзервирати, замрзавати или правити џемови и кондиторске производе како би се продужила њихова употреба изван сезоне свежих плодова.",
      },
    ],
  },
  {
    id: 31.2,
    topic: "Проређивање",
    text: "Проређивање вишка плода у раном пролећу може побољшати величину и квалитет плода смањењем конкуренције за хранљиве материје међу развијајућим плодовима.",
  },
],
    },
    {
        id: 19,
name: "Шљива",
img: fruitsImages.plum,
inGeneralHeading: "Слатка и сочна делиција",
inGeneral: `Шљиве, које припадају врсти Prunus domestica, мале су, округле плодове који долазе у различитим бојама, укључујући љубичасту, црвену, жуту и зелену. Познате су по свом слатком и благо киселом укусу, шљиве су не само укусне већ и богате есенцијалним нутријентима и здравственим предностима.
                  Једна од истакнутих карактеристика шљива је висок садржај витамина Ц, који подржава имунолошки систем, промовише здраву кожу и помаже у производњи колагена. Средња шљива обезбеђује око 10% дневног препорученог уноса витамина Ц, што је освежавајући избор за побољшање уноса нутријената.
                  Шљиве су такође одличан извор дијеталних влакана, која помажу варењу и регулишу ниво шећера у крви. Ова влакна доприносе осећају ситости, што чини шљиве задовољавајућим снацком за оне који желе да одрже здраву тежину. Поред тога, шљиве садрже калијум, који је важан за здравље срца и помаже у регулисању крвног притиска.
                  Антиоксиданти који се налазе у шљивама, као што су фенолни компојунти и каротеноиди, помажу у борби против оксидативног стреса и упала у телу. Ови антиоксиданти могу допринети смањењу ризика од хроничних болести, укључујући болести срца и одређене типове рака.
                  У кулинарској употреби, шљиве су изузетно разноврсне. Могу се јести свеже, осушене (као сува шљива), или користити у џемовима, желеима и десертима. Њихов слатко-кисели укус добро се уклапа и са сланим јелима.
                  Укратко, шљиве су укусно и хранљиво воће које нуди бројне здравствене предности. Њихов диван укус и разноврсност чине их популарним избором за грицкање и кување, пружајући како уживање тако и исхрану.`,
topic1: "Нутриција и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 46,
    measurementUnits: "кцал",
    description: "– Низак садржај калорија, чинећи их здравим и освежавајућим снацком."
  },
  {
    element: "Масти:",
    quantity: 0.3,
    measurementUnits: "г",
    description: "– Врло низак садржај масти, што доприноси њиховој лаганој и сочни природи."
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0.0,
    measurementUnits: "г",
    description: "– Садржи незнатне количине засићених масти."
  },
  {
    element: "Витамин Б3 (Никотинска киселина):",
    quantity: 0.3,
    measurementUnits: "мг",
    description: "– Подржава метаболизам и доприноси здрављу коже."
  },
  {
    element: "Натријум:",
    quantity: 1,
    measurementUnits: "мг",
    description: "– Врло низак садржај натријума, што је корисно за здравље срца."
  },
  {
    element: "Калијум:",
    quantity: 157,
    measurementUnits: "мг",
    description: "– Добар извор калијума, есенцијалан за одржавање равнотеже течности и функцију мишића."
  },
  {
    element: "Угљени хидрати:",
    quantity: 11.4,
    measurementUnits: "г",
    description: "– Пружа угљене хидрате углавном из природних шећера."
  },
  {
    element: "Влакна:",
    quantity: 1.4,
    measurementUnits: "г",
    description: "– Садржи дијетална влакна, која промовишу здраво варење."
  },
  {
    element: "Шећери:",
    quantity: 9.9,
    measurementUnits: "г",
    description: "– Садржи природне шећере, што доприноси њеном слатком укусу."
  },
  {
    element: "Протеини:",
    quantity: 0.7,
    measurementUnits: "г",
    description: "– Садржи минималне количине протеина, али доприноси укупном уносу нутријената."
  },
  {
    element: "Витамин Ц:",
    quantity: 9.5,
    measurementUnits: "мг",
    description: "– Пружа умерене количине витамина Ц, који подржава здравље имунолошког система."
  },
  {
    element: "Калцијум:",
    quantity: 18,
    measurementUnits: "мг",
    description: "– Садржи мале количине калцијума, који доприноси здрављу костију."
  },
  {
    element: "Гвожђе:",
    quantity: 0.2,
    measurementUnits: "мг",
    description: "– Садржи минималне количине гвожђа, важног за пренос кисеоника у крви."
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.02,
    measurementUnits: "мг",
    description: "– Подржава метаболизам енергије претварањем угљених хидрата у енергију."
  },
  {
    element: "Витамин Б6:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Учествује у метаболизму и когнитивној функцији."
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.03,
    measurementUnits: "мг",
    description: "– Има улогу у производњи енергије и одржавању здраве коже."
  },
  {
    element: "Магнезијум:",
    quantity: 9,
    measurementUnits: "мг",
    description: "– Садржи мале количине магнезијума, који је важан за функцију мишића и нерва."
  },
  {
    element: "Цинк:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Пружа минималне количине цинка, који подржава имунолошку функцију."
  },
  {
    element: "Витамин Е:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Садржи мале количине витамина Е, који има антиоксидативна својства."
  },
  {
    element: "Витамин А:",
    quantity: 127,
    measurementUnits: "ИЕ",
    description: "– Садржи мале количине витамина А, који је важан за вид и имунолошку функцију."
  }
],
cultivationHeading: `Шљиве су сочни, слатки плодови који припадају роду Прунус, који укључује и трешње и брескве. Популарне су због своје свестраности у свеже конзумирање, кувању и конзервирању. Шљиве се гаје у различитим климатским условима широм света. Ево прегледа култивације шљива.`,
cultivation: [
  {
    id: 21,
    topic: "Клима",
    children: [
      {
        id: 211,
        topic: "Температура",
        text: "Шљиве најбоље расту у умереним климатама са јасно израженим сезонским променама. Потребна им је хладна зима за мировање, а идеалан температурни опсег током сезоне раста је између 20°C и 25°C (68°F до 77°F).",
      },
      {
        id: 212,
        topic: "Осетљивост на мраз",
        text: "Стабла шљива су осетљива на касне пролећне мразеве, посебно током цветања и формирања плода, што може оштетити цветове и смањити принос плода.",
      },
    ],
  },
  {
    id: 22,
    topic: "Тло",
    children: [
      {
        id: 221,
        topic: "pH",
        text: "Шљиве преферирају добро дренирана, плодно тло са pH вредношћу између 6.0 и 7.0.",
      },
      {
        id: 222,
        topic: "Тип тла",
        text: "Идеална су песковита и лоамска тла, јер обезбеђују добру дренажу. Треба избегавати тешка глинаста тла која задржавају превише влаге.",
      },
      {
        id: 223,
        topic: "Припрема тла",
        text: "Убацивање органске материје, као што су компост или добро одлежала стајњака, у тло пре садње помаже у побољшању плодности и структуре тла.",
      },
    ],
  },
  {
    id: 23,
    topic: "Врсте",
    text: `Популарне врсте шљива укључују:
                            - Европске шљиве (као што су Стенли и Дамсон) познате по својој слаткоћи и погодне за свеже конзумирање.
                            - Јапанске шљиве (као што су Санта Роса и Широ) које су сочне и одличне за свеже конзумирање.`,
  },
  {
    id: 24,
    topic: "Садња",
    children: [
      {
        id: 241,
        topic: "Време",
        text: "Најбоље време за садњу стабала шљива је током зимског мировања (крај зиме до раног пролећа) пре него што започне нови раст.",
      },
      {
        id: 242,
        topic: "Размак",
        text: "Стабла шљива треба садити на удаљености од 4 до 5 метара (13 до 16 стопа) како би имали довољно простора за раст и циркулацију ваздуха.",
      },
      {
        id: 243,
        topic: "Опрашивање",
        text: "Док су неке врсте шљива самопрашивајуће, садња више врста може побољшати сетву и принос плода.",
      },
    ],
  },
  {
    id: 25,
    topic: "Заливање",
    children: [
      {
        id: 251,
        topic: "Фаза успостављања",
        text: "Редовно заливање је кључно током првих неколико година након садње како би се успоставио јак коренов систем.",
      },
      {
        id: 252,
        topic: "Зрела стабла",
        text: "Када се стабла успоставе, треба их залијевати дубоко али ретко, са око 25 до 50 мм (1 до 2 инча) воде недељно током сезоне раста.",
      },
      {
        id: 253,
        topic: "Избегавање прекомерног заливања",
        text: "Преливање може довести до труљења корена и других болести, па је важно обезбедити добру дренажу.",
      },
    ],
  },
  {
    id: 26,
    topic: "Орезивање",
    children: [
      {
        id: 261,
        topic: "Облик",
        text: "Стабла шљива се често орезују како би се одржао облик отвореног центра, што омогућава продор светлости и побољшава циркулацију ваздуха.",
      },
      {
        id: 262,
        topic: "Време",
        text: "Орезивање треба обавити током зимског мировања (крај зиме) како би се уклонило мртво или болесно дрво и обликовало стабло.",
      },
    ],
  },
  {
    id: 27,
    topic: "Ђубрење",
    children: [
      {
        id: 271,
        topic: "Нутријенти",
        text: "Стабла шљива имају користи од уравнотежених ђубрива која су богата азотом, фосфором и калијумом како би се подржао здрав раст и производња плода.",
      },
      {
        id: 272,
        topic: "Време",
        text: "Ђубрење треба обавити у раном пролећу, пре него што започне нови раст, а може се додатно применити током сезоне раста по потреби.",
      },
    ],
  },
  {
    id: 28,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 281,
        topic: "Штеточине",
        text: "Уобичајене штеточине које нападају стабла шљива укључују афиде, паукове гриње и шљиве скакавце. Стратегије интегрисаног управљања штеточинама (IPM) могу помоћи у контроли ових штеточина.",
      },
      {
        id: 282,
        topic: "Болести",
        text: "Шљиве су подложне болестима као што су црни чвор, браон трулеж и бактеријски рак. Добре културне праксе, као што су правилно растојање и орезивање, уз примене фунгицида, могу помоћи у управљању овим проблемима.",
      },
    ],
  },
  {
    id: 29,
    topic: "Жетва",
    children: [
      {
        id: 291,
        topic: "Време",
        text: "Шљиве су обично спремне за жетву средином до краја лета, зависно од врсте и климе.",
      },
      {
        id: 292,
        topic: "Знаци зрелости",
        text: "Зреле шљиве треба да имају живу боју, благу мекоћу када се нежно стисну и мирисну арому.",
      },
      {
        id: 293,
        topic: "Руковање",
        text: "Шљиве треба пажљиво руковати да би се избегла модрица, јер су осетљиве. Чувајте их на хладном месту након жетве.",
      },
    ],
  },
  {
    id: 30.2,
    topic: "Складиштење",
    text: "Шљиве се могу чувати на собној температури неколико дана како би дозреле. За дугорочно складиштење, треба их ставити у фрижидер како би се одржала свежина до недељу дана.",
    children: [
      {
        id: 30.21,
        topic: `Очување`,
        text: "Шљиве се такође могу конзервирати, замрзавати или правити џемове и кондиторске производе како би се продужила њихова употреба изван сезоне свежих плодова.",
      },
    ],
  },
  {
    id: 31.2,
    topic: "Проређивање",
    text: "Проређивање вишка плодова у раном пролећу може побољшати величину и квалитет плода смањењем конкуренције за хранљиве материје међу развијајућим плодовима.",
  },
],
    },
    
    {
        id: 20,
name: "Малине",
img: fruitsImages.raspberries,
inGeneralHeading: `Кисели суперплод`,
inGeneral: `Малине, научно познате као Rubus idaeus, су мале, живописне бобице познате по свом сладако-киселом укусу и импресивном нутритивном профилу. Ове деликатне воћке долазе у различитим бојама, са црвеном као најчешћом, и популарне су широм света због своје свестраности у слатким и сланим јелима.
                  Једна од најзначајнијих здравствених користи малина је висок садржај антиоксиданата. Оне су богате витамином Ц и Е, који помажу у борби против оксидативног стреса и подржавају здравље имунолошког система. Једна шоља малина пружа значајну количину витамина Ц, који промовише здравље коже и помаже у производњи колагена.
                  Малине су такође одличан извор дијеталних влакана. Са око 8 грама влакана по шољи, оне помажу у варењу, регулишу ниво шећера у крви и промовишу осећај ситости, чинећи их идеалним избором за контролу тежине. Њихова ниска калорична вредност додатно побољшава њихову атрактивност као здраву ужину.
                  Поред витамина и влакана, малине садрже фито-храњиве материје и флавоноиде, као што су кверцетин и елагићна киселина, који имају антиинфламаторна својства и могу помоћи у смањењу ризика од хроничних болести као што су болести срца и одређени типови рака.
                  Кулинарски, малине су изузетно свестране. Могу се уживати свеже, додавати у смутије, користити у десертима или се укључити у салате и сосове, додајући пријатан укус.
                  У закључку, малине су хранљиви суперплод који пружа мноштво здравствених користи. Њихов укус и кулинарска флексибилност чине их омиљеним избором међу здраво свесним људима.`,
topic1: "Исхрана и здравље",
nutritionText: [
    {
        element: "Енергетска вредност:",
        quantity: 52,
        measurementUnits: "ккал",
        description: "– Низак садржај калорија, чине их одличним избором за здраву ужину."
    },
    {
        element: "Масти:",
        quantity: 0.7,
        measurementUnits: "г",
        description: "– Веома ниске масноће, што доприноси њиховом здравом профилу."
    },
    {
        element: "Засићене масне киселине:",
        quantity: 0.0,
        measurementUnits: "г",
        description: "– Не садрже засићене масне киселине, што подржава здравље срца."
    },
    {
        element: "Натријум:",
        quantity: 1,
        measurementUnits: "мг",
        description: "– Изузетно низак садржај натријума, користан за управљање крвним притиском."
    },
    {
        element: "Калијум:",
        quantity: 151,
        measurementUnits: "мг",
        description: "– Добар извор калијума, који је есенцијалан за функцију мишића и равнотежу течности."
    },
    {
        element: "Угљени хидрати:",
        quantity: 11.9,
        measurementUnits: "г",
        description: "– Садрже природне шећере и угљене хидрате, пружају брз извор енергије."
    },
    {
        element: "Влакна:",
        quantity: 6.5,
        measurementUnits: "г",
        description: "– Богате дијеталним влакнима, која подржавају здраво варење и редовност."
    },
    {
        element: "Шећер:",
        quantity: 4.4,
        measurementUnits: "г",
        description: "– Садрже природне шећере, што доприноси њиховом слатком и киселом укусу."
    },
    {
        element: "Протеини:",
        quantity: 1.2,
        measurementUnits: "г",
        description: "– Пружају малу количину протеина биљног порекла."
    },
    {
        element: "Витамин Ц:",
        quantity: 26.2,
        measurementUnits: "мг",
        description: "– Одличан извор витамина Ц, који је важан за функцију имунолошког система и здравље коже."
    },
    {
        element: "Калцијум:",
        quantity: 33,
        measurementUnits: "мг",
        description: "– Садрже малу количину калцијума, који доприноси здрављу костију."
    },
    {
        element: "Гвожђе:",
        quantity: 0.7,
        measurementUnits: "мг",
        description: "– Садрже трагичне количине гвожђа, неопходног за производњу здравих црвених крвних зрнаца."
    },
    {
        element: "Магнезијум:",
        quantity: 22,
        measurementUnits: "мг",
        description: "– Пружа малу количину магнезијума, који је важан за функцију мишића и нервног система."
    },
    {
        element: "Цинк:",
        quantity: 0.4,
        measurementUnits: "мг",
        description: "– Садрже трагичне количине цинка, који подржава имунолошки систем."
    },
    {
        element: "Витамин Е:",
        quantity: 0.87,
        measurementUnits: "мг",
        description: "– Садрже мале количине витамина Е, који је важан антиоксиданс."
    },
    {
        element: "Витамин А:",
        quantity: 0,
        measurementUnits: "IU",
        description: "– Малине нису значајан извор витамина А."
    },
    {
        element: "Витамин Б1 (Тијамин):",
        quantity: 0.02,
        measurementUnits: "мг",
        description: "– Подржава метаболизам енергије."
    },
    {
        element: "Витамин Б2 (Рибофлавин):",
        quantity: 0.02,
        measurementUnits: "мг",
        description: "– Доприноси производњи енергије и здрављу коже."
    },
    {
        element: "Витамин Б3 (Ниацин):",
        quantity: 0.6,
        measurementUnits: "мг",
        description: "– Подржава метаболизам и помаже у одржавању здраве коже."
    },
    {
        element: "Витамин Б6:",
        quantity: 0.1,
        measurementUnits: "мг",
        description: "– Важан за метаболизам протеина и здравље мозга."
    }
],
cultivationHeading: `Малине су укусне, сочне бобице које су популарне због своје слатко-киселкасте ароме и свестраности у кулинарским применама. Могу се гајити у различитим климатским условима и често се узгајају како у комерцијалним фармама, тако и у домаћинским баштама. Ево прегледа култивације малина.`,
cultivation: [
  {
    id: 21,
    topic: "Клима",
    children: [
      {
        id: 211,
        topic: "Температура",
        text: "Малине најбоље расту у умереним климатама са јасно израженим сезонским променама. Идеалан температурни опсег за раст малина је између 15°C и 25°C (59°F до 77°F).",
      },
      {
        id: 212,
        topic: "Осетљивост на мраз",
        text: "Малине су осетљиве на мраз, посебно током цветања и развоја плода. Заштита биљака од касних пролећних мразева је кључна за успешну жетву.",
      },
    ],
  },
  {
    id: 22,
    topic: "Тло",
    children: [
      {
        id: 221,
        topic: "pH",
        text: "Малине преферирају добро дренирана, плодна тла са pH вредношћу између 5.5 и 6.5.",
      },
      {
        id: 222,
        topic: "Тип тла",
        text: "Песковита лоамска или лоамска тла су идеална јер обезбеђују добру дренажу и аерацију. Треба избегавати тешка глинаста тла.",
      },
      {
        id: 223,
        topic: "Припрема тла",
        text: "Пре садње, треба убацити органску материју као што су компост или добро распаднут стајњак у тло како би се побољшала плодност и структура.",
      },
    ],
  },
  {
    id: 23,
    topic: "Врсте",
    text: `Популарне врсте малина укључују:
                            - Црвене малине (као што су Херитаге и Виламете) познате по својој слаткој ароми.
                            - Црне малине (као што су Блацк Хавк и Јевел) које имају јединствен укус и одличне су за припрему џемова.`,
  },
  {
    id: 24,
    topic: "Садња",
    children: [
      {
        id: 241,
        topic: "Време",
        text: "Најбоље време за садњу малина је рано пролеће или касна јесен када су биљке у стању мировања.",
      },
      {
        id: 242,
        topic: "Размак",
        text: "Биљке малина треба садити на удаљености од 0.6 до 1 метар (2 до 3 стопе) унутар редова, а редови треба да буду удаљени 1.5 до 2 метра (5 до 6 стопа).",
      },
      {
        id: 243,
        topic: "Опрашивање",
        text: "Већина врста малина је самопрашивајућа, али садња више врста може побољшати принос.",
      },
    ],
  },
  {
    id: 25,
    topic: "Заливање",
    children: [
      {
        id: 251,
        topic: "Фаза успостављања",
        text: "Малине захтевају редовно заливање током прве сезоне раста како би успоставиле јак коренов систем.",
      },
      {
        id: 252,
        topic: "Зреле биљке",
        text: "Када се успоставе, малине треба залијевати око 25 до 50 мм (1 до 2 инча) воде недељно, посебно током плодоношења. Предност има дубоко заливање.",
      },
      {
        id: 253,
        topic: "Избегавање прекомерног заливања",
        text: "Преливање може довести до труљења корена, па је важно обезбедити добро дренирано тло и избегавати водозатворене услове.",
      },
    ],
  },
  {
    id: 26,
    topic: "Орезивање",
    children: [
      {
        id: 261,
        topic: "Тип орезивања",
        text: "Малине имају користи од летњег и зимског орезивања. Летње орезивање подразумева уклањање исцрпљених цветних грана (двогодишњих грана) након бербе, док зимско орезивање укључује прореду нових примокана (једногодишњих грана) како би се побољшао проток ваздуха и производња плода.",
      },
      {
        id: 262,
        topic: "Време",
        text: "Орезивање треба обавити крајем зиме или рано пролеће пре него што започне нови раст како би се осигурао здрав раст и продуктивност.",
      },
    ],
  },
  {
    id: 27,
    topic: "Ђубрење",
    children: [
      {
        id: 271,
        topic: "Нутријенти",
        text: "Малине захтевају уравнотежена ђубрива која су богата калијумом и фосфором како би се подстакло плодоношење и здравље биљке.",
      },
      {
        id: 272,
        topic: "Време",
        text: "Ђубрење треба обавити рано пролеће, непосредно пре него што започне нови раст, а поново након жетве за оптималне резултате.",
      },
    ],
  },
  {
    id: 28,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 281,
        topic: "Штеточине",
        text: "Уобичајене штеточине које нападају малине укључују афиде, паукове гриње и досадне бораце. Примена интегрисаног управљања штеточинама (IPM), као што су корисни инсекти и инсектицидни сапуни, може помоћи у контроли ових штеточина.",
      },
      {
        id: 282,
        topic: "Болести",
        text: "Малине су подложне болестима као што су антракноза, прашкаста плесан и труљење корена. Добре културне праксе, укључујући правилно орезивање и растојање, као и примену фунгицида када је потребно, могу помоћи у контроли ових болести.",
      },
    ],
  },
  {
    id: 29,
    topic: "Жетва",
    children: [
      {
        id: 291,
        topic: "Време",
        text: "Малине су обично спремне за жетву од средине лета до ране јесени, у зависности од врсте.",
      },
      {
        id: 292,
        topic: "Знаци зрелости",
        text: "Зреле малине су светле боје, лако се одвајају од стабљике, и треба да буду пуне и мирисне.",
      },
      {
        id: 293,
        topic: "Руковање",
        text: "Малине треба пажљиво руковати како би се избегле модрице, јер су осетљиве. Чувајте их на хладном месту након жетве.",
      },
    ],
  },
  {
    id: 30.2,
    topic: "Складиштење",
    text: "Малине имају кратак рок трајања и најбоље их је конзумирати свеже. Могу се чувати у фрижидеру до два дана.",
    children: [
      {
        id: 30.21,
        topic: `Очување`,
        text: "Малине се такође могу замрзавати за дугорочно складиштење, конзервирати или правити џемове и кондиторске производе.",
      },
    ],
  },
  {
    id: 31.2,
    topic: "Проређивање",
    text: "Проређивање може помоћи у одржавању доброг циркулације ваздуха и смањивању конкуренције међу гранама, побољшавајући величину и квалитет плода.",
  },
],
    },
    {
        id: 21,
name: "Јагода",
img: fruitsImages.strawberry,
inGeneralHeading: `Сладак и хранљиви ужитак`,
inGeneral: `Јагоде, научно познате као Fragaria × ananassa, једно су од најпопуларнијих и највољенијих воћа широм света, познате по својој живописној црвеној боји, слатком укусу и сочном текстури. Ове укусне бобице нису само омиљене за ужину, већ нуде и бројне здравствене предности и кулинарску свестраност.
                  Једна од најистакнутијих особина јагода је њихов изузетно висок садржај витамина Ц. Једна порција јагода може да обезбеди преко 100% дневно препорученог уноса витамина Ц, који је есенцијалан за функцију имунолошког система, производњу колагена и здравље коже. Поред тога, јагоде садрже антиоксиданте, као што су антоцијани, који им дају богату боју и помажу у заштити тела од оксидативног стреса.
                  Јагоде су такође добар извор дијеталних влакана, која помажу у варењу и регулисању нивоа шећера у крви. Њихов висок садржај влакана доприноси осећају ситости, што их чини задовољавајућом и здравом ужином. Штавише, јагоде су нискокалоричне, што их чини одличним избором за управљање тежином.
                  Поред витамина и влакана, јагоде пружају есенцијалне минерале као што су калијум и фолат, који подржавају здравље срца и опште благостање.
                  Кулинарски, јагоде су изузетно свестране. Могу се уживати свеже, додавати у смутије, користити у десертима или укључити у салате и сосове, побољшавајући како укус тако и нутритивну вредност.
                  У закључку, јагоде су укусно и хранљиво воће које пружа широк спектар здравствених предности. Њихов слатки укус и свестраност чине их омиљеним избором за ужину и кување, пружајући уживање и хранљивост у сваком залогају.`,
topic1: "Исхрана и здравље",
nutritionText: [
    {
        element: "Енергетска вредност:",
        quantity: 32,
        measurementUnits: "ккал",
        description: "– Низак садржај калорија, чине их одличним избором за здраву ужину."
    },
    {
        element: "Масти:",
        quantity: 0.3,
        measurementUnits: "г",
        description: "– Веома ниске масноће, што доприноси њиховој општој лакоћи."
    },
    {
        element: "Засићене масне киселине:",
        quantity: 0.0,
        measurementUnits: "г",
        description: "– Садрже занемарљиве количине засићених масних киселина."
    },
    {
        element: "Витамин Б3 (Ниацин):",
        quantity: 0.5,
        measurementUnits: "мг",
        description: "– Подржава метаболизам и здравље коже."
    },
    {
        element: "Натријум:",
        quantity: 1,
        measurementUnits: "мг",
        description: "– Веома низак садржај натријума, што је корисно за здравље срца."
    },
    {
        element: "Калијум:",
        quantity: 153,
        measurementUnits: "мг",
        description: "– Добар извор калијума, који је есенцијалан за равнотежу течности и функцију мишића."
    },
    {
        element: "Угљени хидрати:",
        quantity: 7.7,
        measurementUnits: "г",
        description: "– Пружа угљене хидрате углавном из природних шећера."
    },
    {
        element: "Влакна:",
        quantity: 2.0,
        measurementUnits: "г",
        description: "– Садрже дијетална влакна, која подржавају здраво варење."
    },
    {
        element: "Шећер:",
        quantity: 4.9,
        measurementUnits: "г",
        description: "– Садрже природне шећере, што доприноси њиховом слатком укусу."
    },
    {
        element: "Протеини:",
        quantity: 0.7,
        measurementUnits: "г",
        description: "– Садрже минималне количине протеина, али доприносе општем уносу хранљивих материја."
    },
    {
        element: "Витамин Ц:",
        quantity: 58.8,
        measurementUnits: "мг",
        description: "– Одличан извор витамина Ц, који подржава здравље имунолошког система и интегритет коже."
    },
    {
        element: "Калцијум:",
        quantity: 18,
        measurementUnits: "мг",
        description: "– Пружа мале количине калцијума, који доприноси здрављу костију."
    },
    {
        element: "Гвожђе:",
        quantity: 0.4,
        measurementUnits: "мг",
        description: "– Садрже мале количине гвожђа, важно за транспорт кисеоника у крви."
    },
    {
        element: "Витамин Б1 (Тијамин):",
        quantity: 0.02,
        measurementUnits: "мг",
        description: "– Подржава метаболизам енергије претварањем угљених хидрата у енергију."
    },
    {
        element: "Витамин Б6:",
        quantity: 0.1,
        measurementUnits: "мг",
        description: "– Укључен у метаболизам и когнитивне функције."
    },
    {
        element: "Витамин Б2 (Рибофлавин):",
        quantity: 0.02,
        measurementUnits: "мг",
        description: "– Има улогу у производњи енергије и одржавању здраве коже."
    },
    {
        element: "Магнезијум:",
        quantity: 12,
        measurementUnits: "мг",
        description: "– Садрже мале количине магнезијума, који је важан за функцију мишића и нервног система."
    },
    {
        element: "Цинк:",
        quantity: 0.2,
        measurementUnits: "мг",
        description: "– Пружа минималне количине цинка, који подржава имунолошки систем."
    },
    {
        element: "Витамин Е:",
        quantity: 0.2,
        measurementUnits: "мг",
        description: "– Садрже мале количине витамина Е, који има антиоксидативна својства."
    },
    {
        element: "Витамин А:",
        quantity: 12,
        measurementUnits: "IU",
        description: "– Садрже мале количине витамина А, који је важан за вид и имунолошки систем."
    }
],
cultivationHeading: `Јагоде су једна од најпопуларнијих и најшире конзумираних бобица широм света, познате по свом слатком укусу и живописној црвеној боји. Могу се гајити у различитим климатским условима и узгајају се како комерцијално, тако и у кућним баштама. Ево прегледа култивације јагода.`,
cultivation: [
  {
    id: 21,
    topic: "Клима",
    children: [
      {
        id: 211,
        topic: "Температура",
        text: "Јагоде најбоље расту у умереним климатама са јасно израженим сезонама. Идеалан температурни опсег за раст јагода је између 15°C и 25°C (59°F до 77°F).",
      },
      {
        id: 212,
        topic: "Осетљивост на мраз",
        text: "Јагоде су осетљиве на мраз, посебно током цветања и развоја плода. Заштита биљака од касних пролећних мразева је кључна за успешну жетву.",
      },
    ],
  },
  {
    id: 22,
    topic: "Тло",
    children: [
      {
        id: 221,
        topic: "pH",
        text: "Јагоде преферирају добро дренирана, песковита лоамска тла са pH вредношћу између 5.5 и 6.8.",
      },
      {
        id: 222,
        topic: "Тип тла",
        text: "Добро дренирана тла су од суштинског значаја, јер јагоде не подносе стајаћу воду. Подигнути кревети могу побољшати дренажу.",
      },
      {
        id: 223,
        topic: "Припрема тла",
        text: "Пре садње, треба убацити органску материју као што су компост или добро распаднут стајњак како би се побољшала плодност и структура тла.",
      },
    ],
  },
  {
    id: 23,
    topic: "Врсте",
    text: `Популарне врсте јагода укључују:
                            - Јунско плодоносне врсте (као што су Ерлиглоу и Љуел) које производе плодове у раном лето.
                            - Вишеструко плодоносне врсте (као што су Квиналт и Сеаскап) које дају више жетви током сезоне раста.`,
  },
  {
    id: 24,
    topic: "Садња",
    children: [
      {
        id: 241,
        topic: "Време",
        text: "Најбоље време за садњу јагода је рано пролеће или касна јесен када су биљке у стању мировања.",
      },
      {
        id: 242,
        topic: "Размак",
        text: "Јагоде треба садити на удаљености од 30 до 45 cm (12 до 18 инча), а редови треба да буду удаљени 1 метар (3 стопе) како би се омогућио раст и циркулација ваздуха.",
      },
      {
        id: 243,
        topic: "Опрашивање",
        text: "Већина врста јагода је самопрашивајућа, али садња више врста може побољшати принос и квалитет плода.",
      },
    ],
  },
  {
    id: 25,
    topic: "Заливање",
    children: [
      {
        id: 251,
        topic: "Фаза успостављања",
        text: "Јагоде захтевају константну влажност током прве сезоне раста како би успоставиле здрав коренов систем.",
      },
      {
        id: 252,
        topic: "Зреле биљке",
        text: "Када се успоставе, јагоде треба залијевати око 25 до 50 mm (1 до 2 инча) воде недељно, посебно током плодоношења. Препоручује се дубоко заливање.",
      },
      {
        id: 253,
        topic: "Избегавање прекомерног заливања",
        text: "Преливање може довести до труљења корена, па је важно осигурати добру дренажу и избегавати прекомерно заливање.",
      },
    ],
  },
  {
    id: 26,
    topic: "Орезивање",
    children: [
      {
        id: 261,
        topic: "Управљање пужевима",
        text: "Јагоде производе пужеве (столоне) који могу укорењивати и формирати нове биљке. Орезивање вишка пужева може помоћи главним биљкама да усмере енергију на производњу плода.",
      },
      {
        id: 262,
        topic: "Време",
        text: "Орезивање мртвих или оболелих листова треба обавити рано пролеће пре него што нови раст започне како би се промовисао здрав раст биљке.",
      },
    ],
  },
  {
    id: 27,
    topic: "Ђубрење",
    children: [
      {
        id: 271,
        topic: "Нутријенти",
        text: "Јагоде користе уравнотежена ђубрива која су богата калијумом и фосфором за подстицање цветања и плодоношења.",
      },
      {
        id: 272,
        topic: "Време",
        text: "Ђубрење треба обавити рано пролеће, непосредно пре него што нови раст започне, а поново након жетве да се подржи здравље биљке.",
      },
    ],
  },
  {
    id: 28,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 281,
        topic: "Штеточине",
        text: "Уобичајене штеточине које нападају јагоде укључују афиде, паукове гриње и пужеве. Применом интегрисаног управљања штеточинама (IPM) може се помоћи у контроли ових штеточина.",
      },
      {
        id: 282,
        topic: "Болести",
        text: "Јагоде су подложне болестима као што су прашкаста плесан, сиви плесан и труљење корена. Добре културне праксе, укључујући правилно растојање и заливање, могу помоћи у управљању овим болестима.",
      },
    ],
  },
  {
    id: 29,
    topic: "Жетва",
    children: [
      {
        id: 291,
        topic: "Време",
        text: "Јагоде су обично спремне за жетву од краја пролећа до раног лета, у зависности од врсте.",
      },
      {
        id: 292,
        topic: "Знаци зрелости",
        text: "Зреле јагоде су светло црвене, чврсте и мирисне. Треба их убрати када су потпуно зреле за најбољи укус.",
      },
      {
        id: 293,
        topic: "Руковање",
        text: "Јагоде треба пажљиво руковати како би се избегле модрице. Чувати их на хладном месту након жетве.",
      },
    ],
  },
  {
    id: 30.2,
    topic: "Складиштење",
    text: "Јагоде имају кратак рок трајања и најбоље их је конзумирати свеже. Могу се чувати у фрижидеру до три дана.",
    children: [
      {
        id: 30.21,
        topic: `Очување`,
        text: "Јагоде такође могу бити замрзнуте за дугорочно складиштење, конзервиране или претворене у џемове и конзерве.",
      },
    ],
  },
  {
    id: 31.2,
    topic: "Проређивање",
    text: "Проређивање може помоћи у побољшању циркулације ваздуха и смањењу конкуренције међу биљкама, што резултује бољим квалитетом и величином плода.",
  },
],
    },
    {
        id: 22,
name: "Лубеница",
img: fruitsImages.watermelon,
inGeneralHeading: `Освежавајуће летње воће`,
inGeneral: `Лубеница, научно позната као Citrullus lanatus, популарно је и освежавајуће воће, посебно током врућих летњих месеци. Позната по својој сочној текстури и слатком, хрскавом укусу, лубеница није само пријатна посластица, већ је и богата есенцијалним нутријентима и здравственим предностима.
                  Једна од најзначајнијих особина лубенице је висок садржај воде, који чини око 92%. То је чини одличним избором за хидратацију, помажући да останете охлађени и освежени у врућини. Поред воде, лубеница је нискокалорична, што је чини безгрижним избором за ужину која може помоћи у контроли тежине.
                  Лубеница је добар извор витамина А и Ц. Витамин А, који потиче од бета-каротена који се налази у воћу, подржава здравље очију и имунолошки систем, док витамин Ц је есенцијалан за здравље коже и повећава имунитет. Лубеница такође садржи антиоксиданте, укључујући ликопен, који јој даје живу црвену боју и повезан је са смањеним ризиком од одређених врста рака и болести срца.
                  Још једна предност лубенице је њен садржај калијума, који помаже у регулисању крвног притиска и подржава здравље срца. Присуство цитрулина, амино киселине у лубеници, такође може помоћи у побољшању циркулације и смањењу болова у мишићима након вежбања.
                  Кулинарски, лубеница је изузетно свестрана. Може се уживати свеже, дробљена у смутије, додавати у воћне салате или чак печена за јединствен укус.
                  У закључку, лубеница је хидратантно, хранљиво воће које нуди разне здравствене предности. Њен укусан укус и свестраност чине је омиљеним избором за летње уживање.`,
topic1: "Исхрана и здравље",
nutritionText: [
    {
        element: "Енергетска вредност:",
        quantity: 30,
        measurementUnits: "ккал",
        description: "– Низак садржај калорија, чини је освежавајућом и хидратантном ужином."
    },
    {
        element: "Масти:",
        quantity: 0.2,
        measurementUnits: "г",
        description: "– Изузетно ниске масноће, што доприноси њеном здравом профилу."
    },
    {
        element: "Засићене масне киселине:",
        quantity: 0.0,
        measurementUnits: "г",
        description: "– Не садржи засићене масне киселине, што је корисно за здравље срца."
    },
    {
        element: "Натријум:",
        quantity: 1,
        measurementUnits: "мг",
        description: "– Веома низак садржај натријума, корисно за контролу крвног притиска."
    },
    {
        element: "Калијум:",
        quantity: 112,
        measurementUnits: "мг",
        description: "– Добар извор калијума, који је есенцијалан за функцију мишића и равнотежу течности."
    },
    {
        element: "Угљени хидрати:",
        quantity: 7.6,
        measurementUnits: "г",
        description: "– Садржи природне шећере и угљене хидрате, пружа брзу енергију."
    },
    {
        element: "Влакна:",
        quantity: 0.4,
        measurementUnits: "г",
        description: "– Садржи малу количину дијеталних влакана, која подржава здраво варење."
    },
    {
        element: "Шећер:",
        quantity: 6.2,
        measurementUnits: "г",
        description: "– Садржи природне шећере, што доприноси њеном слатком укусу."
    },
    {
        element: "Протеини:",
        quantity: 0.6,
        measurementUnits: "г",
        description: "– Пружа малу количину биљних протеина."
    },
    {
        element: "Витамин Ц:",
        quantity: 8.1,
        measurementUnits: "мг",
        description: "– Добар извор витамина Ц, који је важан за имунолошки систем и здравље коже."
    },
    {
        element: "Калцијум:",
        quantity: 18,
        measurementUnits: "мг",
        description: "– Садржи трагове калцијума, који доприносе здрављу костију."
    },
    {
        element: "Гвожђе:",
        quantity: 0.2,
        measurementUnits: "мг",
        description: "– Садржи трагове гвожђа, неопходног за здраву производњу црвених крвних зрнаца."
    },
    {
        element: "Магнезијум:",
        quantity: 10,
        measurementUnits: "мг",
        description: "– Пружа малу количину магнезијума, важног за функцију мишића и нерва."
    },
    {
        element: "Цинк:",
        quantity: 0.1,
        measurementUnits: "мг",
        description: "– Садржи трагове цинка, који подржава имунолошки систем."
    },
    {
        element: "Витамин Е:",
        quantity: 0.1,
        measurementUnits: "мг",
        description: "– Садржи мале количине витамина Е, важног антиоксиданса."
    },
    {
        element: "Витамин А:",
        quantity: 569,
        measurementUnits: "IU",
        description: "– Садржи бета-каротен, који подржава здравље очију и имунитет."
    },
    {
        element: "Витамин Б1 (Тијамин):",
        quantity: 0.03,
        measurementUnits: "мг",
        description: "– Подржава метаболизам енергије."
    },
    {
        element: "Витамин Б2 (Рибофлавин):",
        quantity: 0.02,
        measurementUnits: "мг",
        description: "– Доприноси производњи енергије и здрављу коже."
    },
    {
        element: "Витамин Б3 (Ниацин):",
        quantity: 0.2,
        measurementUnits: "мг",
        description: "– Подржава метаболизам и помаже у одржавању здраве коже."
    },
    {
        element: "Витамин Б6:",
        quantity: 0.1,
        measurementUnits: "мг",
        description: "– Важан за метаболизам протеина и здравље мозга."
    }
],
cultivationHeading: `Лубенице су освежавајуће, слаткo воће које је омиљено током топлих сезона. Гаје се углавном у топлим климама и познате су по високом садржају воде и нутритивним својствима. Ево прегледа култивације лубеница.`,
cultivation: [
  {
    id: 21,
    topic: "Клима",
    children: [
      {
        id: 211,
        topic: "Температура",
        text: "Лубенице расту у топлим климама са пуном сунчевом изложеношћу. Идеална температура за раст је између 24°C и 30°C (75°F до 86°F).",
      },
      {
        id: 212,
        topic: "Осетљивост на мраз",
        text: "Лубенице су осетљиве на мраз и треба их садити тек када опасност од мраза прође. Мраз може оштетити младе биљке и смањити принос.",
      },
    ],
  },
  {
    id: 22,
    topic: "Тло",
    children: [
      {
        id: 221,
        topic: "pH",
        text: "Лубенице преферирају добро дренирана песковита лоамска тла са pH вредношћу између 6.0 и 7.5.",
      },
      {
        id: 222,
        topic: "Тип тла",
        text: "Лоамска тла која задржавају одређену количину влаге, али истовремено омогућавају добру дренажу, идеална су за гајење лубеница. Избегавати тешка глинена тла која задржавају вишак воде.",
      },
      {
        id: 223,
        topic: "Припрема тла",
        text: "Пре садње, обогатите тло органском материјом као што је компост да побољшате плодност и дренажу.",
      },
    ],
  },
  {
    id: 23,
    topic: "Врсте",
    text: `Популарне врсте лубеница укључују:
                            - Безсеменке (као што су Цримсон Свит и Безсеменке Шећерне Бебе) за лакшу конзумацију.
                            - Пикничне врсте (као што је Чарлстон Греј) које су веће и савршене за летње забаве.`,
  },
  {
    id: 24,
    topic: "Садња",
    children: [
      {
        id: 241,
        topic: "Време",
        text: "Најбоље време за садњу лубеница је касно пролеће, када температура тла достигне најмање 18°C (65°F).",
      },
      {
        id: 242,
        topic: "Размак",
        text: "Садите семе или саднице лубеница на удаљености од 90 до 120 cm (3 до 4 стопе), а редове оставите најмање 1.5 метара (5 стопа) да бисте омогућили ширење лозе.",
      },
      {
        id: 243,
        topic: "Опрашивање",
        text: "Лубенице се обично опрашују помоћу пчела. Имање здраве популације опрашивача у близини може побољшати сетву и квалитет плода.",
      },
    ],
  },
  {
    id: 25,
    topic: "Заливање",
    children: [
      {
        id: 251,
        topic: "Фаза успостављања",
        text: "Лубенице захтевају константну влажност током фазе клијања и успостављања. Тло треба да буде константно влажно, али не и презасићено водом.",
      },
      {
        id: 252,
        topic: "Зреле биљке",
        text: "Када се успоставе, лубенице треба залијевати око 25 до 50 mm (1 до 2 инча) воде недељно. Дубоко заливање је неопходно током развоја плода.",
      },
      {
        id: 253,
        topic: "Избегавање прекомерног заливања",
        text: "Прекомерно заливање може довести до труљења корена и других гљивичних болести. Осигурајте добру дренажу како бисте избегли стајаћу воду.",
      },
    ],
  },
  {
    id: 26,
    topic: "Орезивање",
    children: [
      {
        id: 261,
        topic: "Управљање лозом",
        text: "Лубенице се могу орезивати како би се контролисао раст и побољшала циркулација ваздуха. Уклоните вишак лоза и листова како бисте усмерили енергију на развој плода.",
      },
      {
        id: 262,
        topic: "Време",
        text: "Орезивање треба пажљиво обавити током сезоне раста, водећи рачуна да не уклоните превише листова који су неопходни за фотосинтезу.",
      },
    ],
  },
  {
    id: 27,
    topic: "Ђубрење",
    children: [
      {
        id: 271,
        topic: "Нутријенти",
        text: "Лубенице користе уравнотежена ђубрива богата калијумом и фосфором да подрже цветање и развој плода.",
      },
      {
        id: 272,
        topic: "Време",
        text: "Ђубрење треба обавити приликом садње, а поново током сезоне раста када плодови почну да се формирају, пратећи упутства на паковању за дозе примене.",
      },
    ],
  },
  {
    id: 28,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 281,
        topic: "Штеточине",
        text: "Уобичајене штеточине укључују афиде, бубе краставца и паукове гриње. Интегрисани систем управљања штеточинама (IPM) може помоћи у ефикасној контроли ових штеточина.",
      },
      {
        id: 282,
        topic: "Болести",
        text: "Лубенице могу бити погођене болестима као што су прашкаста плесан, долњи плесан и фузаријумска увенућа. Добре културне праксе, као што су ротација усева и правилно растојање, могу помоћи у спречавању појаве болести.",
      },
    ],
  },
  {
    id: 29,
    topic: "Жетва",
    children: [
      {
        id: 291,
        topic: "Време",
        text: "Лубенице су обично спремне за жетву 70 до 90 дана након садње, у зависности од врсте.",
      },
      {
        id: 292,
        topic: "Знаци зрелости",
        text: "Знаци да су лубенице зреле укључују досадну површину коже, жуту мрљу на дну и празан звук када се ударају.",
      },
      {
        id: 293,
        topic: "Руковање",
        text: "Пажљиво руковати лубеницама како би се избегле модрице. Користите оштар алат да одсечете воће са лозе.",
      },
    ],
  },
  {
    id: 30.2,
    topic: "Складиштење",
    text: "Лубенице се могу чувати на собној температури неколико дана или у фрижидеру до два недеље. Исечена лубеница треба да се завије и складишти у фрижидеру да би се спречило кварење.",
    children: [
      {
        id: 30.21,
        topic: "Очување",
        text: "Лубенице се такође могу претворити у сок, маринисати или користити у салатама како би се продужила њихова употреба ван свежег конзумирања.",
      },
    ],
  },
  {
    id: 31.2,
    topic: "Проређивање",
    text: "Проређивање садница може бити неопходно да би се осигурало правилно растојање и проток ваздуха, што подстиче здравије биљке и бољи размер плодова.",
  },
],

    }
]

export default voce;