export const tekstPovrca = [
    {
        id: 1,
        topic: 'Поврће',
        text: "Поврће су делови биљака које људи или други организми конзумирају као храну. Изворно значење се и даље често користи и односи се на биљке у целини као на све јестиве биљне материје, укључујући цветове, плодове, стабљике, лишће, корене и семена. Алтернативно дефинисање овог појма понекад се примењује произвољно, често према кулинарним и културним традицијама. Може искључити намирнице добијене од неких биљака као што су плодови, цветови, ораси и житарице, али укључује ароматичне плодове као што су парадајз и тиквице, цветове као што је броколи, као и семена као што су махунарке." +
                "Изворно, поврће је сакупљано из дивљине од стране људи који су живели као ловци-сакупљачи и ушло је у култивацију на више места у свету, вероватно током периода од 10.000. до 7.000. године пре наше ере, када је развијен нови пољопривредни начин живота. На почетку, култивисане су биљке које су расле локално, али како је време одмицало, трговина је донела уобичајене и егзотичне усеве из других региона који су додати домаћим биљкама. Данас, већина поврћа се гаји широм света, у зависности од климатских услова, а усеви се могу гајити и у заштићеним просторима у местима где су услови мање повољни. Кина је највећи произвођач поврћа, а глобална трговина пољопривредним производима омогућава потрошачима да купују поврће које је узгојено у удаљеним земљама. Размере производње варирају, од домаћих фарми које снабдевају породичне потребе, до агробизниса са огромним површинама посејаним са једним усевом. У зависности од типа поврћа, жетва усеве прати процес градације, складиштења, прераде и маркетинга." +
                "Поврће може бити јестиво свеже или кувано и игра важну улогу у људској исхрани, јер је углавном сиромашно мастима и угљеним хидратима, али богато витаминима, минералима и влакнима. Многи нутриционисти препоручују људима да једу много воћа и поврћа, најчешће се препоручује пет или више порција дневно."
    },
    {
        id: 2,
        topic: 'Етимологија',
        text: "Реч поврће први пут је забележена на енглеском језику почетком 15. века. Потиче из старофранцуског језика и првобитно је примењивана на све биљке; ова реч се још увек користи у том контексту у биолошким областима. Потиче из средњег латинског језика 'vegetabilis', што значи 'растао, процветао' (тј. биљка), што је значење које је настало из каснолатинског значења 'да буде оживљавајуће, покрећуће'." +
                "Значење 'поврће' као 'биљка која се гаји за храну' није било утврђено све до 18. века. 1767. године, ова реч је конкретно коришћена да означи 'биљку која се гаји за храну, јестиву биљку или корен'. Године 1955. појављује се први пут скраћени, сленг израз 'веђи'. " +
                "Као придев, реч поврће се користи у научним и техничким контекстима са другачијим и много ширим значењем, које се односи на 'биљке уопште', јестиве или не, као што је у изразима биљни материјал, биљно царство, биљни порекло итд."
    },
    {
        id: 3,
        topic: 'Производња',
        children: [
            {
                id: 301,
                topic: 'Култивација',
                text: 'Поврће је део људске исхране од давнина. Нека су основна храна, али већина их је помоћни део исхране, додајући разноврсност оброцима својим јединственим укусима и истовремено додајући нутријенте потребне за здравље. Нека поврћа су вишегодишња, али већина су једногодишња и двогодишња, обично се беру унутар једне године од сејања или садње. Без обзира који систем се користи за гајење усева, култивација следи сличан образац: припрема тла олабављањем, уклањањем или засађивањем корова, додавање органских ђубрива или ђубрива; сејање семена или садња младих биљака; одржавање усева док расте како би се смањила конкуренција корова, контролисали штетници и обезбедила довољна количина воде; жетва усева када су готови; сортирање, складиштење и маркетинг усева или јело свежег из земље.' +
                        'Различите врсте тла одговарају различитим усевима, али уопштено, песковита тла брзо се суше али се брзо загревају у пролеће и погодна су за ране усеве, док тешка глиновита тла боље задржавају влагу и погоднија су за касне усеве. Растна сезона може се продужити употребом фолија, тунела, пластичних облога, стакленика и пластеника. У топлијим регионима, производња поврћа је ограничена климатским условима, посебно образцем падавина, док је у умереним зонама ограничена температуром и дужином дана.' +
                        'На домаћем нивоу, лопата, вилица и мотика су одабрани алати, док на комерцијалним фармама постоји велики број механичке опреме. Поред трактора, то укључује плугове, арке, сејалице, трансплантере, култиваторе, опрему за наводњавање и бербе. Нова техника мења поступке култивације поврћа са компјутерским системима за праћење, GPS локаторима и самоуправним програмима за беспилотне машине који дају економске користи.'
            },
            {
                id: 302,
                topic: 'Жетва',
                text: 'Када се поврће бере, оно се одваја од свог извора воде и хранљивих материја. Оно наставља да транспирује и губи влагу током овог процеса, што је најприметније код увенућа зелених листова. Берба коренастих поврћа када су у потпуности зрелима побољшава њихов рок трајања, али ова коренаста поврћа могу остати у земљи и бити берена током продуженог периода. Процес жетве треба да минимизира оштећења и модрице на усевима. Љуљице и бели лук могу се сушити неколико дана на пољу, а коренастим поврћем као што су кромпири користи кратак период зрелости у топлим, влажним условима, током којих време лечи ране и кожица се згушњава и учвршћује. Пре маркетинга или складиштења, потребно је сортирање како би се уклонила оштећена роба и изабрали производи према њиховом квалитету, величини, зрелости и боји.'
            },
            {
                id: 303,
                topic: 'Складиштење',
                text: 'Сва поврћа имају различите захтеве када је у питању складиштење и транспорт, зависно од своје врсте и осетљивости на температуру, влагу и светлост. Многи производи могу се чувати на хладним температурама (млечни производи, замрзнуто поврће) или у сувим и тамним просторијама у којима се разграђује (на пример, кромпири). Калибрисано и добро поређано поврће у складиштима или при складиштењу у кућним амбарима може да опстане више од два месеца.'
            },
        {
            id: 304,
            topic: 'Очување',
            text: 'Циљ очувања поврћа је продужавање његове доступности за конзумацију или маркетиншке сврхе. Циљ је убирати храну у њеном максималном стању у погледу укуса и нутритивне вредности, и очувати те особине за продужени период. Главни узроци погоршања поврћа након бербе су дејства природних ензима и кварење које изазивају микроорганизми. Конзервирање и замрзавање су најчешће коришћене технике, а поврће очувано овим методама обично има сличну нутритивну вредност као и свеже сличне производе у погледу каротеноида, витамина Е, минерала и дијететских влакана. \nКонзервирање је процес током којег се деактивирају ензими у поврћу и микроорганизми који су присутни убијају се топлотом. Затворена конзерва искључује ваздух из хране како би се спречило накнадно кварење. \nЗамрзавање поврћа и одржавање његове температуре испод −10 °C (14 °F) спречава кварење на краћи период, док је температура од −18 °C (0 °F) потребна за дуже складиштење. Дејство ензима ће бити само потиснуто, а бланширање одговарајуће припремљеног поврћа пре замрзавања помаже у томе и спречава развој нежељених укуса. Неће сви микроорганизми бити убијени на тим температурама, а након одмрзавања поврће треба одмах користити јер иначе микроби могу да се размноже. \nТрадиционално, сунчево сушење се користило за неке производе као што су парадајз, печурке и пасуљ, распростирући производ на решеткама и окрећући усев у интервалима. Ова метода има неколико недостатака, укључујући недостатак контроле над брзином сушења, кварење када је сушење споро, контаминацију прашином, наводњавање кишом и напад од стране глодара, птица и инсеката. Ови недостаци се могу ублажити коришћењем сушара на соларну енергију. Осушени производи морају бити заштићени од поновног упијања влаге током складиштења.'
        },
        {
            id: 305,
            topic: 'Највећи произвођачи',
            text: "У 2010. години, Кина је била највећи произвођач поврћа, са више од половине светске производње. Индија, Сједињене Америчке Државе, Турска, Иран и Египат били су следећи највећи произвођачи. Кина је имала највећу површину земљишта посвећеног производњи поврћа, док су највиши просечни приноси постигнути у Шпанији и Републици Кореји."
        },
    ]},
        {
            id: 4,
            topic: 'Терминологија',
            text: 'Тачна дефиниција "поврћа" може варирати због многих делова биљке који се широм света конзумирају као храна—корена, стабала, листова, цветова, плодова и семена. Најшире значење је коришћење речи као придева за означавање "материје биљног порекла". Специфичније, поврће се може дефинисати као "свака биљка, чији је део употребљен за храну", а секундарно значење је "едибилни део такве биљке". Прецизнија дефиниција је "сваки део биљке који се користи за храну, а није плод или семе, али укључује зрелу плодовину која се једе као део главног оброка". Изван ових дефиниција су јестиве гљиве (као што су јестиве печурке) и јестиви морски трави, који, иако нису делови биљака, често се третирају као поврће.'
        },
        {
            id: 5,
            topic: 'Историја',
            text: 'Пре појаве пољопривреде, људи су били ловци-сакупљачи. Они су траговали за јестивим плодовима, орашастим плодовима, стабљикама, листовима, кореновима и клубенима и ловили животиње за храну. Вртларство у тропској џунгли се сматра првим примером пољопривреде; корисне биљне врсте су идентификоване и подстакнуте на раст, док су непожељне врсте уклоњене. Биљна селекција кроз избор сојева са жељеним особинама као што су велики плодови и интензиван раст убрзо је уследила. Док су први докази о доместификацији трава као што су пшеница и јечам пронађени у Плодном полумесецу на Блиском истоку, вероватно је да су разни народи широм света почели да узгајају усеве у периоду од 10.000. до 7.000. године п.н.е. '
        },
        {
            id: 6,
            topic: 'Нутриција и здравље',
            text: "Поврће игра важну улогу у људској исхрани. Већина је сирова у мастима и калоријама, али је обимна и заситна. Обезбеђује дијететска влакна и важне изворе есенцијалних витамина, минерала и траговитих елемената. Посебно су важни антиоксидативни витамини А, Ц и Е. Када се поврће укључи у исхрану, уочава се смањење учесталости рака, можданог удара, кардиоваскуларних болести и других хроничних болести. Истраживања су показала да, у поређењу са људима који једу мање од три порције воћа и поврћа дневно, они који једу више од пет порција имају отприлике 20% мањи ризик од развоја коронарне болести срца или можданог удара."
        }
    ];

    export default tekstPovrca;