import { nutsImages } from "./nutsImages";

const orasastiPlodovi = [
  {
    id: 1,
    name: "Бадем",
    img: nutsImages.almonds,
    inGeneralHeading: `Квинтесенцијални плод`,
    inGeneral: `Бадеми (Prunus dulcis) су популаран орашасти плод познат по свом богатом укусу и импресивном нутритивном профилу. Потичу са Блиског истока и Јужне Азије, а данас се узгајају у разним регионима широм света, при чему је Калифорнија један од највећих произвођача. Ови нутритивно богати орашасти плодови могу се конзумирати сирови, печени или као путер од бадема и млеко од бадема, што их чини свестраним додатком различитим јелима.
                        Једна од истакнутих карактеристика бадема је њихов висок садржај здравих масти, углавном мононенасићених масти, које су корисне за здравље срца. Редовна конзумација бадема повезана је са нижим нивоима холестерола и смањеним ризиком од болести срца. Поред тога, бадеми су одличан извор протеина, што их чини одличним снацком за оне који желе да повећају унос протеина.
                        Бадеми су богати есенцијалним витаминима и минералима, укључујући витамин Е, магнезијум и калцијум. Витамин Е делује као моћан антиоксиданс који помаже у заштити ћелија од оксидативног стреса и упале. Магнезијум игра кључну улогу у бројним биохемијским процесима у организму, укључујући функцију мишића и нерва, контролу нивоа шећера у крви и здравље костију.
                        Садржај влакана у бадемима доприноси здрављу пробаве тако што подстиче редовно пражњење црева и помаже у управљању тежином. Једење бадема може вам помоћи да се осећате сито, што их чини идеалним снацком за оне који желе да контролишу свој апетит.
                        У кухињи, бадеми су невероватно свестрани. Могу се користити у разним јелима, од салата и прженки до десерта и печених производа. Млеко од бадема, популаран алтернативни извор млечних производа, такође може бити коришћено у смутијима, житарицама и кафама.
                        Укратко, бадеми су орашасти плодови богати нутритивним вредностима који нуде бројне здравствене користи. Њихове здраве масти, протеини, витамини и минерали чине их вредним додатком балансираној исхрани, док њихова свестраност у кухињи омогућава бескрајне кулинарске могућности.`,
    topic1: "Нутритивне вредности и здравље",
    nutritionText: [
      {
        element: "Енергетска вредност:",
        quantity: 579,
        measurementUnits: "кцал",
        description:
          "– Богати су калоријама, пружајући концентрисан извор енергије.",
      },
      {
        element: "Масти:",
        quantity: 49.9,
        measurementUnits: "г",
        description:
          "– Богати здравим мастима, углавном мононенасићеним мастима, корисним за здравље срца.",
      },
      {
        element: "Засићене масне киселине:",
        quantity: 3.7,
        measurementUnits: "г",
        description:
          "– Ниски су у засићеним мастима, што подстиче здравље срца.",
      },
      {
        element: "Витамин Е:",
        quantity: 25.6,
        measurementUnits: "мг",
        description:
          "– Добар извор витамина Е, антиоксиданса који подржава здравље коже и имунолошку функцију.",
      },
      {
        element: "Натријум:",
        quantity: 1,
        measurementUnits: "мг",
        description:
          "– Врло низак садржај натријума, чинећи их здравим избором за срце.",
      },
      {
        element: "Калијум:",
        quantity: 705,
        measurementUnits: "мг",
        description:
          "– Добар извор калијума, који је есенцијалан за функционисање мишића и регулисање крвног притиска.",
      },
      {
        element: "Угљени хидрати:",
        quantity: 21.6,
        measurementUnits: "г",
        description:
          "– Садрже угљене хидрате, пружајући енергију са ниским гликемијским индексом.",
      },
      {
        element: "Влакна:",
        quantity: 12.5,
        measurementUnits: "г",
        description: "– Богати влакнима, подстичући здравље пробаве и ситост.",
      },
      {
        element: "Шећер:",
        quantity: 4.4,
        measurementUnits: "г",
        description:
          "– Садрже природне шећере, који доприносе њиховој благој слаткоћи.",
      },
      {
        element: "Протеини:",
        quantity: 21.2,
        measurementUnits: "г",
        description:
          "– Одличан извор биљних протеина, важан за поправку и раст мишића.",
      },
      {
        element: "Калцијум:",
        quantity: 264,
        measurementUnits: "мг",
        description:
          "– Значајан извор калцијума, који подржава здравље костију.",
      },
      {
        element: "Гвожђе:",
        quantity: 3.7,
        measurementUnits: "мг",
        description:
          "– Садрже гвожђе, есенцијално за производњу здравих црвених крвних зрнаца.",
      },
      {
        element: "Магнезијум:",
        quantity: 268,
        measurementUnits: "мг",
        description:
          "– Богати магнезијумом, који је кључан за функционисање мишића и производњу енергије.",
      },
      {
        element: "Цинк:",
        quantity: 3.1,
        measurementUnits: "мг",
        description:
          "– Садрже цинк, који подржава имунолошку функцију и зацељивање рана.",
      },
      {
        element: "Витамин Б1 (Тиамин):",
        quantity: 0.2,
        measurementUnits: "мг",
        description: "– Подржава метаболизам енергије и функцију нерва.",
      },
      {
        element: "Витамин Б2 (Рибофлавин):",
        quantity: 1.0,
        measurementUnits: "мг",
        description: "– Важан за производњу енергије и здравље метаболизма.",
      },
      {
        element: "Витамин Б3 (Нијасин):",
        quantity: 3.4,
        measurementUnits: "мг",
        description: "– Подржава метаболизам и користан је за здравље коже.",
      },
      {
        element: "Витамин Б6:",
        quantity: 0.1,
        measurementUnits: "мг",
        description: "– Важан за метаболизам протеина и здравље мозга.",
      },
    ],
    cultivationHeading:
      "Узгој бадема захтева специфичне услове за оптималан раст и производњу плода. Ево прегледа кључних фактора који утичу на узгој бадема:",
    cultivation: [
      {
        id: 21,
        topic: "Клима",
        children: [
          {
            id: 211,
            topic: "Температура",
            text: "Бадеми напредују у топлим, умереним климатским условима. Треба им хладна зима за мировање, али су осетљиви на мраз током цветања. Идеална температура током растне сезоне је између 15°C и 30°C (59°F до 86°F).",
          },
          {
            id: 212,
            topic: "Часови хлађења",
            text: "Већина сорти бадема треба око 300 до 1.000 часова хлађења (часова испод 7°C или 45°F) током зиме да би се обезбедило правилно развијање пупољака и формирање плода.",
          },
        ],
      },
      {
        id: 22,
        topic: "Тло",
        children: [
          {
            id: 221,
            topic: "pH",
            text: "Бадеми преферирају добро дренирано, пешчано тло до ломљивог тла са pH нивоом између 6.0 и 7.5.",
          },
          {
            id: 222,
            topic: "Тип тла",
            text: "Добро дренирана тла су неопходна за бадемове, јер су осетљиви на водено застојавање. Треба избегавати тешка глинена тла која задржавају влагу.",
          },
          {
            id: 223,
            topic: "Припрема тла",
            text: "Инкорпорирање органских материја као што су компост или добро сазревши стајњак може побољшати плодност тла и дренажу пре садње.",
          },
        ],
      },
      {
        id: 23,
        topic: "Сорте",
        text: "Популарне сорте бадема укључују: - Nonpareil - (позната по високом квалитету ораха). - Carmel и Tuono - (одличне за комерцијалну производњу). - Sonora и Butte - (познате по укусу и приносу).",
      },
      {
        id: 24,
        topic: "Садња",
        children: [
          {
            id: 241,
            topic: "Време",
            text: "Најбоље време за садњу бадема је током мировања (касна зима до раног пролећа) пре него што почне нови раст.",
          },
          {
            id: 242,
            topic: "Размак",
            text: "Бадемове дрвеће треба размацити на око 4 до 6 метара (13 до 20 стопа) да би се обезбедила правилна раст и циркулација ваздуха.",
          },
          {
            id: 243,
            topic: "Опрашивање",
            text: "Већина сорти бадема није самопрашивана, па је садња најмање две различите сорте важна за побољшање приноса.",
          },
        ],
      },
      {
        id: 25,
        topic: "Заливање",
        children: [
          {
            id: 251,
            topic: "Фаза успостављања",
            text: "Бадемова дрвећа захтевају редовно заливање током првих неколико година након садње како би се успоставили јаки корени.",
          },
          {
            id: 252,
            topic: "Зрела дрвећа",
            text: "Када се успоставе, бадемова дрвећа треба дубоко, али ретко заливање да би се подстакнуо раст дубоких корена. Требају око 600 до 800 мм (24 до 31 инча) воде годишње.",
          },
          {
            id: 253,
            topic: "Избегавање прекомерног заливања",
            text: "Преплављење може довести до труљења корена и других болести, па је правилна дренажа од пресудног значаја.",
          },
        ],
      },
      {
        id: 26,
        topic: "Орезивање",
        children: [
          {
            id: 261,
            topic: "Облик",
            text: "Бадемова дрвећа се обично орезују у отворени центар, што омогућава продор сунчеве светлости у дрво и подстиче добру циркулацију ваздуха.",
          },
          {
            id: 262,
            topic: "Тиме",
            text: "Орезивање треба обавити током мировања (касна зима) да се уклоне мртви, болесни или претерано густи гране.",
          },
        ],
      },
      {
        id: 27,
        topic: "Ђубрење",
        children: [
          {
            id: 271,
            topic: "Нутријенти",
            text: "Бадеми имају користи од редовног ђубрења балансираним ђубривом (нпр. 10-10-10 НПК) или органским компостом.",
          },
          {
            id: 272,
            topic: "Време",
            text: "Ђубриво треба применити у раном пролећу пре него што нови раст почне. Треба избегавати ђубрење касно у сезони да би се спречио прекомерни вегетативни раст.",
          },
        ],
      },
      {
        id: 28,
        topic: "Контрола штеточина и болести",
        children: [
          {
            id: 281,
            topic: "Штеточине",
            text: "Уобичајени штеточини који утичу на бадеме укључују афиде, паукове гриње и наранџасте црве. Стратегије интегрисаног управљања штеточинама (IPM) могу помоћи у контроли ових штеточина.",
          },
          {
            id: 282,
            topic: "Болести",
            text: "Бадеми су подложни болестима као што су смеђи трулеж, бактеријски блеск и прашкаста плесан. Превентивне мере укључују правилно орезивање и употребу сорти отпорних на болести.",
          },
        ],
      },
      {
        id: 29,
        topic: "Жетва",
        children: [
          {
            id: 291,
            topic: "Време",
            text: "Бадеми су обично спремни за жетву крајем лета до ране јесени, у зависности од сорте и климе.",
          },
          {
            id: 292,
            topic: "Знаци зрелости",
            text: "Зрели бадеми имају чврсте љуске које се отварају, откривајући орах. Треба их убрати када се љуске почну одвајати од љуске.",
          },
          {
            id: 293,
            topic: "Обрада",
            text: "Бадеми треба пажљиво обрађивати како би се избегло оштећење ораха, а треба их правилно осушити након жетве како би се спречило кварење.",
          },
        ],
      },
      {
        id: 30.2,
        topic: "Чување",
        text: "Бадеми имају релативно дуг рок трајања ако се правилно чувају. Треба их чувати на хладном, сувом месту, најбоље у херметички затвореној посуди како би се очувала свежина.",
        children: [
          {
            id: 30.21,
            topic: "Очување",
            text: "Бадеми се могу бланширати, пећи или млети у бадемово брашно за очување и кулинарску употребу.",
          },
        ],
      },
      {
        id: 31.2,
        topic: "Проређивање",
        text: "Проређивање бадема у раном пролећу може помоћи да се побољша величина и квалитет ораха смањењем конкуренције за хранљиве материје.",
      },
    ],
  },
  {
    id: 2,
    name: "Бразилски ораси",
    img: nutsImages.brazilNuts,
    inGeneralHeading: `Супер ораси богати селеном`,
    inGeneral: `Бразилски ораси (Бертољеттија ексцела) су велики, хранљиви ораси који потичу из Амазонске прашуме, посебно из Бразила, Боливије и Перуа. Ови ораси су познати по свом богатом, кремастом текстури и благом, путером сличном укусу, што их чини омиљеним за грицкање и кулинарску употребу. Међутим, оно што их заиста издваја је њихов изузетан нутритивни профил, посебно високи садржај селена.  
Селен је моћан антиоксиданс који игра кључну улогу у многим телесним функцијама, укључујући јачање имуног система, подршку здрављу штитне жлезде и заштиту ћелија од оксидативног оштећења. Један или два бразилска ораха могу обезбедити више од препорученог дневног уноса селена, чинећи их једним од најбогатијих дијеталних извора овог есенцијалног минерала. Конзумирање хране богатом селеном, као што су бразилски ораси, може помоћи у смањењу упале, побољшању функције мозга и смањењу ризика од срчаних болести и одређених врста рака.  
Поред селена, бразилски ораси су одличан извор здравих масти, пре свега моноунсатурованих и полунсатурованих масти, које су корисне за здравље срца. Ове здраве масти могу помоћи у смањењу нивоа ЛДЛ (лошег) холестерола и повећању нивоа ХДЛ (добро) холестерола, што доприноси побољшању кардиоваскуларног здравља. Бразилски ораси такође пружају умерену количину протеина, као и есенцијалне витамине и минерале као што су магнезијум, фосфор, бакар и витамин Е.  
Кулинарски, бразилски ораси се могу конзумирати самостално као грицкалица, исечени и додани салатама, коришћени у печењу или смештени у путере од ораха. Због свог високог садржаја масти, такође додају кремасту богату текстуру десертима и могу се користити као основа за биљно млеко.  
Укратко, бразилски ораси су хранљива храна са изузетним здравственим предностима, посебно због садржаја селена. Конзумирани у умереним количинама, могу подржати имунски систем, здравље срца и опште благостање, чинећи их вредним додатком уравнотеженој исхрани.`,
    topic1: "Нутриција и здравље",
    nutritionText: [
      {
        element: "Енергетска вредност:",
        quantity: 659,
        measurementUnits: "ккал",
        description: "– Богат калоријама, пружа концензован извор енергије.",
      },
      {
        element: "Масти:",
        quantity: 66.4,
        measurementUnits: "г",
        description:
          "– Богат здравим мастима, пре свега незасићеним мастима које су корисне за здравље срца.",
      },
      {
        element: "Засићене масне киселине:",
        quantity: 15.1,
        measurementUnits: "г",
        description:
          "– Садржи умерене количине засићених масти; умереност је кључна за уравнотежену исхрану.",
      },
      {
        element: "Витамин Б3 (Ниацин):",
        quantity: 0.3,
        measurementUnits: "мг",
        description:
          "– Подржава метаболизам и важан је за одржавање здраве коже и нервног система.",
      },
      {
        element: "Натријум:",
        quantity: 1,
        measurementUnits: "мг",
        description:
          "– Веома низак садржај натријума, чинећи га избором пријатним за здравље срца.",
      },
      {
        element: "Калијум:",
        quantity: 659,
        measurementUnits: "мг",
        description:
          "– Добар извор калијума, који је одговоран за функцију мишића и равнотежу течности.",
      },
      {
        element: "Угљени хидрати:",
        quantity: 12.3,
        measurementUnits: "г",
        description:
          "– Садржи умерену количину угљених хидрата, пре свега од влакана.",
      },
      {
        element: "Влакна:",
        quantity: 7.5,
        measurementUnits: "г",
        description:
          "– Богат дијеталним влакнима, која подржавају здравље дигестивног система.",
      },
      {
        element: "Шећер:",
        quantity: 2.3,
        measurementUnits: "г",
        description:
          "– Садржи минималну количину природних шећера, што доприноси његовом ниском гликемијском индексу.",
      },
      {
        element: "Протеини:",
        quantity: 14.3,
        measurementUnits: "г",
        description:
          "– Добар извор биљних протеина, користан за поправку и раст мишића.",
      },
      {
        element: "Витамин Ц:",
        quantity: 0.7,
        measurementUnits: "мг",
        description:
          "– Садржи мале количине витамина Ц, који подржава здравље имуног система.",
      },
      {
        element: "Калцијум:",
        quantity: 160,
        measurementUnits: "мг",
        description:
          "– Пружа добар извор калцијума, који је важан за здравље костију.",
      },
      {
        element: "Гвожђе:",
        quantity: 2.4,
        measurementUnits: "мг",
        description:
          "– Садржи гвожђе, које је есенцијално за транспорт кисеоника у крви.",
      },
      {
        element: "Витамин Б1 (Тиамин):",
        quantity: 0.6,
        measurementUnits: "мг",
        description:
          "– Подржава енергетски метаболизам претварањем угљених хидрата у енергију.",
      },
      {
        element: "Витамин Б6:",
        quantity: 0.1,
        measurementUnits: "мг",
        description: "– Учествује у метаболизму и когнитивним функцијама.",
      },
      {
        element: "Витамин Б2 (Рибофлавин):",
        quantity: 0.1,
        measurementUnits: "мг",
        description:
          "– Има улогу у производњи енергије и одржавању здраве коже.",
      },
      {
        element: "Магнезијум:",
        quantity: 376,
        measurementUnits: "мг",
        description:
          "– Богат магнезијумом, који је важан за функцију мишића и здравље нерва.",
      },
      {
        element: "Цинк:",
        quantity: 4.1,
        measurementUnits: "мг",
        description:
          "– Садржи цинк, који подржава имунски систем и раст ћелија.",
      },
      {
        element: "Витамин Е:",
        quantity: 5.7,
        measurementUnits: "мг",
        description: "– Богат витамином Е, који има антиоксидативна својства.",
      },
      {
        element: "Селен:",
        quantity: 1917,
        measurementUnits: "мкг",
        description:
          "– Изузетно богат селеном, који је важан за функцију штитне жлезде и антиоксидативну одбрану.",
      },
      {
        element: "Витамин А:",
        quantity: 0,
        measurementUnits: "IU",
        description: "– Бразилски ораси нису значајан извор витамина А.",
      },
    ],
    cultivationHeading:
      "Култивација бразилских ораха захтева специфичне услове за оптималан раст и производњу ораха. Ево прегледа кључних фактора који су укључени у гајење бразилских ораха:",
    cultivation: [
      {
        id: 21,
        topic: "Клима",
        children: [
          {
            id: 211,
            topic: "Температура",
            text: "Бразилски ораси напредују у топлим, тропским климатским условима са температурама од 24°C до 30°C (75°F до 86°F). Потребна им је влажна средина за правилан раст.",
          },
          {
            id: 212,
            topic: "Падавине",
            text: "Бразилски ораси захтевају обилне падавине, обично између 1.500 и 2.500 мм (59 до 98 инча) годишње, са израженом кишном сезоном.",
          },
        ],
      },
      {
        id: 22,
        topic: "Тло",
        children: [
          {
            id: 221,
            topic: "ПХ",
            text: "Бразилски ораси воле добро дренирана, песковита лојм тла са ПХ вредношћу између 5.5 и 7.0.",
          },
          {
            id: 222,
            topic: "Тип тла",
            text: "Најбоље напредују на дубоким, плодним тлима која задржавају влагу али не постају водозасићена. Добро дренирана тла су кључна за здрав развој корена.",
          },
          {
            id: 223,
            topic: "Припрема тла",
            text: "Пре садње, корисно је убацити органски материјал као што је компост ради побољшања плодности и структуре тла.",
          },
        ],
      },
      {
        id: 23,
        topic: "Врсте",
        text: "Бразилски ораси (Бертољеттија ексцела) су главна врста која се гаји за производњу ораха. Не постоје специфичне сорте, али постоји генетска варијација у дивљим популацијама.",
      },
      {
        id: 24,
        topic: "Садња",
        children: [
          {
            id: 241,
            topic: "Време",
            text: "Најбоље време за садњу бразилских ораха је на почетку кишне сезоне како би се обезбедила довољна влага за клијање.",
          },
          {
            id: 242,
            topic: "Размак",
            text: "Дрвеће треба садити на растојању од 10 до 15 метара (33 до 50 стопа) да би имало довољно простора за раст и проток ваздуха.",
          },
          {
            id: 243,
            topic: "Опрашивање",
            text: "Бразилски ораси се углавном опрашују одређеним пчелама, укључујући орхидејске пчеле. Садња у близини других цветних биљака може помоћи у побољшању опрашивања.",
          },
        ],
      },
      {
        id: 25,
        topic: "Заливање",
        children: [
          {
            id: 251,
            topic: "Фаза успостављања",
            text: "Млади бразилски ораси захтевају редовно заливање у првих неколико година како би успоставили јаке корене.",
          },
          {
            id: 252,
            topic: "Окрепљена дрвећа",
            text: "Једном када се успоставе, бразилски ораси су релативно отпорни на сушу, али им користи стална влага, посебно током сувих периода.",
          },
          {
            id: 253,
            topic: "Избегавање прекомерног заливања",
            text: "Избегавајте водозасићење осигуравањем добре дренажне, јер вишак влаге може довести до труљења корена.",
          },
        ],
      },
      {
        id: 26,
        topic: "Орезивање",
        children: [
          {
            id: 261,
            topic: "Форма",
            text: "Орезивање се обавља углавном ради очувања здравља дрвета, обликовања и олакшавања бербе. Помоћу орезивања се ствара отворенију круну за боље продирање светлости.",
          },
          {
            id: 262,
            topic: "Време",
            text: "Орезивање треба обавити током суве сезоне како би се смањио ризик од болести и олакшала каснија одржавања.",
          },
        ],
      },
      {
        id: 27,
        topic: "Ђубрење",
        children: [
          {
            id: 271,
            topic: "Нутријенти",
            text: "Бразилски ораси имају користи од редовне примене органских ђубрива, укључујући компост, како би одржали плодност тла.",
          },
          {
            id: 272,
            topic: "Време",
            text: "Ђубрива треба применити током сезоне раста како би подржала здрав раст и развој ораха.",
          },
        ],
      },
      {
        id: 28,
        topic: "Контрола штеточина и болести",
        children: [
          {
            id: 281,
            topic: "Штеточине",
            text: "Чести штеточине укључују гусенице, бубе и афиде. Стратегије интегрисаног управљања штеточинама (ИПМ) могу помоћи у управљању овим проблемима.",
          },
          {
            id: 282,
            topic: "Болести",
            text: "Дрвећа бразилског ораха могу бити погођена болестима као што су труљење корена и болести љуспица листа. Правилан избор локације и управљачке праксе могу помоћи у спречавању ових проблема.",
          },
        ],
      },
      {
        id: 29,
        topic: "Берба",
        children: [
          {
            id: 291,
            topic: "Време",
            text: "Бразилски ораси се обично беру од јануара до марта, у зависности од климе и локације.",
          },
          {
            id: 292,
            topic: "Знакови зрелости",
            text: "Ораси су спремни за бербу када се спољне љуске отворе. Ово се обично дешава 14 месеци након цветања.",
          },
          {
            id: 293,
            topic: "Руковање",
            text: "Бербани ораси треба да се пажљиво руковође како би се избегла оштећења. Обично се сакупљају са земље након што падну.",
          },
        ],
      },
      {
        id: 30.2,
        topic: "Складиштење",
        text: "Бразилски ораси се могу складиштити на хладном, сувом месту, идеално у затвореним посудама. Треба их конзумирати у року од неколико месеци за најбољи укус.",
        children: [
          {
            id: 30.21,
            topic: "Очување",
            text: "Бразилски ораси се такође могу печити или прерађивати у уља и путере како би се продужио рок трајања.",
          },
        ],
      },
      {
        id: 31.2,
        topic: "Оријавање",
        text: "Оријавање незрелих ораха може бити потребно како би се побољшала величина и квалитет преосталих ораха, али ова пракса је мање честа.",
      },
    ],
  },
  {
    id: 3,
    name: "Семенке бундеве",
    img: nutsImages.pumpkinSeeds,
    inGeneralHeading: `Мале али нутритивно густе`,
    inGeneral: `Семенке бундеве, или пепите, су јестиве семе бундеве (Cucurbita pepo), познате по свом импресивном нутритивном саставу иако су мале величине. Доступне у различитим облицима—сирове, печене, са сољом или без соље—семенке бундеве су постале популаран снацк и састојак захваљујући својим здравственим предностима и свестраности у кувању. 
                Једна од главних предности семенки бундеве је њихов богат садржај здравих масти, посебно незасићених масти, које су корисне за здравље срца. Ове масти могу помоћи у смањењу лошег холестерола (LDL) и промовисању општег здравља кардиоваскуларног система. Семенке бундеве су такође значајан извор биљних протеина, што их чини одличним снацком за вегетаријанце, вегане и оне који желе повећати унос протеина.
                Семенке бундеве су пуне важних витамина и минерала, посебно магнезијума, цинка и гвожђа. Магнезијум је важан за функцију мишића и нервног система, регулисање крвног притиска и одржавање здравља костију. Цинк подржава имунолошки систем, раст ћелија и зарастање рана, док гвожђе игра кључну улогу у преносу кисеоника кроз тело. Ови нутријенти доприносе репутацији семенки као нутритивно густе супер-хране.
                Поред ових минерала, семенке бундеве садрже моћне антиоксиданте као што су витамин Е и каротеноиди, који штите тело од оксидативног стреса и запаљења. Њихов висок садржај влакана подржава варење и помаже у регулацији нивоа шећера у крви, доприносећи општем метаболичком здрављу.
                У кулинарском смислу, семенке бундеве могу се јести саме као снацк или користити као прелив за салате, овсене каше, јогурт и супе. Могу се укључити у пецива, граноле или се уситнити у песто и друге намазе.
                У резимеу, семенке бундеве су нутритивно густе и свестране, нуде значајне здравствене предности које се крећу од подршке срцу и имунитету до здравља варења. Ове мале семенке су моћан додатак свакој уравнотеженој исхрани.`,
    topic1: "Нутриција и здравље",

    nutritionText: [
      {
        element: "Енергетска вредност:",
        quantity: 559,
        measurementUnits: "ккал",
        description:
          "– Висок у калоријама, пружа концентрисани извор енергије.",
      },
      {
        element: "Масти:",
        quantity: 49.1,
        measurementUnits: "г",
        description:
          "– Богат са здравим мастима, посебно полинезасићеним и мононезасићеним мастима.",
      },
      {
        element: "Засићене масне киселине:",
        quantity: 8.1,
        measurementUnits: "г",
        description: "– Садржи умерену количину засићених масти.",
      },
      {
        element: "Витамин Е:",
        quantity: 0.3,
        measurementUnits: "мг",
        description: "– Садржи мале количине витамина Е, који је антиоксиданс.",
      },
      {
        element: "Натријум:",
        quantity: 7,
        measurementUnits: "мг",
        description:
          "– Врло низак садржај натријума, што га чини здравим за срце.",
      },
      {
        element: "Калијум:",
        quantity: 919,
        measurementUnits: "мг",
        description: "– Добар извор калијума, важан за функцију срца и мишића.",
      },
      {
        element: "Угљени хидрати:",
        quantity: 10.7,
        measurementUnits: "г",
        description: "– Садржи угљене хидрате, који пружају извор енергије.",
      },
      {
        element: "Влакна:",
        quantity: 6.0,
        measurementUnits: "г",
        description: "– Богат влакнима која подржавају здравље варења.",
      },
      {
        element: "Шећер:",
        quantity: 1.4,
        measurementUnits: "г",
        description: "– Садржи минималне природне шећере.",
      },
      {
        element: "Протеини:",
        quantity: 30.2,
        measurementUnits: "г",
        description:
          "– Одличан извор биљних протеина, користан за поправку мишића.",
      },
      {
        element: "Калцијум:",
        quantity: 46,
        measurementUnits: "мг",
        description: "– Садржи неки калцијум, који доприноси здрављу костију.",
      },
      {
        element: "Гвожђе:",
        quantity: 8.8,
        measurementUnits: "мг",
        description:
          "– Богат извор гвожђа, важан за транспорт кисеоника у телу.",
      },
      {
        element: "Магнезијум:",
        quantity: 592,
        measurementUnits: "мг",
        description:
          "– Богат са магнезијумом, који је важан за функцију мишића и производњу енергије.",
      },
      {
        element: "Цинк:",
        quantity: 7.6,
        measurementUnits: "мг",
        description: "– Добар извор цинка, који подржава имунолошки систем.",
      },
      {
        element: "Витамин Б1 (Тиамин):",
        quantity: 0.2,
        measurementUnits: "мг",
        description: "– Подржава метаболизам енергије.",
      },
      {
        element: "Витамин Б2 (Рибофлавин):",
        quantity: 0.2,
        measurementUnits: "мг",
        description:
          "– Важан за производњу енергије и опште метаболичко здравље.",
      },
      {
        element: "Витамин Б3 (Нијасин):",
        quantity: 1.7,
        measurementUnits: "мг",
        description: "– Подржава метаболизам и користан је за здравље коже.",
      },
      {
        element: "Витамин Б6:",
        quantity: 0.1,
        measurementUnits: "мг",
        description: "– Важан за метаболизам протеина и здравље мозга.",
      },
    ],
    cultivationHeading:
      "Култивација семенки бундеве захтева специфичне услове за оптималан раст и производњу семенки. Ево прегледа кључних фактора који су укључени у узгој семенки бундеве:",
    cultivation: [
      {
        id: 21,
        topic: "Клима",
        children: [
          {
            id: 211,
            topic: "Температура",
            text: "Бундеве успевају у топлим климама, са температуром између 18°C и 30°C (65°F до 86°F) за оптималан раст. Осетљиве су на мраз и треба их садити након последњег мраза.",
          },
          {
            id: 212,
            topic: "Падавине",
            text: "Бундеве захтевају константну влагу, са идеалним падавинама од 50 до 75 cm (20 до 30 инча) током сезоне раста. Погодна количина воде је кључна током цветања и развоја семенки.",
          },
        ],
      },
      {
        id: 22,
        topic: "Тло",
        children: [
          {
            id: 221,
            topic: "pH",
            text: "Бундеве воле благо кисело до неутрално тло са pH вредностима од 6.0 до 7.5.",
          },
          {
            id: 222,
            topic: "Тип тла",
            text: "За узгој бундеве идеално је добро дренирано, љуштено тло обогаћено органским материјама. Могу да толеришу песковита тла, али ће захтевати чешће заливање.",
          },
          {
            id: 223,
            topic: "Припрема тла",
            text: "Пре садње, обрадите тло и укључите органске материје као што су компост за побољшање плодности и структуре тла.",
          },
        ],
      },
      {
        id: 23,
        topic: "Врсте",
        text: "Популарне врсте бундеве за производњу семенки укључују: -Стијерска бундевa- (позната по семенкама без љуске). -Кабоча- (слатког укуса и добра за печење). -Декоративна бундевa- (обично узгајана за декорацију и кулинарске сврхе).",
      },
      {
        id: 24,
        topic: "Садња",
        children: [
          {
            id: 241,
            topic: "Време",
            text: "Семенке бундеве треба садити касно пролеће до рано лето, када се тло загреје на најмање 15°C (60°F).",
          },
          {
            id: 242,
            topic: "Размак",
            text: "Семенке треба садити 2.5 до 5 cm (1 до 2 инча) дубоко, са размаком од око 90 cm (3 фита) између редова који су удаљени 1.5 до 2 метра (5 до 6 стопа).",
          },
          {
            id: 243,
            topic: "Опрашивање",
            text: "Бундеве обично опрашују пчеле. Садња цветова у близини може привући опрашиваче и побољшати формирање плода и семенки.",
          },
        ],
      },
      {
        id: 25,
        topic: "Заливање",
        children: [
          {
            id: 251,
            topic: "Фаза настанка",
            text: "Током фазе клијања, одржавајте тло константно влажним. Заливајте дубоко да бисте подстакли јак развој корена.",
          },
          {
            id: 252,
            topic: "Окрепљене биљке",
            text: "Када се биљке успоставе, потребно им је око 25 до 50 mm (1 до 2 инча) воде недељно, посебно током цветања и развоја семенки.",
          },
          {
            id: 253,
            topic: "Избегавајте прекомерно заливање",
            text: "Превенција задржавања воде је важна јер прекомерна влага може довести до труљења корена и других болести.",
          },
        ],
      },
      {
        id: 26,
        topic: "Ђубрење",
        children: [
          {
            id: 261,
            topic: "Храњиве материје",
            text: "Бундеве користе уравнотежено ђубриво, посебно оно са високим садржајем фосфора и калијума, што подстиче цветање и производњу семенки.",
          },
          {
            id: 262,
            topic: "Време",
            text: "Ђубрење пре садње и поново када биљке почну да цветају, пратећи препоручене количине примене.",
          },
        ],
      },
      {
        id: 27,
        topic: "Контрола штеточина и болести",
        children: [
          {
            id: 271,
            topic: "Штеточине",
            text: "Чести штеточини су апиди, бубе бундеве и бубе краставаца. Применом ротације усева и увођењем корисних инсеката може се помоћи у управљању овим штеточинама.",
          },
          {
            id: 272,
            topic: "Болести",
            text: "Бундеве су подложне прашкастој плесни, плавој плесни и труљењу корена. Правилан размак и проток ваздуха, као и примена фунгицида ако је потребно, могу помоћи у контроли болести.",
          },
        ],
      },
      {
        id: 28,
        topic: "Жетва",
        children: [
          {
            id: 281,
            topic: "Време",
            text: "Бундеве су обично спремне за жетву од касног лета до ране јесени, око 75 до 100 дана након садње.",
          },
          {
            id: 282,
            topic: "Знаци зрелости",
            text: "Кора треба да буде тврда, а боја треба да буде дубока и богата, са осушеним стабљикама. Жетву треба обавити када плод буде потпуно зрел за најбољи квалитет семенки.",
          },
          {
            id: 283,
            topic: "Руковање",
            text: "Жетвене бундеве треба пажљиво руковати да би се избегло њихово повређивање. Складиштити их на хладном и сувом месту док не буду спремне за екстракцију семенки.",
          },
        ],
      },
      {
        id: 30.2,
        topic: "Чување",
        text: "Семенке бундеве треба чувати на хладном и сувом месту. За дуже чување, држите их у херметички затвореној посуди у фрижидеру или замрзивачу да бисте одржали свежину.",
        children: [
          {
            id: 30.21,
            topic: "Очување",
            text: "Семенке бундеве могу се такође печити или ароматизовати пре чувања, чиме постају нутритивна ужина.",
          },
        ],
      },
      {
        id: 31.2,
        topic: "Поређивање",
        text: "Поређивање није обично потребно, али ако су биљке претрпане, уклањање неколико садница може помоћи у побољшању протока ваздуха и смањењу конкуренције за ресурсе.",
      },
    ],
  },
  {
    id: 4,
    name: "Лешник",
    img: nutsImages.hazelnut,
    inGeneralHeading: `Нутритивно богате делиције`,
    inGeneral: `Лешници (Corylus avellana), познати и као филберти, мале су, округле ораси са богатим, слатким укусом и хрскавом текстуром. Пореклом су из Европе и Азије, али се сада узгајају у многим деловима света, а Турска је највећи произвођач. Лешници нису само укусни, већ су и пуни есенцијалних нутријената, што их чини популарним избором за здраву исхрану.
                        Једна од кључних нутритивних користи лешника је њихов висок садржај здравих масти, посебно мононенасићених масти. Ове масти су познате по томе што подржавају здравље срца тако што смањују лош холестерол (LDL), а повећавају добар холестерол (HDL). Такође, лешници су одличан извор витамина Е, моћног антиоксиданта који помаже у заштити ћелија од оксидативног стреса и подржава здравље коже.
                        Лешници су такође богати магнезијумом, минералом који је есенцијалан за функцију мишића, производњу енергије и здравље костију. Пружају добру количину дијеталних влакана која помажу варењу, регулишу нивое шећера у крви и промовишу осећај ситости, што их чини задовољавајућом ужином.
                        У кулинарству, лешници се могу јести сирови или печени и често се користе у разним јелима, укључујући салате, гранолу и пецива. Такође су популарни у слаткишима као што су чоколадне пасте и пралине.
                        Укратко, лешници су нутритивни и свестрани ораси који нуде бројне здравствене користи, укључујући подршку здрављу срца и антиоксидантна својства. Њихов богат укус и прилагодљивост у кувању чине их вредним додацима у уравнотежену исхрану.`,
    topic1: "Нутриција и здравље",
    nutritionText: [
      {
        element: "Енергетска вредност:",
        quantity: 628,
        measurementUnits: "кцал",
        description:
          "– Богати калоријама, пружају концензовани извор енергије.",
      },
      {
        element: "Масти:",
        quantity: 60.8,
        measurementUnits: "г",
        description:
          "– Богати здравим мастима, углавном мононенасићеним мастима које подржавају здравље срца.",
      },
      {
        element: "Засићене масне киселине:",
        quantity: 4.5,
        measurementUnits: "г",
        description:
          "– Садрже ниске нивое засићених масти, што промовише опште здравље срца.",
      },
      {
        element: "Витамин Б3 (Нијасин):",
        quantity: 1.3,
        measurementUnits: "мг",
        description:
          "– Подржава метаболизам и важан је за одржавање здраве коже и нерва.",
      },
      {
        element: "Натријум:",
        quantity: 0,
        measurementUnits: "мг",
        description:
          "– Веома низак садржај натријума, чини га здравим избором за срце.",
      },
      {
        element: "Калијум:",
        quantity: 680,
        measurementUnits: "мг",
        description:
          "– Добар извор калијума, есенцијалног за функцију мишића и равнотежу течности.",
      },
      {
        element: "Угљени хидрати:",
        quantity: 16.7,
        measurementUnits: "г",
        description:
          "– Садржи умерену количину угљених хидрата, углавном из влакана.",
      },
      {
        element: "Влакна:",
        quantity: 9.7,
        measurementUnits: "г",
        description:
          "– Богат извор дијеталних влакана која подржавају здравље варења.",
      },
      {
        element: "Шећер:",
        quantity: 4.4,
        measurementUnits: "г",
        description:
          "– Садржи минималне природне шећере, што доприноси његовом укупном ниском гликемијском индексу.",
      },
      {
        element: "Протеини:",
        quantity: 14.1,
        measurementUnits: "г",
        description:
          "– Добар извор биљних протеина, користан за поправку и раст мишића.",
      },
      {
        element: "Витамин Ц:",
        quantity: 1.2,
        measurementUnits: "мг",
        description:
          "– Садржи мале количине витамина Ц који подржавају имунолошко здравље.",
      },
      {
        element: "Калцијум:",
        quantity: 114,
        measurementUnits: "мг",
        description:
          "– Пружа добар извор калцијума који је важан за здравље костију.",
      },
      {
        element: "Гвожђе:",
        quantity: 4.7,
        measurementUnits: "мг",
        description:
          "– Садржи гвожђе које је есенцијално за транспорт кисеоника у крви.",
      },
      {
        element: "Витамин Б1 (Тиамин):",
        quantity: 0.6,
        measurementUnits: "мг",
        description:
          "– Подржава енергетски метаболизам претварањем угљених хидрата у енергију.",
      },
      {
        element: "Витамин Б6:",
        quantity: 0.1,
        measurementUnits: "мг",
        description: "– Учествује у метаболизму и когнитивним функцијама.",
      },
      {
        element: "Витамин Б2 (Рибофлавин):",
        quantity: 0.1,
        measurementUnits: "мг",
        description:
          "– Игра улогу у производњи енергије и одржавању здраве коже.",
      },
      {
        element: "Магнезијум:",
        quantity: 163,
        measurementUnits: "мг",
        description:
          "– Добар извор магнезијума који је есенцијалан за функцију мишића и здравље нерва.",
      },
      {
        element: "Цинк:",
        quantity: 2.4,
        measurementUnits: "мг",
        description:
          "– Садржи цинк који подржава имунолошку функцију и раст ћелија.",
      },
      {
        element: "Витамин Е:",
        quantity: 15.03,
        measurementUnits: "мг",
        description: "– Богат је витамином Е који има антиоксидантна својства.",
      },
      {
        element: "Витамин А:",
        quantity: 0,
        measurementUnits: "ИИ",
        description: "– Лешници нису значајан извор витамина А.",
      },
    ],
    cultivationHeading:
      "За узгој лешника потребни су специфични услови за оптималан раст и производњу ораха. Ево прегледа кључних фактора који утичу на раст лешника:",
    cultivation: [
      {
        id: 21,
        topic: "Клима",
        children: [
          {
            id: 211,
            topic: "Температура",
            text: "Лешници нарастају у умереној клими са хладним зимама и топлим летом. Идеални температурни опсег за раст је између 15°C и 25°C (59°F до 77°F). За правилан развој пупољака потребан им је период хлађења (између 0°C и 7°C или 32°F и 45°F) током зиме.",
          },
          {
            id: 212,
            topic: "Падавине",
            text: "Лешници преферирају умерене падавине, са потребом за око 600 до 1,200 мм (24 до 47 инча) годишње. Иригирање може бити потребно током сувих периода, посебно током цветања и развоја ораха.",
          },
        ],
      },
      {
        id: 22,
        topic: "Тло",
        children: [
          {
            id: 221,
            topic: "pH",
            text: "Лешници најбоље расту у благо киселом до неутралном тлу, са pH опсегом од 6.0 до 7.5.",
          },
          {
            id: 222,
            topic: "Тип тла",
            text: "Најбоља су добро дренирана, лојна тла богата органским материјама. Могу поднети различите типове тла, али су осетљиви на преливање воде.",
          },
          {
            id: 223,
            topic: "Припрема тла",
            text: "Пре садње, тло треба обрадити и обогатити органским материјама као што су компост или добро растворени стајњак, како би се побољшала плодност и дренажа.",
          },
        ],
      },
      {
        id: 23,
        topic: "Врсте",
        text: "Популарне сорте лешника укључују: -Барселона- (позната по високом приносу и добром квалитету ораха). -Тонда ди Ђифони- (позната по округлом облику и укусу). -Цорyлус авеллана- (обична сорта лешника).",
      },
      {
        id: 24,
        topic: "Садња",
        children: [
          {
            id: 241,
            topic: "Време",
            text: "Најбоље време за садњу лешника је у јесен или рано пролеће када је тло радно.",
          },
          {
            id: 242,
            topic: "Размак",
            text: "Дрвеће лешника треба садити на удаљености од 4 до 6 метара (13 до 20 стопа) како би се омогућио правилан раст и циркулација ваздуха.",
          },
          {
            id: 243,
            topic: "Опрашивање",
            text: "Лешници су обично самоплодни, али имају користи од крстастог опрашивања. Садња више сорта може повећати принос и квалитет ораха.",
          },
        ],
      },
      {
        id: 25,
        topic: "Заливање",
        children: [
          {
            id: 251,
            topic: "Фаза успостављања",
            text: "Млади лешници захтевају редовно заливање током првих неколико година како би се успоставио јак коренов систем.",
          },
          {
            id: 252,
            topic: "Зрела стабла",
            text: "Када се стабла успоставе, лешници требају око 600 до 800 мм (24 до 31 инча) воде годишње, посебно током цветања и формирања ораха.",
          },
          {
            id: 253,
            topic: "Избегавање прекомерног заливања",
            text: "Обезбедите добру дренажу како бисте избегли водену загушеност, што може довести до болести корена.",
          },
        ],
      },
      {
        id: 26,
        topic: "Ђубрење",
        children: [
          {
            id: 261,
            topic: "Нутријенти",
            text: "Лешници имају користи од уравнотеженог ђубрива које садржи азот, фосфор и калијум, са фокусом на органске допунске материјале.",
          },
          {
            id: 262,
            topic: "Време",
            text: "Ђубрење треба применити рано пролеће пре почетка новог раста, а затим поново током раста како је потребно.",
          },
        ],
      },
      {
        id: 27,
        topic: "Контрола штеточина и болести",
        children: [
          {
            id: 271,
            topic: "Штеточине",
            text: "Обичне штеточине укључују вашице, жуљеве и источно филбертово упала. Применом интегрисаних мера заштите од штеточина (IPM) може се контролисати ови штеточини.",
          },
          {
            id: 272,
            topic: "Болести",
            text: "Лешници су осетљиви на болести као што су прашкасти плесни и упала. Добре културне праксе, укључујући правилан размак и санитарне мере, могу помоћи у превенцији избијања болести.",
          },
        ],
      },
      {
        id: 28,
        topic: "Жетва",
        children: [
          {
            id: 281,
            topic: "Време",
            text: "Лешници се обично беру касно лето до рану јесен када љуске почињу да се суше и постају смеђе.",
          },
          {
            id: 282,
            topic: "Знакови зрелости",
            text: "Зрели лешници ће отпасти са дрвета или се могу потрести са грана. Љуске треба да буду чврсте, а ораси пуни.",
          },
          {
            id: 283,
            topic: "Обрада",
            text: "Ораси при руковању треба пажљиво третирати како би се избегла оштећења. Треба их брзо осушити како би се спречила плесан и поквареност.",
          },
        ],
      },
      {
        id: 30.2,
        topic: "Складиштење",
        text: "Лешници треба да се чувају на хладном, сувом месту. За дужу чување, држите их у затвореној посуди у фрижидеру или замрзивачу како би се одржала свежина.",
        children: [
          {
            id: 30.21,
            topic: "Очување",
            text: "Лешници се такође могу пећи или користити у разним рецептима како би се побољшао њихов укус и текстура.",
          },
        ],
      },
      {
        id: 31.2,
        topic: "Проређивање",
        text: "Проређивање можда није неопходно, али ако су стабла пренатрпана, селективно обрезивање може побољшати циркулацију ваздуха и смањити конкуренцију за хранљиве материје.",
      },
    ],
  },
  {
    id: 5,
    name: "Сусам",
    img: nutsImages.sesameSeed,
    inGeneralHeading: `Мали хранљиви моћници`,
    inGeneral: `Сусам (Sesamum indicum) је малено, овало-обликовано семе које долази у разним бојама, укључујући белу, црну и смеђу. Без обзира на своју малу величину, сусам је богат хранљивим материјама и гаји се већ хиљадама година, посебно у регионима Азије и Африке. Ова семена су широко коришћена у кувању, јер пружају не само специфичан орашасти укус већ и импресивне здравствене користи.
                      Један од кључних нутријената који се налази у сусаму су здрави масти, посебно полинезасићене и мононезасићене масти, које су корисне за здравље срца. Такође садржи биљне лигнане, као што су сезамин и сезамол, који имају антиоксидативна својства и помажу у смањењу упале и заштити од оштећења ћелија.
                      Сусам је одличан извор биљног протеина, што га чини одличним додатком у исхрани вегетаријанаца и вегана. Такође је богат есенцијалним витаминима и минералима, као што су калцијум, магнезијум, фосфор и цинк, који подржавају здравље костију, имунски систем и опште благостање. Семе такође пружа добру количину Б витамина, укључујући тиамин, ниацин и фолну киселину, који су важни за производњу енергије и функцију мозга.
                      Поред својих нутритивних предности, сусам је богат дијеталним влакнима, која подстичу здраву дигестију и помажу у регулацији нивоа шећера у крви. Њихов садржај влакана, у комбинацији са здравим мастима и протеином, чини их задовољавајућим грицкалицама или састојком у разним јелима.
                      У кулинарском смислу, сусам је изузетно свестран. Користи се у слатким и сланим рецептима, од посипања хлебова и салата до млевења у тахини—кремасту пасту која се често користи у блискоисточној кухињи. Сусамово уље, добијено из семена, такође је популаран састојак у кувању, познат по свом богатом укусу.
                      Укратко, сусам је можда мали, али је богат нутријентима и нуди низ здравствених предности, од здравља срца и подршке здрављу костију до здравља дигестије. Његова свестраност у кувању чини га вредним додатком свакој исхрани.`,
    topic1: "Храна и здравље",
    nutritionText: [
      {
        element: "Енергетска вредност:",
        quantity: 573,
        measurementUnits: "кцал",
        description: "– Богат калоријама, пружа концензовани извор енергије.",
      },
      {
        element: "Масти:",
        quantity: 49.7,
        measurementUnits: "г",
        description:
          "– Богат здравим мастима, углавном полинезасићеним и мононезасићеним мастима.",
      },
      {
        element: "Засићене масне киселине:",
        quantity: 6.9,
        measurementUnits: "г",
        description: "– Садржи умерену количину засићених масти.",
      },
      {
        element: "Витамин Е:",
        quantity: 0.2,
        measurementUnits: "мг",
        description:
          "– Садржи мале количине витамина Е, који делује као антиоксиданс.",
      },
      {
        element: "Натријум:",
        quantity: 11,
        measurementUnits: "мг",
        description:
          "– Веома низак садржај натријума, што га чини корисним за здравље срца.",
      },
      {
        element: "Калијум:",
        quantity: 468,
        measurementUnits: "мг",
        description:
          "– Добар извор калијума, који је есенцијалан за функцију мишића и равнотежу течности.",
      },
      {
        element: "Угљени хидрати:",
        quantity: 23.4,
        measurementUnits: "г",
        description: "– Садржи угљене хидрате, пружајући извор енергије.",
      },
      {
        element: "Влакна:",
        quantity: 14.6,
        measurementUnits: "г",
        description: "– Богат дијеталним влакнима, подстиче здравље дигестије.",
      },
      {
        element: "Шећери:",
        quantity: 0.3,
        measurementUnits: "г",
        description: "– Садржи минималне природне шећере.",
      },
      {
        element: "Протеини:",
        quantity: 17.0,
        measurementUnits: "г",
        description:
          "– Добар извор биљних протеина, користан за поправку мишића.",
      },
      {
        element: "Калцијум:",
        quantity: 975,
        measurementUnits: "мг",
        description: "– Веома висок у калцијуму, подржава здравље костију.",
      },
      {
        element: "Гвожђе:",
        quantity: 14.6,
        measurementUnits: "мг",
        description: "– Богат гвожђем, важно за транспорт кисеоника у телу.",
      },
      {
        element: "Магнезијум:",
        quantity: 351,
        measurementUnits: "мг",
        description:
          "– Висок у магнезијуму, есенцијалан за функцију мишића и производњу енергије.",
      },
      {
        element: "Цинк:",
        quantity: 7.8,
        measurementUnits: "мг",
        description: "– Добар извор цинка, који подржава имунски систем.",
      },
      {
        element: "Витамин Б1 (Тијамин):",
        quantity: 0.8,
        measurementUnits: "мг",
        description: "– Подржава метаболизам енергије.",
      },
      {
        element: "Витамин Б2 (Рибофлавин):",
        quantity: 0.2,
        measurementUnits: "мг",
        description: "– Важан за производњу енергије и метаболичко здравље.",
      },
      {
        element: "Витамин Б3 (Нијасин):",
        quantity: 4.5,
        measurementUnits: "мг",
        description: "– Подржава метаболизам и здравље коже.",
      },
      {
        element: "Витамин Б6:",
        quantity: 0.8,
        measurementUnits: "мг",
        description: "– Важан за метаболизам протеина и здравље мозга.",
      },
    ],
    cultivationHeading:
      "Узгој семена сусама захтева специфичне услове за оптималан раст и производњу семена. Ево прегледа кључних фактора који су укључени у узгој семена сусама:",
    cultivation: [
      {
        id: 21,
        topic: "Клима",
        children: [
          {
            id: 211,
            topic: "Температура",
            text: "Семе сусама најбоље расте у топлим климатским условима и захтева температурни опсег од 20°C до 30°C (68°F до 86°F) за оптималан раст. Осетљиви су на мраз, па их треба садити након последњег мраза.",
          },
          {
            id: 212,
            topic: "Падавине",
            text: "Сусам је отпоран на сушу, али захтева око 300 до 600 мм (12 до 24 инча) падавина током растне сезоне. Адекватна влажност је кључна током цветања и пуњења семена.",
          },
        ],
      },
      {
        id: 22,
        topic: "Тло",
        children: [
          {
            id: 221,
            topic: "pH",
            text: "Сусам преферира благо кисело до неутрално тло са pH опсегом од 6.0 до 7.5.",
          },
          {
            id: 222,
            topic: "Тип тла",
            text: "Идеално за узгој сусама су добро дренирана, песковита или иловаста тла. Могу толерисати различите типове тла, али не раде добро у тешким глиненим тлима која задржавају воду.",
          },
          {
            id: 223,
            topic: "Припрема тла",
            text: "Пре садње, тло треба припремити обрадом и укључивањем органског материјала, као што је компост, ради побољшања плодовитости и дренаже.",
          },
        ],
      },
      {
        id: 23,
        topic: "Врсте",
        text: "Популарне врсте семена сусама укључују: - Гиза 32 (висок принос и отпорност на болести). - Сики (познат по садржају уља и отпорности на сушу). - Тиан Ма (висококвалитетна семена са добрим укусом).",
      },
      {
        id: 24,
        topic: "Садња",
        children: [
          {
            id: 241,
            topic: "Време",
            text: "Семе сусама треба садити касно пролеће или рано лето када температура тла достигне најмање 20°C (68°F).",
          },
          {
            id: 242,
            topic: "Размак",
            text: "Семе треба садити на дубини од 1 до 2 см (0.4 до 0.8 инча) са размацима редова од 30 до 45 см (12 до 18 инча) и размацима семена од 5 до 10 см (2 до 4 инча) унутар реда.",
          },
          {
            id: 243,
            topic: "Квота за садњу",
            text: "За оптималан раст, препоручује се квота за садњу од око 4 до 6 кг по хектару (3 до 5 фунти по акру).",
          },
        ],
      },
      {
        id: 25,
        topic: "Заливање",
        children: [
          {
            id: 251,
            topic: "Фаза успостављања",
            text: "Семе сусама захтева константну влажност током клијања и успостављања, посебно у првим недељама после садње.",
          },
          {
            id: 252,
            topic: "Зреле биљке",
            text: "Након успостављања, биљке сусама захтевају минимално заливање. Међутим, додатно заливање може бити потребно током цветања и развоја семена у сувим условима.",
          },
          {
            id: 253,
            topic: "Избегавање прекомерног заливања",
            text: "Прекомерна влажност може довести до труљења корена и других гљивичних болести. Потребно је осигурати добру дренажу.",
          },
        ],
      },
      {
        id: 26,
        topic: "Ђубрење",
        children: [
          {
            id: 261,
            topic: "Нутријенти",
            text: "Сусам има користи од избалансираног ђубрења азотом, фосфором и калијумом. Тест тла може помоћи у одређивању специфичних потреба за нутријентима.",
          },
          {
            id: 262,
            topic: "Време",
            text: "Ђубрива треба применити пре садње, а могу се додати и током растне сезоне, посебно током цветања.",
          },
        ],
      },
      {
        id: 27,
        topic: "Контрола штеточина и болести",
        children: [
          {
            id: 271,
            topic: "Штеточине",
            text: "Уобичајене штеточине укључују афиде, беле мушице и коровне борове сусама. Стратегије интегрисаног управљања штеточинама (IPM), као што су ротација усева и природни предатори, могу помоћи у контроли ових штеточина.",
          },
          {
            id: 272,
            topic: "Болести",
            text: "Сусам је подложан болестима као што су прашкаста плесни, мрље на листовима и труљење корена. Превентивне мере укључују ротацију усева, правилан размак и употребу отпорних врста.",
          },
        ],
      },
      {
        id: 28,
        topic: "Жетва",
        children: [
          {
            id: 281,
            topic: "Време",
            text: "Семе сусама је обично спремно за жетву 90 до 130 дана након садње, у зависности од врсте и услова раста.",
          },
          {
            id: 282,
            topic: "Знаци зрелости",
            text: "Плодови семена ће постати браон и почети да пуцају када семе буде зрело. Жетва треба да се обави када су плодови суви како би се спречио губитак семена.",
          },
          {
            id: 283,
            topic: "Метод",
            text: "Сусам се може жетвати ручно или механички. Ако се користи машина, треба осигурати да је правилно подешена како би се избегло оштећење семена.",
          },
        ],
      },
      {
        id: 30.2,
        topic: "Чување",
        text: "Семе сусама треба чувати на хладном и сувом месту, најбоље у запечаћеним контејнерима како би се спречила влага и рансидитет. Правилно чување значајно продужава рок трајања.",
        children: [
          {
            id: 30.21,
            topic: "Прерада",
            text: "Семе сусама се такође може обрадити у тахини или користити у разним рецептима за побољшање укуса и нутритивне вредности.",
          },
        ],
      },
      {
        id: 31.2,
        topic: "Ретко разређивање",
        text: "Ретко је потребно разређивање сусама, јер биљке треба да буду довољно удаљене како би се осигурао добар проток ваздуха и смањила конкуренција.",
      },
    ],
  },
  {
    id: 6,
    name: "Пистаћи",
    img: nutsImages.pistachios,
    inGeneralHeading: `Мали енергетски чудаци`,
    inGeneral: `Пистаћи нису само укусни, већ су и пуни здравствених бенефита, што их чини популарним избором за ужину и кулинарску употребу. Ови мали, овални ораси долазе са дрвета *Pistacia vera* и потичу из Средњег истока и Централне Азије, али се сада узгајају у различитим деловима света, укључујући и Сједињене Државе.
                    Једна од кључних предности пистаћа је њихов импресиван нутритивни профил. Богати су здравим мастима, посебно мононенасићеним мастима, које су корисне за здравље срца. Поред тога, пистаћи су добар извор протеина, влакана и есенцијалних витамина и минерала, укључујући витамин Б6, тиамин и бакар. Ови нутријенти подржавају различите функције организма, од метаболизма енергије до имунолошке функције.
                    Пистаћи такође садрже антиоксиданте као што су лутеин и зеаксантин, који су важни за здравље очију. Редовна конзумација ових ораха може помоћи у смањењу ризика од хроничних болести, укључујући болести срца и дијабетес. Њихов висок садржај влакана подржава варење и промовише осећај ситости, што их чини одличним избором за управљање тежином.
                    У кулинарској примени, пистаћи се могу уживати сами, додавати у салате или користити као додатак десертима. Такође се могу млевити у пасту од пистаћа за употребу у пецива или сладоледима.
                    Укупно, пистаћи су хранљив и свестран орах који се може уживати на различите начине, а истовремено доприносе уравнотеженој исхрани.`,
    topic1: "Нутритивни профил и здравље",
    nutritionText: [
      {
        element: "Енергетска вредност:",
        quantity: 562,
        measurementUnits: "ккал",
        description:
          "– Висококалорни орах који пружа концентрисан извор енергије.",
      },
      {
        element: "Масти:",
        quantity: 45.3,
        measurementUnits: "г",
        description:
          "– Садржи здраве масти, пре свега мононенасићене и полиненасићене масти, које су корисне за здравље срца.",
      },
      {
        element: "Засићене масне киселине:",
        quantity: 5.6,
        measurementUnits: "г",
        description:
          "– Садржи умерене нивое засићених масти, које треба конзумирати умерено.",
      },
      {
        element: "Витамин Б3 (Ниацин):",
        quantity: 1.3,
        measurementUnits: "мг",
        description:
          "– Важан за метаболизам енергије и одржавање здраве коже и нерва.",
      },
      {
        element: "Натријум:",
        quantity: 1,
        measurementUnits: "мг",
        description:
          "– Веома низак садржај натријума, што га чини здравом ужином за срце.",
      },
      {
        element: "Калијум:",
        quantity: 1025,
        measurementUnits: "мг",
        description:
          "– Одличан извор калијума, који је важан за функцију мишића и регулисање равнотеже течности.",
      },
      {
        element: "Угљени хидрати:",
        quantity: 28,
        measurementUnits: "г",
        description:
          "– Садржи умерену количину угљених хидрата, углавном из влакана.",
      },
      {
        element: "Влакна:",
        quantity: 10.6,
        measurementUnits: "г",
        description:
          "– Висок садржај дијететских влакана која подржавају здравље варења и помажу у одржавању осећаја ситости.",
      },
      {
        element: "Шећери:",
        quantity: 7.7,
        measurementUnits: "г",
        description: "– Садржи природне шећере који дају благ осећај слаткоће.",
      },
      {
        element: "Протеини:",
        quantity: 20.6,
        measurementUnits: "г",
        description:
          "– Добар извор биљних протеина, важан за поправку и одржавање мишића.",
      },
      {
        element: "Витамин Ц:",
        quantity: 5.6,
        measurementUnits: "мг",
        description:
          "– Садржи мале количине витамина Ц који подржавају имунолошко здравље.",
      },
      {
        element: "Калцијум:",
        quantity: 105,
        measurementUnits: "мг",
        description:
          "– Пружа одређену количину калцијума који доприноси здрављу костију.",
      },
      {
        element: "Гвожђе:",
        quantity: 4.0,
        measurementUnits: "мг",
        description:
          "– Садржи гвожђе, које је важно за транспорт кисеоника у крви.",
      },
      {
        element: "Витамин Б1 (Тиамин):",
        quantity: 0.9,
        measurementUnits: "мг",
        description: "– Подржава метаболизам енергије и нервни систем.",
      },
      {
        element: "Витамин Б6:",
        quantity: 1.7,
        measurementUnits: "мг",
        description:
          "– Учествује у метаболизму амино киселина и когнитивној функцији.",
      },
      {
        element: "Витамин Б2 (Рибофлавин):",
        quantity: 0.2,
        measurementUnits: "мг",
        description: "– Има улогу у производњи енергије и здрављу коже.",
      },
      {
        element: "Магнезијум:",
        quantity: 121,
        measurementUnits: "мг",
        description:
          "– Добар извор магнезијума, који је важан за функцију мишића и нерва.",
      },
      {
        element: "Цинк:",
        quantity: 2.3,
        measurementUnits: "мг",
        description:
          "– Садржи цинк који подржава имунолошку функцију и зацељивање рана.",
      },
      {
        element: "Витамин Е:",
        quantity: 2.3,
        measurementUnits: "мг",
        description:
          "– Садржи витамин Е, антиоксиданс који помаже у заштити ћелија од оштећења.",
      },
      {
        element: "Витамин А:",
        quantity: 0,
        measurementUnits: "IU",
        description: "– Пистаћи нису значајан извор витамина А.",
      },
    ],
    cultivationHeading:
      "Култивација пистаћа захтева специфичне услове за оптималан раст и производњу ораха. Ево прегледа кључних фактора који су укључени у гајење пистаћа:",
    cultivation: [
      {
        id: 21,
        topic: "Клима",
        children: [
          {
            id: 211,
            topic: "Температура",
            text: "Пистаћи успевају у топлим, сувим климама. Захтевају температурни опсег од 20°C до 30°C (68°F до 86°F) за оптималан раст, са жарким летима и хладним зимама потребним за зимски мировање.",
          },
          {
            id: 212,
            topic: "Часови хлађења",
            text: "Дрвеће пистаћа треба око 600 до 1.000 часова хлађења (часови испод 7°C или 45°F) током зиме како би се осигурао правилан развој пупољака и сетва плода.",
          },
          {
            id: 213,
            topic: "Падавине",
            text: "Пистаћи захтевају добро распоређене падавине од 300 до 500 мм (12 до 20 инча) годишње, углавном током растне сезоне. Отпорни су на сушу, али боље раде уз адекватну влагу.",
          },
        ],
      },
      {
        id: 22,
        topic: "Тло",
        children: [
          {
            id: 221,
            topic: "пХ",
            text: "Пистаћи воле благо алкална тла са пХ опсегом од 7.0 до 8.0.",
          },
          {
            id: 222,
            topic: "Тип тла",
            text: "Идеална тла за гајење пистаћа су добро дренирана песковита или лозовита тла. Лоше дренирана тла могу довести до труљења корена, па је добра дренажа кључна.",
          },
          {
            id: 223,
            topic: "Припрема тла",
            text: "Пре садње, тло треба да се ора и помеша са органским материјалом како би се побољшала плодност и дренажа.",
          },
        ],
      },
      {
        id: 23,
        topic: "Врсте",
        text: "Популарне врсте пистаћа укључују: -Керман- (најшире гајен и познат по високом квалитету). -Петерс- (висок принос и добар квалитет). -Еарли Бадами- (познат по раном сазревању).",
      },
      {
        id: 24,
        topic: "Садња",
        children: [
          {
            id: 241,
            topic: "Време",
            text: "Најбоље време за садњу дрвећа пистаћа је у рано пролеће, након што прође опасност од мраза.",
          },
          {
            id: 242,
            topic: "Размак",
            text: "Дрвеће треба да буде размакнуто око 6 до 8 метара (20 до 26 стопа) како би имало довољно сунчеве светлости и протока ваздуха.",
          },
          {
            id: 243,
            topic: "Опрашивање",
            text: "Пистаћи су двдомаци, што значи да имају одвојена мушка и женска дрвећа. Најмање једно мушко дрво треба да буде посађено на сваких 8 до 10 женских дрвећа како би се осигурило правилно опрашивање.",
          },
        ],
      },
      {
        id: 25,
        topic: "Заливање",
        children: [
          {
            id: 251,
            topic: "Фаза успостављања",
            text: "Дрвеће пистаћа треба редовно заливање током првих неколико година након садње како би се успоставили снажни корени.",
          },
          {
            id: 252,
            topic: "Остала дрвећа",
            text: "Када се успоставе, треба их залијевати дубоко, али ретко. Пистаћи захтевају око 500 до 700 мм (20 до 28 инча) воде годишње.",
          },
          {
            id: 253,
            topic: "Избегавати преозаливање",
            text: "Водозагушење може довести до болести корена, па је важно осигурати добру дренажу.",
          },
        ],
      },
      {
        id: 26,
        topic: "Ђубрење",
        children: [
          {
            id: 261,
            topic: "Нутријенти",
            text: "Пистаћи имају користи од редовног ђубрења, посебно са азотом, фосфором и калијумом. Тестови тла могу помоћи да се утврде специфичне потребе за нутријентима.",
          },
          {
            id: 262,
            topic: "Време",
            text: "Ђубрива треба применити у рано пролеће пре него што започне нови раст и могу се поново применити током растне сезоне.",
          },
        ],
      },
      {
        id: 27,
        topic: "Контрола штеточина и болести",
        children: [
          {
            id: 271,
            topic: "Штеточине",
            text: "Чести штеточини који нападају пистаће укључују апхиде, паукове гриње и орахове бубе. Практика интегрисаног управљања штеточинама (IPM), као што је коришћење корисних инсеката и пестицида, може помоћи у контроли ових штеточина.",
          },
          {
            id: 272,
            topic: "Болести",
            text: "Пистаћи могу бити подложни болестима као што су ботритис и труљење корена. Правилне културне праксе, као што су одржавање доброг протока ваздуха и дренажа тла, могу помоћи у управљању овим проблемима.",
          },
        ],
      },
      {
        id: 28,
        topic: "Жетва",
        children: [
          {
            id: 281,
            topic: "Време",
            text: "Пистаћи се обично беру од касног лета до ране јесени, око 7 до 8 месеци након цветања.",
          },
          {
            id: 282,
            topic: "Знаци зрености",
            text: "Зрели пистаћи ће се мало отворити и могу се убрати када почну да мењају боју из зелене у сиву.",
          },
          {
            id: 283,
            topic: "Метода",
            text: "Ораси се могу убирати механички или ручно. Ако се користи механизација, осигурајте да је подешена исправно како би се спречила оштећења ораха.",
          },
        ],
      },
      {
        id: 30.2,
        topic: "Чување",
        text: "Ораси пистаћа треба да се чувају на хладном и сувом месту како би се одржала свежина. Могу се чувати у затвореним посудама како би се спречила влажност и кварљивост.",
        children: [
          {
            id: 30.21,
            topic: "Презервација",
            text: "Пистаћи се такође могу пећи или солити за бољи укус и дужи рок трајања.",
          },
        ],
      },
      {
        id: 31.2,
        topic: "Проређивање",
        text: "Проређивање може бити потребно код младих дрвећа како би се осигурао правилан развој плода. Смањивање броја ораха по кластеру може помоћи у побољшању општег квалитета.",
      },
    ],
  },
  {
    id: 7,
    name: "Сунцокрет семе",
    img: nutsImages.sunflowerSeeds,
    inGeneralHeading: `Семе пуно хранљивих састојака са окусом ораха`,
    inGeneral: `Семе сунцокрета, добијено од биљке сунцокрета (Helianthus annuus), мале је, сивкасто-црне боје, са благим окусом ораха и хрскавом текстуром. Ова семена су постала популарна због свог изузетног нутритивног профила и свестраности као ужина и састојак у разним кулинарским применама. 
            Једна од главних особина семена сунцокрета је висок садржај здравих масти, углавном полинезасићених и мононезасићених масти. Ове масти помажу у смањењу лошег холестерола (LDL), чиме доприносе здрављу срца. Семена сунцокрета су такође изванредан извор биљних протеина, са око 5.5 грама протеина по порцији од 30 грама, што их чини одличним избором за вегетаријанце, вегане и оне који желе да повећају унос протеина у својој исхрани. 
            Један од кључних витамина који се налази у семену сунцокрета је витамин Е, моћан антиоксиданс који помаже у заштити ћелија од оштећења узрокованих слободним радикалима и подржава здравље коже. Заправо, једна унца семена сунцокрета обезбеђује преко 80% дневног препорученог уноса витамина Е. Семена такође садрже витамине Б комплекса, посебно фолну киселину и ниацин, који су важни за метаболизам енергије и синтезу ДНК. 
            Поред витамина, семена сунцокрета су пуна есенцијалних минерала као што су магнезијум, селен и бакар. Магнезијум је виталан за функционисање мишића и нерва, док селен делује као антиоксиданс и подржава имунски систем. Бакар помаже у производњи црвених крвних зрнаца и одржавању здравог везивног ткива. 
            Семена сунцокрета су такође добар извор дијеталних влакана, која помажу дигестији и регулишу ниво шећера у крви. Могу се конзумирати сирово, печени или се користе као хрскави топинг за салате, житарице и јогурт. Бутер од семена сунцокрета је популарна алтернатива традиционалним путерима од ораха, нудећи кремасту и хранљиву намазу.`,
    topic1: "Хранљивост и здравље",
    nutritionText: [
      {
        element: "Енергетска вредност:",
        quantity: 584,
        measurementUnits: "ккал",
        description: "– Висока калоричност, пружа концентрисан извор енергије.",
      },
      {
        element: "Масти:",
        quantity: 51.5,
        measurementUnits: "г",
        description:
          "– Богата здравим мастима, посебно полинезасићеним мастима.",
      },
      {
        element: "Засићене масне киселине:",
        quantity: 4.5,
        measurementUnits: "г",
        description: "– Садржи умерену количину засићених масти.",
      },
      {
        element: "Витамин Е:",
        quantity: 35.17,
        measurementUnits: "мг",
        description:
          "– Изванредан извор витамина Е, који делује као антиоксиданс.",
      },
      {
        element: "Натријум:",
        quantity: 2,
        measurementUnits: "мг",
        description:
          "– Веома низак садржај натријума, користан за здравље срца.",
      },
      {
        element: "Калијум:",
        quantity: 645,
        measurementUnits: "мг",
        description:
          "– Добар извор калијума, који је важан за функционисање мишића и равнотежу течности.",
      },
      {
        element: "Угљени хидрати:",
        quantity: 20,
        measurementUnits: "г",
        description: "– Садржи угљене хидрате, који пружају извор енергије.",
      },
      {
        element: "Влакна:",
        quantity: 8.6,
        measurementUnits: "г",
        description:
          "– Богат извор дијеталних влакана, који побољшавају дигестију.",
      },
      {
        element: "Шећер:",
        quantity: 2.6,
        measurementUnits: "г",
        description: "– Садржи минималне природне шећере.",
      },
      {
        element: "Протеини:",
        quantity: 20.8,
        measurementUnits: "г",
        description:
          "– Добар извор биљних протеина, користан за обнову мишића.",
      },
      {
        element: "Калцијум:",
        quantity: 78,
        measurementUnits: "мг",
        description:
          "– Обезбеђује малу количину калцијума, који доприноси здрављу костију.",
      },
      {
        element: "Гвожђе:",
        quantity: 5.0,
        measurementUnits: "мг",
        description:
          "– Садржи гвожђе, које је важно за здраву производњу црвених крвних зрнаца.",
      },
      {
        element: "Магнезијум:",
        quantity: 325,
        measurementUnits: "мг",
        description:
          "– Богат магнезијумом, који је важан за функционисање мишића и производњу енергије.",
      },
      {
        element: "Цинк:",
        quantity: 5.0,
        measurementUnits: "мг",
        description: "– Добар извор цинка, који подржава имунски систем.",
      },
      {
        element: "Витамин Б1 (Тиамин):",
        quantity: 1.48,
        measurementUnits: "мг",
        description: "– Подржава метаболизам енергије.",
      },
      {
        element: "Витамин Б2 (Рибофлавин):",
        quantity: 0.35,
        measurementUnits: "мг",
        description:
          "– Важан за производњу енергије и укупно метаболичко здравље.",
      },
      {
        element: "Витамин Б3 (Нијацин):",
        quantity: 8.3,
        measurementUnits: "мг",
        description: "– Подржава метаболизам и здравље коже.",
      },
      {
        element: "Витамин Б6:",
        quantity: 1.35,
        measurementUnits: "мг",
        description: "– Важан за метаболизам протеина и здравље мозга.",
      },
    ],
    cultivationHeading:
      "Узгајање семена сунцокрета захтева специфичне услове за оптималан раст и производњу семена. Ево прегледа кључних фактора који су укључени у узгој сунцокрета:",
    cultivation: [
      {
        id: 21,
        topic: "Клима",
        children: [
          {
            id: 211,
            topic: "Температура",
            text: "Сунцокрети напредују у топлим климатским условима и захтевају температурни опсег од 20°C до 30°C (68°F до 86°F) за оптималан раст. Осетљиви су на мраз и треба их садити након последњег мраза.",
          },
          {
            id: 212,
            topic: "Сунчева светлост",
            text: "Сунцокрети имају потребу за пуним сунцем, захтевају најмање 6 до 8 сати директне сунчеве светлости дневно за оптимално цветање и развој семена.",
          },
        ],
      },
      {
        id: 22,
        topic: "Тло",
        children: [
          {
            id: 221,
            topic: "pH",
            text: "Сунцокрети преферирају благо кисело до неутрално тло са pH опсегом од 6.0 до 7.5.",
          },
          {
            id: 222,
            topic: "Тип тла",
            text: "Идеално за узгој сунцокрета су добро дренирана, лојна или песковита тла. Неће добро расти на тешким глиненим тлима која задржавају влагу.",
          },
          {
            id: 223,
            topic: "Припрема тла",
            text: "Пре садње, тло треба обрадити и побољшати органским материјама како би се побољшала плодност и дренажа.",
          },
        ],
      },
      {
        id: 23,
        topic: "Врсте",
        text: "Популарне врсте сунцокрета укључују: - High Oleic - (за производњу уља). - Confectionery - (за снацк семена). - Хибридне врсте - (побољшане за веће приносе и отпорност на болести).",
      },
      {
        id: 24,
        topic: "Садња",
        children: [
          {
            id: 241,
            topic: "Време",
            text: "Сунцокрети се обично саде у пролеће, када температура тла достигне најмање 10°C (50°F).",
          },
          {
            id: 242,
            topic: "Дубина и размак",
            text: "Семена треба садити на дубину од 2 до 5 цм (0.8 до 2 инча). За оптималан раст, семена треба садити 30 до 45 цм (12 до 18 инча) једно од другог у редовима који су удаљени 75 до 100 цм (30 до 40 инча).",
          },
          {
            id: 243,
            topic: "Број семена",
            text: "Препоручени број семена је 40.000 до 60.000 семена по хектару (16.000 до 24.000 семена по акру) за оптималан принос.",
          },
        ],
      },
      {
        id: 25,
        topic: "Заливање",
        children: [
          {
            id: 251,
            topic: "Фаза успостављања",
            text: "Семена сунцокрета захтевају адекватну влагу током клијања и успостављања. Регуларно заливање је важно у првим недељама након садње.",
          },
          {
            id: 252,
            topic: "Зреле биљке",
            text: "Након успостављања, сунцокрети су отпорни на сушу али користе око 25 до 50 мм (1 до 2 инча) воде недељно током сезоне раста, посебно током цветања.",
          },
          {
            id: 253,
            topic: "Избегавање задржавања воде",
            text: "Сунцокрети не толеришу услове где тло остаје поплављено. Обезбедите добру дренажу како бисте спречили труљење корена.",
          },
        ],
      },
      {
        id: 26,
        topic: "Ђубрење",
        children: [
          {
            id: 261,
            topic: "Нутријенти",
            text: "Сунцокрети захтевају азот, фосфор и калијум за здрав раст. Балансирано ђубриво може се применити да би се задовољиле ове потребе.",
          },
          {
            id: 262,
            topic: "Време",
            text: "Ђубриво треба примењивати при садњи и током раних фаза раста како би се подржао снажан развој.",
          },
        ],
      },
      {
        id: 27,
        topic: "Контрола штеточина и болести",
        children: [
          {
            id: 271,
            topic: "Штеточине",
            text: "Уобичајене штеточине које погађају сунцокрете укључују: афиде, бубе сунцокрета и жичаре. Интегрисано управљање штеточинама (IPM) може помоћи у контроли популација штеточина.",
          },
          {
            id: 272,
            topic: "Болести",
            text: "Сунцокрети су подложни болестима као што су downy mildew, sclerotinia, и rust. Ротација усева, отпорне врсте и исправно управљање пољем могу помоћи у контролисању ових болести.",
          },
        ],
      },
      {
        id: 28,
        topic: "Жетва",
        children: [
          {
            id: 281,
            topic: "Време",
            text: "Сунцокрети су обично спремни за жетву касног лета до ране јесени, око 70 до 100 дана након садње, када се задња страна главица постане жута.",
          },
          {
            id: 282,
            topic: "Знакови зрелости",
            text: "Семена треба да буду тврда, а љуска треба да има тамну боју. Влажност семена треба да буде око 10 до 12% при жетви.",
          },
          {
            id: 283,
            topic: "Метода",
            text: "Жетва се може обавити коришћењем комбинованог жетвеног машина. Потребно је пазити да се семена не оштете током процеса.",
          },
        ],
      },
      {
        id: 30.2,
        topic: "Складиштење",
        text: "Семена сунцокрета треба чувати на хладном и сувом месту како би се спречило квариње. Право складиштење може значајно продужити рок трајања.",
        children: [
          {
            id: 30.21,
            topic: "Очување",
            text: "Семена сунцокрета такође могу бити печени или сољена за побољшани укус и дужи рок трајања.",
          },
        ],
      },
      {
        id: 31.2,
        topic: "Проређивање",
        text: "Тенденција за проређивањем није обавезна, али ако су саднице превише густи, могу се проредити ради бољег раста и развоја семена.",
      },
    ],
  },
  {
    id: 8,
    name: "Чиа семенке",
    img: nutsImages.chiaSeeds,
    inGeneralHeading: `Мала семенке са огромним нутритивним предностима`,
    inGeneral: `Чиа семенке (Salvia hispanica) су мале, овалне семенке које могу бити црне, беле или сиве боје. Упркос својој малој величини, оне су права нутритивна снага, стечивши репутацију "суперхране" због свог импресивног нутритивног профила. Оригинално су гајене од стране Азтека и Маја у древним временима, чиа семенке су данас веома популарне у савременим дијетама због својих здравствених предности и свестраности.
                  Једна од најзначајнијих карактеристика чиа семенки је висок садржај омега-3 масних киселина. Ове есенцијалне масне киселине су кључне за здравље срца, смањење упала и подршку функцији мозга. У ствари, чиа семенке су један од најбогатијих биљних извора омега-3 масних киселина, посебно алфа-линоленске киселине (ALA).
                  Чиа семенке су такође одличан извор дијеталних влакана, са око 10 грама влакана на порцију од 28 грама. Овај висок садржај влакана подржава варење, промовише осећај ситости и помаже у регулисању нивоа шећера у крви, чинећи чиа семенке корисним за управљање тежином и метаболичко здравље.
                  Поред влакана и омега-3, чиа семенке су богате биљним протеинима, пружајући око 4 грама протеина по унци. Ово их чини одличним додацима у вегетаријанске и веганске дијете. Чиа семенке су такође пуне есенцијалних минерала као што су калцијум, магнезијум и фосфор, који су важни за здравље костију и опште функционисање организма.
                  Још једна јединствена особина чиа семенки је њихова способност да апсорбују течност и формирају геласту конзистенцију, што их чини корисним у рецептима као што су пудинзи, смутији и пецива. Овај желатинозни текстура такође помаже да успори варење, што резултира постепенијим ослобађањем енергије.
                  Укратко, чиа семенке су мала, али моћна храна, која нуди широк спектар здравствених предности, од подршке срцу и варењу до здравља костију и одржавања енергије. Њихова свестраност у кухињи и нутритивна густина чине их вредним додатком свакој исхрани.`,
    topic1: "Нутритивне вредности и здравље",
    nutritionText: [
      {
        element: "Енергетска вредност:",
        quantity: 486,
        measurementUnits: "кцал",
        description:
          "– Висококалорна храна која пружа значајну енергију од здравих масти, протеина и угљених хидрата.",
      },
      {
        element: "Масти:",
        quantity: 30.7,
        measurementUnits: "г",
        description:
          "– Садржи здраве масти, углавном омега-3 масне киселине које су корисне за здравље срца.",
      },
      {
        element: "Засићене масне киселине:",
        quantity: 3.3,
        measurementUnits: "г",
        description:
          "– Садржи ниске нивое засићених масти који подржавају опште здравље срца.",
      },
      {
        element: "Витамин Б3 (Нијасин):",
        quantity: 8.8,
        measurementUnits: "мг",
        description:
          "– Важан за метаболизам енергије и одржавање здраве коже и нерва.",
      },
      {
        element: "Натријум:",
        quantity: 16,
        measurementUnits: "мг",
        description:
          "– Веома низак садржај натријума, што чини овај производ здравим избором за срце.",
      },
      {
        element: "Калијум:",
        quantity: 407,
        measurementUnits: "мг",
        description:
          "– Добар извор калијума, који је есенцијалан за функцију мишића и баланс течности.",
      },
      {
        element: "Угљени хидрати:",
        quantity: 42.1,
        measurementUnits: "г",
        description:
          "– Садржи умерену количину угљених хидрата, углавном из дијеталних влакана.",
      },
      {
        element: "Влакна:",
        quantity: 34.4,
        measurementUnits: "г",
        description:
          "– Изузетно високо у дијеталним влакнима, која подржавају здравље варења и промовишу ситост.",
      },
      {
        element: "Шећер:",
        quantity: 0.5,
        measurementUnits: "г",
        description:
          "– Садржи минималне природне шећере, чинећи ову храну ниско-шећерном.",
      },
      {
        element: "Протеини:",
        quantity: 16.5,
        measurementUnits: "г",
        description:
          "– Добар извор биљних протеина, који су важни за поправку и одржавање мишића.",
      },
      {
        element: "Витамин Ц:",
        quantity: 1.6,
        measurementUnits: "мг",
        description:
          "– Садржи мале количине витамина Ц, који подржава здравље имунолошког система.",
      },
      {
        element: "Калцијум:",
        quantity: 631,
        measurementUnits: "мг",
        description:
          "– Одличан извор калцијума, који је кључан за здравље костију.",
      },
      {
        element: "Гвожђе:",
        quantity: 7.7,
        measurementUnits: "мг",
        description:
          "– Садржи гвожђе, које је неопходно за производњу здравих црвених крвних зрнаца.",
      },
      {
        element: "Витамин Б1 (Тиамин):",
        quantity: 0.6,
        measurementUnits: "мг",
        description:
          "– Подржава метаболизам енергије претварањем угљених хидрата у енергију.",
      },
      {
        element: "Витамин Б6:",
        quantity: 0.1,
        measurementUnits: "мг",
        description:
          "– Учествује у метаболизму аминокиселина и когнитивној функцији.",
      },
      {
        element: "Витамин Б2 (Рибофлавин):",
        quantity: 0.2,
        measurementUnits: "мг",
        description: "– Има улогу у производњи енергије и здрављу коже.",
      },
      {
        element: "Магнезијум:",
        quantity: 335,
        measurementUnits: "мг",
        description:
          "– Одличан извор магнезијума, који је есенцијалан за функцију мишића и нерва.",
      },
      {
        element: "Цинк:",
        quantity: 4.6,
        measurementUnits: "мг",
        description:
          "– Садржи цинк, који подржава имунолошки систем и зацељивање рана.",
      },
      {
        element: "Витамин Е:",
        quantity: 0.5,
        measurementUnits: "мг",
        description:
          "– Садржи мале количине витамина Е, антиоксиданта који помаже у заштити ћелија од оштећења.",
      },
      {
        element: "Витамин А:",
        quantity: 0,
        measurementUnits: "IU",
        description: "– Чиа семенке нису значајан извор витамина А.",
      },
    ],
    cultivationHeading:
      "Узгој чиа семенки захтева специфичне услове за оптималан раст и производњу семена. Ево прегледа кључних фактора који су важни за узгој чиа семенки:",
    cultivation: [
      {
        id: 21,
        topic: "Клима",
        children: [
          {
            id: 211,
            topic: "Температура",
            text: "Чиа биљке најбоље расту у топлим климама, преферирајући температуре између 20°C и 30°C (68°F до 86°F). Веома су осетљиве на мраз и треба их посадити након последњег мраза.",
          },
          {
            id: 212,
            topic: "Светлост",
            text: "Чиа биљке захтевају пуну сунчеву светлост и треба им најмање 6 до 8 сати директне сунчеве светлости дневно за оптималан раст и развој семена.",
          },
        ],
      },
      {
        id: 22,
        topic: "Тло",
        children: [
          {
            id: 221,
            topic: "pH",
            text: "Чиа најбоље расте у добро дренираном, плодној земљи са pH вредностима између 6.0 и 7.5.",
          },
          {
            id: 222,
            topic: "Тип тла",
            text: "Лоамска или песковита земља је идеална за узгој чиа семенки, јер омогућава добру дренажу. Тешка глиновита земља која задржава влагу треба бити избегавана.",
          },
          {
            id: 223,
            topic: "Припрема тла",
            text: "Пре садње, тло треба обрадити и побољшати органским материјама како би се побољшала плоднотност и дренажа.",
          },
        ],
      },
      {
        id: 23,
        topic: "Врсте",
        text: "Популарне врсте чиа семенки укључују: -Salvia hispanica- (најчешће гајена врста за чиа семенке). -Црна и бела чиа- (разликују се по боји семена, али имају сличне нутритивне профиле).",
      },
      {
        id: 24,
        topic: "Садња",
        children: [
          {
            id: 241,
            topic: "Време",
            text: "Чиа семенке се обично саде на пролеће, након последњег мраза, када температура тла достигне најмање 15°C (59°F).",
          },
          {
            id: 242,
            topic: "Дубина и растојање",
            text: "Семена треба посадити на дубину од 0.5 до 1 цм (0.2 до 0.4 инча). За оптималан раст, семена треба поставити на растојање од 15 до 20 цм (6 до 8 инча), а редове на растојање од 30 до 45 цм (12 до 18 инча).",
          },
          {
            id: 243,
            topic: "Квота семена",
            text: "Препоручује се квота семена од око 5 до 10 кг по хектару (4 до 9 фунти по акру) за оптималан принос.",
          },
        ],
      },
      {
        id: 25,
        topic: "Заливање",
        children: [
          {
            id: 251,
            topic: "Фаза успостављања",
            text: "Чиа биљке захтевају константну влагу током клијања и ране фазе успостављања. Заливање треба бити редовно, али не и прекомерно.",
          },
          {
            id: 252,
            topic: "Зреле биљке",
            text: "Након успостављања, чиа биљке су релативно отпорне на сушу. Они захтевају око 500 до 600 мм (20 до 24 инча) воде годишње, у зависности од климе и условâ тла.",
          },
          {
            id: 253,
            topic: "Избегавање задржавања воде",
            text: "Прекомерна влага може довести до труљења корена. Осигурајте добру дренажу како би се избегло задржавање воде.",
          },
        ],
      },
      {
        id: 26,
        topic: "Ђубрење",
        children: [
          {
            id: 261,
            topic: "Нутријенти",
            text: "Чиа захтева уравнотежено ђубрење са азотом, фосфором и калијумом за здрав раст. Тестирање тла може помоћи у утврђивању специфичних потреба за нутријентима.",
          },
          {
            id: 262,
            topic: "Време",
            text: "Ђубрива треба применити пре садње и током раних фаза раста како би се подстакнуо живахан развој.",
          },
        ],
      },
      {
        id: 27,
        topic: "Контрола штеточина и болести",
        children: [
          {
            id: 271,
            topic: "Штеточине",
            text: "Уобичајене штеточине које нападају чиа укључују афиде, паучине и беле мушице. Интегрисано управљање штеточинама (IPM) може помоћи у контроли ових штеточина.",
          },
          {
            id: 272,
            topic: "Болести",
            text: "Чиа може бити подложна болестима као што су долинави плесни и труљење корена. Ротација усева и добра санитарна пракса на пољу могу помоћи у управљању овим проблемима.",
          },
        ],
      },
      {
        id: 28,
        topic: "Жетва",
        children: [
          {
            id: 281,
            topic: "Време",
            text: "Чиа биљке су обично спремне за жетву 3 до 4 месеца након садње, када се цветови осуше, а главице семена постану смеђе.",
          },
          {
            id: 282,
            topic: "Знаци зрелости",
            text: "Зреле главице чиа семенки ће бити суве, а семена ће звончити када се протресу. Семена треба да имају тамну боју и чврсту текстуру.",
          },
          {
            id: 283,
            topic: "Метод",
            text: "Жетва се може обавити сечењем главица семена и остављањем да се даље суше или коришћењем комбинованих жетвених машина за већа поља.",
          },
        ],
      },
      {
        id: 30.2,
        topic: "Складиштење",
        text: "Чиа семенке треба чувати на хладном, сувом месту, далеко од директне сунчеве светлости како би се одржала њихова квалитет. Правилно чување семена може трајати неколико година.",
        children: [
          {
            id: 30.21,
            topic: "Очување",
            text: "Чиа семенке се могу млевети, натапати или додавати различитим јелима за побољшање нутритивних користи.",
          },
        ],
      },
      {
        id: 31.2,
        topic: "Проређивање",
        text: "Проређивање обично није потребно, али ако су семенке прекомерно растегнуте, могу се проређивати како би се омогућио бољи раст и производња семена.",
      },
    ],
  },
  {
    id: 9,
    name: "Ораси",
    img: nutsImages.walnuts,
    inGeneralHeading: `Мале семенке са огромним нутритивним предностима`,
    inGeneral: `Ораси (Juglans regia) су нутритивно богатe ораси познате по свом карактеристичном, борозданом изгледу и богатом, масластом укусу. Потичу из региона Централне Азије и Средоземља и уживају се већ хиљадама година због своје кулинарске свестраности и здравствених предности. Популарни су избор за ужину, печење и кување.
Једна од најистакнутијих карактеристика ораха је њихов висок садржај здравих масти, посебно полинезасићених масти, укључујући омега-3 масне киселине. Ове есенцијалне масне киселине, посебно алфа-линоленска киселина (ALA), познате су по подршци здрављу срца тако што смањују инфламаторне процесе и смањују ниво лошег холестерола (LDL). Редовна конзумација ораха повезана је са смањеним ризиком од кардиоваскуларних болести.
Поред здравих масти, ораси су одличан извор биљног протеина, пружајући око 4,3 грама протеина по унци. Такође су богати антиоксидансима, укључујући витамин Е и полифеноле, који помажу у заштити организма од оксидативног стреса и подржавају опште здравље ћелија.
Ораси су богати есенцијалним витаминима и минералима, укључујући магнезијум, фосфор и бакар, који играју виталну улогу у здрављу костију, производњи енергије и одржавању здравог метаболизма. Њихов висок садржај влакана, око 2 грама по унци, промовише здравље варења и помаже у регулисању нивоа шећера у крви.
У кулинарском смислу, ораси се могу уживати у сировом, печеном облику или као састојак у разним јелима, од салата и пецива до пестоа и десерта.
Укратко, ораси су нутритивна моћна храна, нудећи низ здравствених предности које подржавају здравље срца, функцију мозга и опште благостање. Њихов богат укус и свестраност чине их вредним додатком уравнотеженој исхрани.`,
    topic1: "Нутриција и здравље",
    nutritionText: [
      {
        element: "Енергетска вредност:",
        quantity: 654,
        measurementUnits: "ккал",
        description: "– Висока калорична вредност, пружа густ извор енергије.",
      },
      {
        element: "Масти:",
        quantity: 65.2,
        measurementUnits: "г",
        description:
          "– Богатa здравим мастима, пре свега полинезасићеним мастима, укључујући омега-3 масне киселине.",
      },
      {
        element: "Засићене масне киселине:",
        quantity: 6.1,
        measurementUnits: "г",
        description: "– Садржи умерену количину засићених масти.",
      },
      {
        element: "Витамин Е:",
        quantity: 0.7,
        measurementUnits: "мг",
        description:
          "– Садржи мале количине витамина Е, који делује као антиоксиданс.",
      },
      {
        element: "Натријум:",
        quantity: 2,
        measurementUnits: "мг",
        description:
          "– Врло низак садржај натријума, користан за здравље срца.",
      },
      {
        element: "Калијум:",
        quantity: 441,
        measurementUnits: "мг",
        description:
          "– Добар извор калијума, који је есенцијалан за функцију мишића и баланс течности.",
      },
      {
        element: "Угљени хидрати:",
        quantity: 13.7,
        measurementUnits: "г",
        description: "– Садржи угљене хидрате, који пружају енергију.",
      },
      {
        element: "Влакна:",
        quantity: 6.7,
        measurementUnits: "г",
        description:
          "– Богатa дијеталним влакнима, која промовишу здраво варење.",
      },
      {
        element: "Шећер:",
        quantity: 2.6,
        measurementUnits: "г",
        description: "– Садржи минималне природне шећере.",
      },
      {
        element: "Протеини:",
        quantity: 15.2,
        measurementUnits: "г",
        description:
          "– Добар извор биљног протеина, користан за поправку мишића.",
      },
      {
        element: "Калцијум:",
        quantity: 98,
        measurementUnits: "мг",
        description:
          "– Пружа малу количину калцијума, који доприноси здрављу костију.",
      },
      {
        element: "Гвожђе:",
        quantity: 2.9,
        measurementUnits: "мг",
        description:
          "– Садржи гвожђе, есенцијално за производњу здравих црвених крвних зрнаца.",
      },
      {
        element: "Магнезијум:",
        quantity: 158,
        measurementUnits: "мг",
        description:
          "– Богат магнезијумом, који је важан за функцију мишића и производњу енергије.",
      },
      {
        element: "Цинк:",
        quantity: 3.1,
        measurementUnits: "мг",
        description: "– Добар извор цинка, који подржава имунски систем.",
      },
      {
        element: "Витамин Б1 (Тиамин):",
        quantity: 0.3,
        measurementUnits: "мг",
        description: "– Подржава метаболизам енергије.",
      },
      {
        element: "Витамин Б2 (Рибофлавин):",
        quantity: 0.15,
        measurementUnits: "мг",
        description:
          "– Важан за производњу енергије и опште здравље метаболизма.",
      },
      {
        element: "Витамин Б3 (Никотинска киселина):",
        quantity: 1.1,
        measurementUnits: "мг",
        description: "– Подржава метаболизам и здравље коже.",
      },
      {
        element: "Витамин Б6:",
        quantity: 0.5,
        measurementUnits: "мг",
        description: "– Важан за метаболизам протеина и здравље мозга.",
      },
    ],
    cultivationHeading:
      "Узгој ораха захтева специфичне услове за оптималан раст и производњу ораха. Ево прегледа кључних фактора који су укључени у узгој ораха:",
    cultivation: [
      {
        id: 21,
        topic: "Клима",
        children: [
          {
            id: 211,
            topic: "Температура",
            text: "Ораси најбоље расту у умереним климатским условима са широким опсегом температура. Потребна им је хладна зима за индукцију зимског спавања и растни период са температурама између 20°C и 30°C (68°F до 86°F) за оптималан развој ораха.",
          },
          {
            id: 212,
            topic: "Осећљивост на мраз",
            text: "Дрвеће ораха је осетљиво на касни пролећни мраз који може оштетити цветове и значајно смањити принос. Важно је изабрати сорте отпорне на мраз ако се узгајају у регионима са касним мразевима.",
          },
        ],
      },
      {
        id: 22,
        topic: "Тло",
        children: [
          {
            id: 221,
            topic: "pH",
            text: "Ораси преферирају благо кисела до неутрална тла, са опсегом pH од 6.0 до 7.5.",
          },
          {
            id: 222,
            topic: "Тип тла",
            text: "Најбоља тла за узгој ораха су добро дренирана лојамска или пешчана тла. Тешка глинена тла треба избегавати јер задржавају превише влаге, што може довести до труљења корена.",
          },
          {
            id: 223,
            topic: "Припрема тла",
            text: "Пре садње, тло треба обрадити и обогатити органским материјама као што је компост како би се побољшала дренажа и плодност.",
          },
        ],
      },
      {
        id: 23,
        topic: "Сорте",
        text: "Популарне сорте ораха укључују: - Енглески орах (Juglans regia) - познат по висококвалитетним орасима и прилагодљивости. - Црни орах (Juglans nigra) - ценен због свог чврстог дрвета и јединственог укуса.",
      },
      {
        id: 24,
        topic: "Садња",
        children: [
          {
            id: 241,
            topic: "Време",
            text: "Најбоље време за садњу дрвећа ораха је пролеће или јесен, када су дрвећа у стању мировања.",
          },
          {
            id: 242,
            topic: "Размак",
            text: "Дрвеће треба садити на растојању од 6 до 10 метара (20 до 33 фута) како би имало довољно сунчеве светлости и ваздушног циркулације.",
          },
          {
            id: 243,
            topic: "Опрашивање",
            text: "Већина сорти ораса је ветроопрашива. Корисно је садити више сорти како би се побољшало крстно опрашивање и повећала производња.",
          },
        ],
      },
      {
        id: 25,
        topic: "Заливање",
        children: [
          {
            id: 251,
            topic: "Фаза успостављања",
            text: "Млада дрвећа ораха захтевају редовно заливање током првих неколико година како би развила дубоке корене. Тло треба да буде стално влажно, али не и натопљено.",
          },
          {
            id: 252,
            topic: "Зрела дрвећа",
            text: "Након што се успоставе, дрвећа ораха су релативно отпорна на сушу, али ће им користити дубоко заливање током сувих периода, посебно током развоја ораха.",
          },
          {
            id: 253,
            topic: "Потребе за наводњавањем",
            text: "Ораси генерално захтевају око 700 до 1,200 мм (28 до 47 инча) воде годишње, у зависности од климе и услова тла.",
          },
        ],
      },
      {
        id: 26,
        topic: "Ђубрење",
        children: [
          {
            id: 261,
            topic: "Нутријенти",
            text: "Ораси захтевају балансиран програм ђубрења који укључује азот, фосфор и калијум како би се подстакло здраво растиње и производња ораха.",
          },
          {
            id: 262,
            topic: "Време",
            text: "Ђубрива треба применити у раном пролећу пре почетка новог раста. Тестови тла могу помоћи у одређивању специфичних потреба за хранљивим материјама.",
          },
        ],
      },
      {
        id: 27,
        topic: "Контрола штеточина и болести",
        children: [
          {
            id: 271,
            topic: "Штеточине",
            text: "Чести штеточини који погађају орасе укључују уши, моле и летећи орах. Стратегије интегрисаног управљања штеточинама (IPM) могу помоћи у контроли ових штеточина.",
          },
          {
            id: 272,
            topic: "Болести",
            text: "Ораси могу бити подложни болестима као што су орахова пегавост и труљење корена. Правилно размакнуто дрвеће, резидба за добру циркулацију ваздуха и правовремене апликације фунгицида могу помоћи у управљању овим проблемима.",
          },
        ],
      },
      {
        id: 28,
        topic: "Жетва",
        children: [
          {
            id: 281,
            topic: "Време",
            text: "Ораси се обично беру крајем лета до ране јесени, када спољне љуске почну да се распукну и ораси падају на земљу.",
          },
          {
            id: 282,
            topic: "Метод",
            text: "Жетва може да се обави ручно или помоћу механичких шокера. Треба бити опрезан да се избегне повређивање ораха током жетве.",
          },
          {
            id: 283,
            topic: "Након жетве",
            text: "Након жетве, ораси треба да се очисте и осуше како би се спречило кварење. Правилно сушење продужава рок трајања и побољшава укус.",
          },
        ],
      },
      {
        id: 30.2,
        topic: "Чување",
        text: "Ораси треба да се чувају на хладном, сувом месту како би се одржао квалитет. Исправно чувани ораси могу трајати неколико месеци до годину дана.",
        children: [
          {
            id: 30.21,
            topic: "Очување",
            text: "Ораси се такође могу обрадити у уља или путер, или се могу пећи за додатни укус.",
          },
        ],
      },
      {
        id: 31.2,
        topic: "Проређивање",
        text: "Проређивање може бити неопходно код младих дрвећа ораса како би се осигурао адекватан проток ваздуха и продор светлости, што подстиче бољи раст и квалитет ораха.",
      },
    ],
  },
  {
    id: 10,
name: "Кикирики",
img: nutsImages.peanuts,
inGeneralHeading: `Свеприсутни махунар, богат нутријентима`,
inGeneral: `Кикирики (Arachis hypogaea), често погрешно сматран орашастим плодом, заправо је махунар који расте под земљом. Пореклом из Јужне Америке, данас се узгаја широм света и цењен је због свог богатог укуса, разноврсности и бројних здравствених користи. Кикирики се конзумира у различитим облицима, укључујући цели, печени или као кикирики путер, што га чини популарном ужином и састојком у многим кухињама.
                  Једна од најзначајнијих карактеристика кикирикија је висок садржај протеина, који износи око 25-30 грама протеина на 100 грама. То га чини одличним извором биљних протеина, посебно за вегетаријанце и вегане. Кикирики такође садржи здраве масти, првенствено мононезасићене и полинезасићене масти, које могу помоћи у смањењу нивоа лошег холестерола (LDL) и подржати здравље срца.
                  Кикирики је богат есенцијалним витаминима и минералима, укључујући витамин Е, ниацин, фолат и магнезијум. Витамин Е делује као антиоксиданс, штитећи ћелије од оксидативног оштећења, док ниацин и фолат подржавају метаболизам енергије и опште здравље. Магнезијум игра кључну улогу у функцији мишића и здрављу костију.
                  Поред своје нутритивне густине, кикирики је богат дијеталним влакнима, која помажу у варењу и регулишу ниво шећера у крви. Садржај влакана такође доприноси осећају ситости, чинећи га задовољавајућом ужином.
                  Кулинарски, кикирики се може конзумирати сиров, печен или млевен у кремасти кикирики путер. Користи се у разним јелима, од салата и динстанаца до десерта и сосова, додајући укус и текстуру.
                  Укратко, кикирики је махунар богат нутријентима, који пружа бројне здравствене користи, укључујући подршку здрављу срца, протеине и влакна. Његова разноврсност и укусан укус чине га вредним додатком уравнотеженој исхрани.`,
topic1: "Исхрана и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 567,
    measurementUnits: "ккал",
    description:
      "– Храна са високом калоријском вредношћу, пружајући значајну енергију од здравих масти и протеина.",
  },
  {
    element: "Масти:",
    quantity: 49.2,
    measurementUnits: "г",
    description:
      "– Богат здравим мастима, првенствено мононезасићеним и полинезасићеним мастима, које су корисне за здравље срца.",
  },
  {
    element: "Засићене масне киселине:",
    quantity: 6.28,
    measurementUnits: "г",
    description:
      "– Садржи умерене количине засићених масти, које треба конзумирати умерено.",
  },
  {
    element: "Витамин Б3 (Ниацин):",
    quantity: 12.07,
    measurementUnits: "мг",
    description:
      "– Важан за метаболизам енергије и одржавање здраве коже и нерва.",
  },
  {
    element: "Натријум:",
    quantity: 18,
    measurementUnits: "мг",
    description:
      "– Врло мало натријума, што га чини здравим избором за срце.",
  },
  {
    element: "Калијум:",
    quantity: 705,
    measurementUnits: "мг",
    description:
      "– Добар извор калијума, који је неопходан за функцију мишића и баланс течности.",
  },
  {
    element: "Угљени хидрати:",
    quantity: 16.13,
    measurementUnits: "г",
    description:
      "– Садржи умерену количину угљених хидрата, првенствено из дијеталних влакана.",
  },
  {
    element: "Влакна:",
    quantity: 8.5,
    measurementUnits: "г",
    description:
      "– Богат дијеталним влакнима, која подржавају здраво варење и ситост.",
  },
  {
    element: "Шећери:",
    quantity: 4.72,
    measurementUnits: "г",
    description:
      "– Садржи минималне природне шећере, што доприноси ниском профилу шећера.",
  },
  {
    element: "Протеини:",
    quantity: 25.8,
    measurementUnits: "г",
    description:
      "– Одличан извор биљних протеина, користан за поправку и раст мишића.",
  },
  {
    element: "Витамин Ц:",
    quantity: 0,
    measurementUnits: "мг",
    description:
      "– Кикирики није значајан извор витамина Ц.",
  },
  {
    element: "Калцијум:",
    quantity: 92,
    measurementUnits: "мг",
    description:
      "– Садржи калцијум, који доприноси здрављу костију.",
  },
  {
    element: "Гвожђе:",
    quantity: 4.58,
    measurementUnits: "мг",
    description:
      "– Обезбеђује гвожђе, које је неопходно за производњу здравих црвених крвних зрнаца.",
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.64,
    measurementUnits: "мг",
    description:
      "– Подржава метаболизам енергије помажући у претварању угљених хидрата у енергију.",
  },
  {
    element: "Витамин Б6:",
    quantity: 0.35,
    measurementUnits: "мг",
    description:
      "– Укључен у метаболизам и синтезу неуротрансмитера.",
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.15,
    measurementUnits: "мг",
    description:
      "– Има улогу у производњи енергије и одржавању здраве коже.",
  },
  {
    element: "Магнезијум:",
    quantity: 168,
    measurementUnits: "мг",
    description:
      "– Добар извор магнезијума, који је неопходан за функцију мишића и здравље нерва.",
  },
  {
    element: "Цинк:",
    quantity: 3.27,
    measurementUnits: "мг",
    description:
      "– Садржи цинк, који подржава имунолошку функцију и зарастање рана.",
  },
  {
    element: "Витамин Е:",
    quantity: 4.93,
    measurementUnits: "мг",
    description:
      "– Добар извор витамина Е, антиоксиданса који помаже у заштити ћелија од оштећења.",
  },
  {
    element: "Витамин А:",
    quantity: 0,
    measurementUnits: "IU",
    description:
      "– Кикирики није значајан извор витамина А.",
  }
],

    cultivationHeading:
      "Узгој кикирикија захтева специфичне услове за оптималан раст и производњу ораха. Ево прегледа кључних фактора који су укључени у узгој кикирикија:",
    cultivation: [
      {
        id: 21,
        topic: "Клима",
        children: [
          {
            id: 211,
            topic: "Температура",
            text: "Кикирикији расту у топлим климатским условима, са идеалним температурама у распону од 20°C до 30°C (68°F до 86°F). Осетљиви су на мраз и захтевају сезону без мраза од најмање 120 до 150 дана.",
          },
          {
            id: 212,
            topic: "Падавине",
            text: "Кикирикији захтевају константне падавине, идеално између 500 мм и 1.200 мм (20 до 47 инча) годишње. Међутим, могу поднети кратке периоде суше током сезоне раста.",
          },
        ],
      },
      {
        id: 22,
        topic: "Тло",
        children: [
          {
            id: 221,
            topic: "pH",
            text: "Кикирикији воле благо кисела до неутрална тла, са pH вредностима у распону од 5,8 до 7,0.",
          },
          {
            id: 222,
            topic: "Тип тла",
            text: "За узгој кикирикија идеална су добро дренирана песковита или лагана лојна тла. Тешка глиновита тла треба избегавати јер задржавају превише влаге, што може довести до трулежи корена.",
          },
          {
            id: 223,
            topic: "Припрема тла",
            text: "Пре садње, тло треба орањати и обогатити органским материјама, као што је компост, ради побољшања плодности и дренаже.",
          },
        ],
      },
      {
        id: 23,
        topic: "Врсте",
        text: "Популарне врсте кикирикија укључују: -Валенсија- (позната по слатком укусу и обично се узгаја на југоистоку). -Ранер- (обично се користи за прављење путера од кикирикија). -Шпански- (мањи ораси са већим садржајем уља, често се користе у сланим ужинама).",
      },
      {
        id: 24,
        topic: "Садња",
        children: [
          {
            id: 241,
            topic: "Време",
            text: "Кикирикији треба да се саде након последњег мраза у пролеће, када температура тла достигне око 18°C (65°F).",
          },
          {
            id: 242,
            topic: "Размак",
            text: "Семе треба садити на дубину од око 2,5 до 5 см (1 до 2 инча), са размаком од 20 до 30 см (8 до 12 инча) између биљака у редовима који су размакнути 75 до 90 см (30 до 36 инча).",
          },
          {
            id: 243,
            topic: "Квалитет семена",
            text: "Користите висококвалитетно, болестима слободно семе како бисте обезбедили добар проценат клијања и здраве биљке.",
          },
        ],
      },
      {
        id: 25,
        topic: "Заливање",
        children: [
          {
            id: 251,
            topic: "Фаза успостављања",
            text: "Младе биљке кикирикија захтевају константну влагу током фазе успостављања. Редовно заливање је кључно, посебно током сухих периода.",
          },
          {
            id: 252,
            topic: "Зреле биљке",
            text: "Када се успоставе, кикирикији захтевају око 500 до 800 мм (20 до 31 инча) воде годишње. Иритација може бити потребна током сувих периода, посебно током цветања и развоја плодова.",
          },
          {
            id: 253,
            topic: "Избегавање поплављивања",
            text: "Кикирикији не толеришу поплављена тла, која могу довести до болести корена. Обезбедите добру дренажу на пољу.",
          },
        ],
      },
      {
        id: 26,
        topic: "Ђубрење",
        children: [
          {
            id: 261,
            topic: "Нутријенти",
            text: "Кикирикији имају користи од ђубрења, посебно са фосфором и калијумом. Могу фиксирати атмосферски азот, што смањује потребу за азотним ђубривима.",
          },
          {
            id: 262,
            topic: "Време",
            text: "Ђубрива треба применити при садњи и поново током раста у складу са препорукама на основу тестова тла.",
          },
        ],
      },
      {
        id: 27,
        topic: "Контрола штеточина и болести",
        children: [
          {
            id: 271,
            topic: "Штеточине",
            text: "Чести штеточини који нападају кикирикије укључују апхиде, листне скакавце и нематоде коренова. Стратегије интегрисаног управљања штеточинама (IPM) могу помоћи у контроли ових штеточина.",
          },
          {
            id: 272,
            topic: "Болести",
            text: "Кикирикији су подложни болестима као што су мрље на листовима, трулеж корена и бела муха. Ротација усева, правилно размакање и примена фунгицида могу помоћи у управљању овим проблемима.",
          },
        ],
      },
      {
        id: 28,
        topic: "Жетва",
        children: [
          {
            id: 281,
            topic: "Време",
            text: "Кикирикији су обично спремни за жетву 120 до 150 дана након садње, када листови постану жути и почну да падају.",
          },
          {
            id: 282,
            topic: "Метод",
            text: "Кикирикији се могу жетвити помоћу механичког уреда који подиже биљке са тла. Биљке треба оставити на пољу да се осуше неколико дана.",
          },
          {
            id: 283,
            topic: "Обрада након жетве",
            text: "Након жетве, кикирикији треба да се очисте, осуше и складиште на хладном и сувом месту како би се спречило кварење.",
          },
        ],
      },
      {
        id: 30.2,
        topic: "Складиштење",
        text: "Кикирикији треба да се складиште на хладном, сувом и добро проветреном месту. Правилно складиштени кикирикији могу трајати неколико месеци до годину дана без губитка квалитета.",
        children: [
          {
            id: 30.21,
            topic: "Очување",
            text: "Кикирикији се такође могу пржити, солити или прерађивати у путер од кикирикија за продужену употребу.",
          },
        ],
      },
      {
        id: 31.2,
        topic: "Проређивање",
        text: "Проређивање може бити потребно ако су биљке пренатрпане, што може довести до лоше циркулације ваздуха и повећаног ризика од болести. Оставите одговарајући размак за промоцију здравог раста.",
      },
    ],
  },
];

export default orasastiPlodovi;