
    const tekstVoca = [
        {
            id: 1,
            topic: 'Воће',
            text: 'Воће је зрела јајник цвета, која садржи семе и често је месната, чинећи га кључним делом репродуктивних циклуса многих биљака. Долази у широком спектру облика, величина и укуса, служећи као храна за људе и животиње и механизам за распростирање семена.'
        },
        {
            id: 2,
            topic: 'Ботаничко vs. кулинарско',
            text: 'У ботаници, воће се дефинише као зрела јајник цветне биљке, која често садржи семе. Међутим, у кулинарству, воће се обично односи на слатке или киселе биљне производе попут јабука или бобица, док се слани производи попут парадајза или краставаца сматрају поврћем.'
        },
        {
            id: 3,
            topic: 'Структура',
            text: 'Структура воћа обично укључује перикарп, који се дели на три слоја: егзокарп (спољашњи слој), мезокарп (средњи меснати слој) и ендокарп (унутрашњи слој који окружује семе). Варијација у овим слојевима одређује тип воћа.'
        },
        {
            id: 4,
            topic: 'Развој',
            text: 'Воће се развија из јајника цвета након оплодње. Процес укључује трансформацију зида јајника у перикарп, који штити семе и помаже у његовом распростирању. Хормонске промене у биљци играју кључну улогу у развоју воћа.'
        },
        {
            id: 5,
            topic: 'Класификација воћа',
            text: 'Воће се може класификовати на основу порекла и структуре у једноставно, збирно, вишеструко и помоћно воће.',
            children: [
                {
                    id: 501,
                    topic: 'Једноставно воће',
                    text: 'Једноставно воће се развија из једног јајника и даље се категорише на меснато воће попут коштуњавог воћа и суво воће попут махунарки или орашастих плодова.'
                },
                {
                    id: 502,
                    topic: 'Бобице',
                    text: 'Бобице су врста меснатог воћа са семенима уграђеним у пулпу, као што су грожђе, парадајз и боровнице.'
                },
                {
                    id: 503,
                    topic: 'Збирно воће',
                    text: 'Збирно воће се формира из једног цвета са више јајника, где сваки производи мало воће. Примери су малине и јагоде.'
                },
                {
                    id: 504,
                    topic: 'Вишеструко воће',
                    text: 'Вишеструко воће се развија из грозда цветова или цвасти, где се плодови спајају у једну већу структуру, попут ананаса или смокава.'
                },
                {
                    id: 505,
                    topic: 'Помоћни облици воћа',
                    text: 'Помоћно воће укључује делове цвета осим јајника у структуру воћа. Примери су јабуке и крушке, где је меснати део изведен из цветног основа.'
                }
            ]
        },
        {
            id: 6,
            topic: 'Безсемено воће',
            text: 'Безсемено воће настаје генетском модификацијом, хибридизацијом или хормонским третманима који спречавају формирање семена, чинећи га погоднијим за јело. Примери укључују безсемено грожђе и банане.'
        },
        {
            id: 7,
            topic: 'Распрашење семена',
            text: 'Воће игра кључну улогу у распрашењу семена, користећи механизме попут ветра, воде или интеракције са животињама како би проширило семе на велике удаљености за клијање.'
        },
        {
            id: 8,
            topic: 'Коришћење у исхрани',
            text: 'Воће је неопходно у људској исхрани, нудећи укус, хранљиве материје и здравствене користи. Конзумира се свеже, сушено или прерађено у сокове и конзерве.',
            children: [
                {
                    id: 801,
                    topic: 'Чување',
                    text: 'Правилно чување воћа је кључно за очување његове свежине и хранљиве вредности. Технике укључују хлађење, замрзавање и складиштење у контролисаним условима.'
                },
                {
                    id: 802,
                    topic: 'Хранљива вредност',
                    text: 'Воће је богато есенцијалним хранљивим материјама попут витамина, минерала, влакана и антиоксиданата, чинећи га основом уравнотежене исхране.'
                },
                {
                    id: 803,
                    topic: 'Безбедност хране',
                    text: 'Прање воћа пре конзумирања помаже у уклањању потенцијалних загађивача попут пестицида или бактерија, осигуравајући да је безбедно за јело.'
                },
                {
                    id: 804,
                    topic: 'Алергије',
                    text: 'Неки људи су алергични на одређено воће, што изазива реакције од благог свраба до тешке анафилаксе. Уобичајени алергени су киви и јагоде.'
                }
            ]
        },
        {
            id: 9,
            topic: 'Нехранљива употреба',
            text: 'Осим за конзумирање, воће има разне нехранљиве намене, као што су у козметици, бојама и биогоривима. На пример, уље из палминог воћа користи се у сапунима и лосионима.'
        }
    ];

export default tekstVoca;