const zitariceTekst = [
  {
    id: 1,
    topic: "Житарице",
    text:
      "Житарице су трава која се узгаја због свог јестивог зрна. Житарице су највећи усеви на свету и стога су основна храна. Они укључују пиринач, пшеницу, раж, овас, јечам, просо и кукуруз. Јестива зрна из других породица биљака, као што су хељда и киноа, су псеудожитарице. Већина житарица су једногодишње, дају један усев из сваке садње, иако се пиринач понекад узгаја као вишегодишња биљка. Зимске сорте су довољно издржљиве да се саде у јесен, зими постају мирне, а беру се у пролеће или рано лето; пролећне сорте се саде у пролеће и беру у касно лето." +
      "Житарице су припитомљене у неолиту, пре неких 8.000 година. Пшеница и јечам су припитомљени у Fertile Crescent; пиринач је одомаћен у источној Азији, а сирак и просо у западној Африци. У 20. веку, зелена револуција је значајно повећала продуктивност житарица. Ово повећање производње прати растућу међународну трговину, при чему неке земље производе велике количине житарица за друге земље." +
      "Житарице обезбеђују храну која се једе директно као цела зрна, обично кувана, или се самељу у брашно и праве хлеб, каша и други производи. Житарице имају висок садржај скроба, што им омогућава ферментацију у алкохолна пића као што је пиво. Узгој житарица има значајан утицај на животну средину и често се производи у монокултурама високог интензитета. Штете по животну средину могу се ублажити одрживим праксама које смањују утицај на земљиште и побољшавају биодиверзитет, као што су пољопривреда без обраде и међукултура.",
  },
  {
    id: 2,
    topic: "Историја",
    children: [
      {
        id: 201,
        topic: "Порекло",
        text:
        `Пшеница, јечам, раж и овас сакупљали су се и јели у Fertile Crescent током раног неолита. Зрна житарица стара 19.000 година пронађена су на локалитету Охало ИИ у Израелу, са угљенисаним остацима дивље пшенице и јечма.
        Током истог периода, фармери у Кини су почели да узгајају пиринач и просо, користећи поплаве и пожаре које су изазвали људи као део свог режима узгоја. Чини се да је употреба оплемењивача земљишта, укључујући стајњак, рибу, компост и пепео, почела рано и самостално се развила у деловима света укључујући Месопотамију, долину Нила и источну Азију.
        Житарице које су постале модерни јечам и пшеница припитомљене су пре неких 8.000 година у Fertile Crescentу. Просо и пиринач су припитомљени у источној Азији, док су сирак и друго просо припитомљени у подсахарској западној Африци, првенствено као храна за стоку.
        Сложене цивилизације су настале у којима је пољопривреда житарица стварала вишак, омогућавајући да се део жетве присвоји од фармера, дозвољавајући да се моћ концентрише у градовима.`
        },
      {
        id: 202,
        topic: "Модернo",
        text:
          `Током друге половине 20. века дошло је до значајног повећања производње житарица високог приноса широм света, посебно пшенице и пиринча, услед Зелене револуције, технолошке промене коју су финансирале развојне организације. Стратегије које је развила Зелена револуција, укључујући механизовану обраду, монокултуру, азотна ђубрива и узгој нових сојева семена, фокусиране су на спречавање гладовања и повећање приноса по биљци. Ове стратегије су биле успешне у повећању приноса, али су мање пажње посвећивале квалитету исхране. Модерне житарице високог приноса имају тенденцију да имају протеине ниског квалитета, са недостатком есенцијалних аминокиселина и недостају избалансиране есенцијалне масне киселине, витамини, минерали и други фактори квалитета. Древне сорте житарица и наслеђа су стекле популарност у органским покретима 21. века, иако су ниже у приносу по биљци, што ствара изазове у областима са ограниченим ресурсима јер се усеви за исхрану замењују новчаним усевима.`
          },
    ],
  },
  {
    id: 3,
    topic: "Биологија",
    text:
    `Житарице су траве из породице Поацеае које производе јестива зрна. Зрно житарица је ботанички кариопсис, плод у коме је омотач семена спојен са перикарпом. Траве имају шупље стабљике осим у чворовима и уске наизменичне листове у два реда. Доњи део сваког листа обухвата стабљику, формирајући лисни омотач. Лист расте из основе сечива, што је адаптација која штити растући меристем од животиња на испаши. Цветови су обично хермафродитни и углавном анемофилни или опрашују ветром, мада инсекти повремено играју улогу.
      Међу најпознатијим житарицама су кукуруз, пиринач, пшеница, јечам, сирак, просо, овас, раж и тритикале. Нека друга житарица се колоквијално називају житарицама, иако нису траве; ове псеудожитарице укључују хељду, киноју и амарант.`

  },
  {
    id: 4,
    topic: "Култивација",
    text: `Све житарице се узгајају на сличан начин. Већина је једногодишњих, па се након сетве беру само једном. Изузетак је пиринач, који иако се обично третира као једногодишња биљка, може да преживи као вишегодишња биљка, дајући плодове. Житарице прилагођене умереној клими, као што су јечам, овас, раж, пира, тритикале и пшеница, називају се житарицама за хладну сезону. Они који преферирају тропску климу, као што су просо и сирак, називају се житарицама у топлој сезони. Житарице хладне сезоне, посебно раж, а затим јечам, отпорне су и најбоље расту по прилично хладном времену. Житарице топле сезоне захтевају топло време и не могу толерисати мраз. Житарице у хладној сезони могу се узгајати у планинским пределима у тропима, где понекад дају неколико усева у једној години.`,

    children: [
      {
        id: 501,
        topic: "Садња",
        text:
        `У тропима, житарице топле сезоне могу се узгајати у било које доба године. У умереним зонама ове житарице се могу гајити само када нема мраза. Већина житарица се сади у обрађеним земљиштима, што смањује коров и разбија површину поља. Већини житарица је потребна редовна вода у раном делу свог животног циклуса. Пиринач се обично узгаја на поплављеним пољима, иако се неки сојеви узгајају на сувом. Друге житарице са топлом климом, као што је сирак, прилагођене су сушним условима.
        Житарице у хладној сезони узгајају се углавном у умереним зонама. Ове житарице често имају и озиме сорте за јесењу сетву, зимско мировање и рану летњу бербу, и пролеће сорте које се саде у пролеће и беру у касно лето. Озиме сорте имају предност да користе воду када је има у изобиљу и дозвољавају други усев након ране жетве. Цветају само у пролеће јер захтевају јаровизацију, излагање хладноћи у одређеном периоду, што је генетски условљено. Јаре усеве расту када је топлије, али мање кише, па ће им можда требати наводњавање.`
    },
      {
        id: 502,
        topic: "Раст",
        text: `Сојеви житарица се узгајају ради конзистентности и отпорности на локалне услове животне средине. Највећа ограничења у погледу приноса су биљне болести, посебно рђа (углавном Пуцциниа спп.) и пепелница. Фусаријумска гљивица, узрокована Фусариум граминеарум, представља значајно ограничење за широк спектар житарица. Други притисци укључују инсекте штеточине и дивље животиње попут глодара и јелена. У конвенционалној пољопривреди, неки фармери ће применити фунгициде или пестициде за заштиту усева.`
    },
      {
        id: 503,
        topic: "Берба",
        text: `Једногодишње житарице умиру када се семе и осуше. Берба почиње када се биљке и семе довољно осуше. У механизованим пољопривредним системима, жетва се врши комбајном, машином која сече стабљике, а затим врши вршидбу и витлање зрна. У традиционалним пољопривредним системима, углавном на глобалном југу, жетва се може обавити ручно, користећи алате као што су косе и колевке за жито. Преостали делови биљке могу да се распадну на пољу или да се сакупе као слама за разне намене, као што су постељина за животиње, малч или у занатству`
        },
      {
        id: 504,
        topic: "Претходна обрада и складиштење",
        text: `Ако житарице приликом жетве нису потпуно суве, ускладиштено зрно може бити покварено гљивама плесни као што су Аспергиллус и Пенициллиум. Ово се може спречити вештачким сушењем пре складиштења у елеватору или силосу. Складишта житарица морају бити изграђена да би се заштитила од штеточина као што су птице које једу семе и глодари.`
    },
      {
        id: 505,
        topic: "Обрада",
        text:
          `Када су житарице спремне за дистрибуцију, продају се производним погонима који прво уклањају спољне слојеве зрна пре него што га мељу у брашно или друге производе. Већина житарица се може обрађивати на различите начине, са пиринчем, на пример, производњом пиринча од целог зрна или полираног пиринча или пиринчаног брашна. Уклањање клица продужава век трајања складиштења. Нека зрна су у сладу, активирају ензиме да скроб претварају у шећере. Ови шећери се користе у индустријским производима попут алкохола или се продају директно.`
          },
    ],
  },
  {
    id: 5,
    topic: "Ефекти на животну средину",
    children: [
      {
        id: 601,
        topic: "Утицаји",
        text: `Производња житарица има значајан утицај на животну средину. Обрада земљишта може довести до ерозије земљишта и повећаног отицања. Наводњавање троши велике количине воде; његово вађење из језера, река или водоносних слојева може имати вишеструке ефекте на животну средину, као што је снижавање нивоа воде и изазивање салинације водоносних слојева. Производња ђубрива доприноси глобалном загревању, а његова употреба може довести до загађења и еутрофикације водених токова. Ратарство користи велике количине фосилних горива, ослобађајући гасове стаклене баште који доприносе глобалном загревању. Употреба пестицида може нанети штету дивљим животињама, као што су пчеле.`
        },
      {
        id: 602,
        topic: "Ублажавања",
        text:
          `Неки од утицаја узгоја житарица могу се ублажити променом производне праксе. Обрада земљишта се може смањити пољопривредом без обраде, као што је директно сејање семена житарица, или развојем и садњом вишегодишњих сорти усева тако да није потребна годишња обрада. Пиринач се може гајити као усјев, а истраживачи истражују вишегодишње житарице за хладну сезону, као што је кернза, које се развијају у САД. Употреба ђубрива и пестицида може бити смањена у неким поликултурама, где више усева расте на једном пољу. Употреба азотног ђубрива на бази фосилних горива може се смањити мешањем житарица са махунаркама које фиксирају азот. Емисије гасова стаклене баште могу се додатно смањити ефикаснијим методама наводњавања или техникама сакупљања воде као што је ископавање контурних ровова, смањујући потребу за наводњавањем.`
          },
    ],
  },
  {
    id: 6,
    topic: "Користи",
    children: [
      {
        id: 701,
        topic: "Директна потрошња",
        text: `Неке житарице као што је пиринач захтевају мало припреме пре конзумирања људи. На пример, да би се направио обичан кувани пиринач, сирови млевени пиринач се опере и кува. Храна као што су каша и мусли могу се углавном правити од целих житарица, посебно зоби, док комерцијалне житарице за доручак као што је гранола могу бити високо обрађене и комбиноване са шећерима, уљима и другим производима.`
        },
      {
        id: 702,
        topic: "Храна на бази брашна",
        text:
        `Житарице се могу самлети да би се направило брашно. Пшенично брашно је главни састојак хлеба и тестенина. Кукурузно брашно је било важно у Мезоамерици од давнина, са намирницама као што су мексичке тортиље и тамале. Ражено брашно је кључни састојак хлеба у централној и северној Европи, док се пиринчано брашно обично користи у Азији. Зрно житарица састоји се од скробног ендосперма, клица и мекиња. Брашно од интегралног брашна садржи све ово; бело брашно се прави уклањањем неких или свих клица и мекиња.`
        },
      {
        id: 703,
        topic: "Алкохол",
        text: `Пошто житарице имају висок садржај скроба, често се користе за прављење индустријског алкохола и алкохолних пића ферментацијом. На пример, пиво се производи варењем и ферментацијом скроба, углавном од зрна житарица, обично јечма у сладу. Пиринчана вина, попут јапанског сакеа, кувају се у Азији; ферментисано вино од пиринча и меда је такође направљено у древној Кини пре око 9.000 година.`
        },
      {
        id: 704,
        topic: "Храна за животиње",
        text: `Житарице и њихови нуспроизводи, као што је сено, рутински се користе као храна за животиње. Уобичајене житарице за сточну храну укључују кукуруз, јечам, пшеницу и овас. Влажна зрна се могу хемијски третирати или направити силажу, или механички спљоштити или савијати за херметичко складиштење до употребе. Такође се користи суво складиштење, обично одржавајући зрна испод садржаја влаге од 14%. Комерцијално, зрна се често комбинују са другим материјалима и формирају у пелете за храну.`
        },
    ],
  },
  {
    id: 7,
    topic: "Исхрана",
    children: [
      {
        id: 801,
        topic: "Цело зрно и прерађено",
        text: `Као интегралне житарице, житарице обезбеђују угљене хидрате, полинезасићене масти, протеине, витамине и минерале. Када се обради уклањањем мекиња и клица, остаје само скробни ендосперм. У неким земљама у развоју, житарице чине већину дневне исхране. У развијеним земљама, потрошња житарица је умерена и разнолика, али и даље значајна, првенствено у облику рафинисаних и прерађених житарица.`
        },
      {
        id: 802,
        topic: "Равнотежа аминокиселина",
        text: `Неким житарицама недостаје есенцијална аминокиселина лизин, што захтева да културе са првенствено житарицама упарују ове са махунаркама за уравнотежену исхрану. Многим махунаркама недостаје метионин, који зрна садрже, што њихову комбинацију чини нутритивно потпуном. Примери таквих комбинација укључују дал (лећа) са пиринчем у Јужној Азији, пасуљ са тортиљама од кукуруза у Латинској Америци, тофу са пиринчем и путер од кикирикија са хлебом од целог зрна пшенице.`
        },
    ],
  },
  {
    id: 8,
    topic: "Производни и трговински производи",
    text: `Житарице су међу највећом робом којом се тргује на глобалном нивоу, како по производњи тако и по међународној трговини. Због обима трговине житарицама, неке земље су постале зависне од увоза, што их чини осетљивим на цене и доступност житарица, што може утицати на безбедност хране. На пример, поремећаји као што су климатске промене или геополитички догађаји могу створити додатну несигурност у храни, као што се види са глобалном кризом цена хране 2022. године након прекида у снабдевању пшеницом услед сукоба између Русије и Украјине.`,
    children: [
      {
        id: 901,
        topic: "Производња",
        text:
          `Житарице су највећи усеви на свету по тонажи произведеног зрна. Три главне житарице — кукуруз, пшеница и пиринач — чине већину глобалне производње житарица. Овас и раж су опали од нивоа из 1960-их. Остале житарице, као што су дивљи пиринач у Северној Америци и тефф у Етиопији, такође се производе, иако у мањем обиму.`
          },
      {
        id: 902,
        topic: "Трговина",
        text: `Житарице, посебно пшеница, кукуруз и пиринач, су неке од роба којима се највише тргује широм света. Највећи извозници су Америка и Европа, док је Азија највећи увозник. САД предњаче у извозу кукуруза, док је Индија главни извозник пиринча. Житарицама се такође тргује као фјучерси на тржиштима роба како би се управљало нестабилношћу цена и ризицима повезаним са резултатима жетве.`
        },
    ],
  },
];

export default zitariceTekst;
