export const orasastiPlodoviTekst =
[
  {
    id: 1,
    topic: "Орашасти плодови и семенке",
    text: `Орашасти плодови и семенке су добри извори протеина, здравих масти, влакана, витамина и минерала, 
                регулишу телесну тежину јер се њихове масти не апсорбују у потпуности и регулишу унос хране, 
                садрже незасићене масти и друге хранљиве састојке који пружају заштитне ефекте против болести срца и дијабетеса.
                Аустралијске дијеталне смернице препоручују унос орашастих плодова од 30 грама већину дана у недељи као део здраве исхране за одрасле.`,
  },
  {
    id: 2,
    topic: "Врсте орашастих плодова и семенки",
    text: `Истраживања показују да редовно укључивање орашастих плодова у здраву исхрану помаже у регулисању тежине и може штитити од хроничних болести (као што су болести срца и дијабетес).
Иако је истраживање семенки ограничено, претпоставља се да имају сличне здравствене користи као орашасти плодови због сличног нутритивног садржаја.`,
  },
  {
    id: 3,
    topic: "Користи орашастих плодова",
    text: `Сви орашасти плодови имају веома сличан макронутријентни профил (протеини, угљени хидрати и масти), али различите врсте орашастих плодова могу имати мало различит садржај микронутријената (витамина и минерала).
                Орашасти плодови имају око 29 кЈ енергије по граму и су:
                Богати 'добрим мастима' – мононенасићеним мастима (већина врста орашастих плодова) и полиненасићеним мастима (углавном ораси).
                Ниски у засићеним мастима.
                Добри извори дијететског протеина – добра замена за животињски протеин.
                Неки орашасти плодови су такође богати амино киселином аргинином, која одржава здравље крвних судова.
                Без дијететског холестерола.
                Богати дијететским влакнима.
                Богати фитохемијалима која делују као антиоксиданси.
                Богати витаминима и минералима – витамини укључују Е, Б6, ниацин и фолну киселину, а минерали укључују магнезијум, цинк, биљно гвожђе, калцијум, бакар, селен, фосфор и калијум.`,
  },
  {
    id: 4,
    topic: "Користи семенки",
    text: `Као и орашасти плодови, већина семенки је богата:
                протеинима, здравим мастима (већа пропорција полиненасићених масти) и влакнима
                минералима (као што су магнезијум, калијум, калцијум, биљно гвожђе и цинк),
                витаминима Б1, Б2, Б3 и витамином Е.
                Масна семенке такође садрже антиоксиданте који спречавају брзо покварење масти. Ови антиоксиданти такође имају неколико здравствених користи за људско тело.
                Због нутритивне густине орашастих плодова и семенки, познато је да пружају неколико здравствених користи, као што су:
                помагање у одржавању телесне тежине
                смањење ризика од болести срца
                смањење ризика од дијабетеса.`,
  },
  {
    id: 5,
    topic: "Орашасти плодови, семенке и управљање тежином",
    text: `Иако орашасти плодови и семенке садрже много енергије и масти, конзумирање орашастих плодова није повезано са повећањем телесне тежине. Заправо, на основу великих студија популације, већи унос орашастих плодова био је повезан са нижом телесном тежином.
                Када се укључе као део дијете за мршављење, орашасти плодови су показали да побољшавају губитак тежине и смањују масти у абдоминалном региону.
                Мање масти у абдоминалном региону значи мањи ризик од хроничних болести (као што су болести срца и дијабетес). Стога, орашасти плодови треба да буду део здраве исхране.
                Аустралијске дијеталне смернице препоручују 30 грама орашастих плодова већину дана у недељи.
                Орашасти плодови помажу у управљању тежином кроз:
                Мању апсорпцију масти него што се очекује – масти у орашастим плодовима не апсорбују се у потпуности у телу. Када се мање масти апсорбују, то значи да се мање енергије из орашастих плодова апсорбује.
                Глад и ситост – орашасти плодови помажу у супресији глади. Као резултат тога, унос хране се смањује како би се компензовала енергија из орашастих плодова. Овај ефекат је резултат садржаја протеина, масти и влакана у орашастим плодовима.
                Ефекат семенки на телесну тежину није много истраживан, али је вероватно сличан ефекту орашастих плодова, јер су и она такође богата протеинима, здравим мастима и влакнима.`,
  },
  {
    id: 6,
    topic: "Орашасти плодови, семенке и ризик од болести срца",
    text: `Укључивање орашастих плодова и семенки као дела ваше исхране повезано је са нижим ризиком од болести срца.
                Иако су богати мастима, орашасти плодови и семенке су добри извори здравих масти (као што су мононенасићене и полиненасићене масти), а ниски су у засићеним мастима (нездраве масти).
                Ова комбинација 'добрих масти' чини орашасте плодове здравим за срце – помажу у смањењу нивоа нископривредног липопротеина (LDL холестерола), познатог као 'лоши' холестерол у организму.
                LDL холестерол може допринети накупљању плака (масних наслага) у артеријама, што може повећати ризик од коронарне болести срца.
                Орашасти плодови и семенке такође помажу у одржавању здравих крвних судова и крвног притиска (делом кроз свој садржај аргинина), и смањују упале у организму јер су богати антиоксидансима.`,
  },
  {
    id: 7,
    topic: "Како укључити орашасте плодове и семенке у вашу исхрану?",
    text: `Различите врсте орашастих плодова имају мало различите садржаје витамина и минерала, па ће конзумирање разних орашастих плодова повећати ниво различитих хранљивих састојака.
                С обзиром на то да орашасти плодови и семенке имају упоредив нутритивни састав и здравствене користи, размотрите семенке као замену за орашасте плодове у случају алергије на орашасте плодове (погледајте информације испод).
                Савети како да орашасти плодови и семенке постану део ваше исхране укључују:
                Уместо да грицкате бисквит или комад колача, поједите шаку сирових или суво печених орашастих плодова.
                Комбинујте орашасте плодове и семенке са храном ниске енергетске густине (као што је поврће). Ово је добар начин да обогатите јела на бази поврћа – као што су азијска јела или додавање у салату.
                Ако сте веган или вегетаријанац, орашасти плодови и семенке су добар извор протеина као замена за месо, рибу и јаја. Такође садрже масти, гвожђе, цинк и ниацин. Можда ће вам бити потребно више од 30 грама орашастих плодова и семенки дневно да бисте осигурали довољно протеина.
                Нема потребе да намачете или уклањате кожу орашастих плодова (или их 'активирате'), осим ако вам не одговарају укус и текстура натопљених орашастих плодова. У ствари, кожа орашастих плодова је богата фитохемијским супстанцама које имају антиоксидативна и антиинфламаторна својства.
                Печење орашастих плодова (или суво или у уљу) побољшава њихов укус, али има мало утицаја на садржај масти. Ово је зато што су орашасти плодови физички густи и не могу упити много уља, чак и ако су потпуно потопљени у њему. Већина орашастих плодова упије само 2% додатних масти.
                Солени орашасти плодови нису препоручљиви због већег садржаја натријума – посебно ако имате висок крвни притисак. Чувајте солене орашасте плодове за журке и правите сирове и несољене печене орашасте плодове као свакодневни избор.
                Ако не можете да поднесете чврсту текстуру орашастих плодова и семенки, размотрите њихово конзумирање у неслатким и несољеним пастама као што су путер од орашастих плодова и тахини (паста од сезама).`,
  },
  {
    id: 8,
    topic: "Упозорења о орашастим плодовима",
    text: "Будите пажљиви на ризике када конзумирате орашасте плодове.",
    children: [
      {
        id: 801,
        topic: "Орашасти плодови могу бити опасност од гушења",
        text: `Цели орашасти плодови нису погодни за децу млађу од 3 године јер могу изазвати гушење ако се не прогутају добро. Међутим, намаз од орашастих плодова или пасте (као што су путер од кикирикија или бадема, или уља од орашастих плодова и семенки) могу бити укључени у исхрану мале деце од 6 месеци.`,
      },
      {
        id: 802,
        topic: "Орашасти плодови могу изазвати алергијске реакције",
        text: `Сви орашасти плодови, кикирики и семенке могу изазвати животно опасне алергијске реакције (анафилакса) код особа са алергијама на орашасте плодове.
                        За разлику од многих других алергија где се чини да деца 'прерастају' ову алергију, алергије на кикирики остају у одраслом добу.
                        Нема лека за алергије, па ако ви или ваше дете имате алергију на орашасте плодове или семенке, избегавајте орашасте плодове, семенке и храну која их садржи све док не консултујете лекара који се специјализовао за алергије на храну (алерголога). Он ће провести медицински надгледане тестове са храном да утврди на које орашасте плодове или семенке можда имате алергију.
                        Орашасти плодови и семенке треба да се уводе у исхрану беба и мале деце у облику путера или паста, како би се избегло гушење. Не дајте целе орашасте плодове својој деци док не напуне 3 године.`,
      },
      {
        id: 803,
        topic: "Читајте етикете хране за трагове орашастих плодова и семенки",
        text: `Увек читајте етикете хране како бисте проверили да ли орашасти плодови и семенке нису присутни.
                        Будите опрезни са производима који 'могу садржати трагове орашастих плодова и/или семенки'. 'Крос-контаминација' може се десити током производње када се производи без орашастих плодова и семенки праве у истој фабрици или на истој опреми као и они који садрже орашасте плодове и семенке.`,
      },
    ],
  },
];
