import { vegetablesImages } from "./vegetablesImages";

const povrce = [
    {
        id: 1,
name: "Патлиџан",
img: vegetablesImages.aubergine,
inGeneralHeading: `Свестран и хранљив патлиџан`,
inGeneral: `Патлиџан, познат и као ауберџина, припада породици Соланум мелонгена. Са својом дубоком љубичастом кожом и сунђерастим месом, патлиџан је цењен због свог благог укуса и прилагодљивости у различитим кулинарским јелима. Било да је печен, грилован, печен у рерни или пржен, овај поврће је основни састојак многих медитеранских, блискоисточних и азијских кухиња.
Једна од најистакнутијих нутритивних карактеристика патлиџана је богатство влакнима. Шоља куваног патлиџана садржи добру количину дијеталних влакана која помажу варењу, подржавају здравље срца и помажу у одржавању стабилног нивоа шећера у крви. Упркос меснатој текстури, патлиџан је низак у калоријама, што га чини одличним избором за управљање тежином и биљну исхрану.
Патлиџан је такође добар извор антиоксиданата, нарочито насунина, флавоноида који се налази у његовој љубичастој кожи. Насунин је познат по томе што помаже у заштити ћелија од оксидативног стреса и може имати неуропротективна својства која подржавају здравље мозга. Такође, патлиџан садржи и друге антиоксиданте попут хлорогене киселине, која има противупална и антимикробна својства.
Пored влакана и антиоксиданата, патлиџан је добар извор витамина и минерала, укључујући витамине Ц и К, фолну киселину и калијум, који сви подржавају функцију имунолошког система, здравље костију и здравље срца.
Кулинарски гледано, свестраност патлиџана долази до изражаја у јелима као што су баба гануш, рататуј, мусака и патлиџан пармезан. Његова способност да упија укусе чини га савршеном базом за слана и љута јела.
У закључку, патлиџан је хранљиво богато и свестрано поврће које доноси и здравствене користи и кулинарску креативност на сто.`,
topic1: "Исхрана и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 25,
    measurementUnits: "кцал",
    description:
      "– Низак у калоријама, што га чини одличним избором за управљање тежином.",
  },
  {
    element: "Масти:",
    quantity: 0.18,
    measurementUnits: "г",
    description: "– Веома низак у мастима, са минималним количинама здравих мasti.",
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0.03,
    measurementUnits: "г",
    description:
      "– Садржи веома ниске нивое засићених масти, што подржава здравље срца.",
  },
  {
    element: "Витамин Б3 (Ниацин):",
    quantity: 0.649,
    measurementUnits: "мг",
    description:
      "– Подржава метаболизам енергије и важан је за здравље коже.",
  },
  {
    element: "Натријум:",
    quantity: 2,
    measurementUnits: "мг",
    description: "– Веома низак у натријуму, што га чини здравим избором за срце.",
  },
  {
    element: "Калијум:",
    quantity: 229,
    measurementUnits: "мг",
    description:
      "– Добар извор калијума, неопходног за одржавање равнотеже течности и правилну функцију мишића.",
  },
  {
    element: "Угљени хидрати:",
    quantity: 5.88,
    measurementUnits: "г",
    description:
      "– Низак у угљеним хидратима, углавном пружа дијетална влакна.",
  },
  {
    element: "Влакна:",
    quantity: 3,
    measurementUnits: "г",
    description:
      "– Богат извор дијеталних влакана, која подржавају здравље варења и ситост.",
  },
  {
    element: "Шећер:",
    quantity: 3.53,
    measurementUnits: "г",
    description: "– Садржи малу количину природних шећера.",
  },
  {
    element: "Протеини:",
    quantity: 0.98,
    measurementUnits: "г",
    description:
      "– Низак у протеинима у поређењу са другим поврћем, али ипак доприноси укупном уносу протеина.",
  },
  {
    element: "Витамин Ц:",
    quantity: 2.2,
    measurementUnits: "мг",
    description:
      "– Садржи неки витамин Ц, који је важан за функцију имунолошког система и здравље коже.",
  },
  {
    element: "Калцијум:",
    quantity: 9,
    measurementUnits: "мг",
    description:
      "– Пружа малу количину калцијума, који доприноси здрављу костију.",
  },
  {
    element: "Гвожђе:",
    quantity: 0.23,
    measurementUnits: "мг",
    description:
      "– Садржи малу количину гвожђа, неопходног за производњу црвених крвних зрнаца.",
  },
  {
    element: "Витамин Б1 (Тијамин):",
    quantity: 0.1,
    measurementUnits: "мг",
    description:
      "– Подржава метаболизам енергије и здравље нервног система.",
  },
  {
    element: "Витамин Б6:",
    quantity: 0.08,
    measurementUnits: "мг",
    description:
      "– Укључен је у здравље мозга и производњу неуротрансмитера.",
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.037,
    measurementUnits: "мг",
    description:
      "– Има улогу у производњи енергије и одржавању здраве коже.",
  },
  {
    element: "Магнезијум:",
    quantity: 14,
    measurementUnits: "мг",
    description:
      "– Садржи магнезијум, који је неопходан за функцију мишића и производњу енергије.",
  },
  {
    element: "Цинк:",
    quantity: 0.17,
    measurementUnits: "мг",
    description: "– Садржи минималну количину цинка, који подржава функцију имунолошког система.",
  },
  {
    element: "Витамин Е:",
    quantity: 0.3,
    measurementUnits: "мг",
    description: "– Низак у витамину Е, али присутан у малим количинама.",
  },
  {
    element: "Витамин А:",
    quantity: 0,
    measurementUnits: "ИЕ",
    description: "– Патлиџан није значајан извор витамина А.",
  },
],
cultivationHeading: "Култивација патлиџана захтева специфичне услове раста како би се постигли висококвалитетни плодови и добар принос. Овде је преглед кључних фактора који утичу на узгој патлиџана:",
cultivation: [
  {
    id: 501,
    topic: "Клима",
    children: [
      {
        id: 5011,
        topic: "Температура",
        text: "Патлиџани успешно расту у топлим климама и захтевају сталне температуре између 24°C и 30°C (75°F до 86°F) током сезоне раста. Сенситивни су на мраз и не подносе температуре испод 10°C (50°F)."
      },
      {
        id: 5012,
        topic: "Сунчева светлост",
        text: "Патлиџани захтевају пуну сунчеву светлост, са најмање 6 до 8 сати директне сунчеве светлости дневно, за оптималан раст и продукцију плода."
      }
    ]
  },
  {
    id: 502,
    topic: "Тло",
    children: [
      {
        id: 5021,
        topic: "pH",
        text: "Патлиџани преферирају благо кисело до неутрално тло, са pH опсегом од 5.5 до 7.0."
      },
      {
        id: 5022,
        topic: "Тип тла",
        text: "За узгој патлиџана најпогоднија су добро дренирана, лагана или песковита тла богата органским материјама. Тешка земљишта или подручја са воденом стагнацијом треба избегавати."
      },
      {
        id: 5023,
        topic: "Припрема тла",
        text: "Пре садње, тло треба обрадити до дубине од 25 до 30 цм (10 до 12 инча), а органске материје попут компоста или добро израђеног стајњака треба укључити како би се побољшала плодност."
      }
    ]
  },
  {
    id: 503,
    topic: "Врсте",
    text: `Популарне врсте патлиџана укључују:
    -Црна лепота (велики, овални плодови са сјајном, тамно љубичастом кором).
    -Мале прсти (мањи, танки плодови идеални за гајење у саксијама).
    -Јапански дуги (долги, цилиндрични плодови са нежним месом).`
  },
  {
    id: 504,
    topic: "Садња",
    children: [
      {
        id: 5041,
        topic: "Време",
        text: "Патлиџани се требају садити на отвореном након што прође опасност од мраза и када се тло загреје на најмање 18°C (65°F). У хладнијим климатским условима, расад се може започети унутар 6 до 8 недеља пре последњег дана мраза."
      },
      {
        id: 5042,
        topic: "Размак",
        text: "Растојание између биљака треба бити око 45 до 60 цм (18 до 24 инча), а размаци између редова 60 до 90 цм (24 до 36 инча), како би се осигурао добар проток ваздуха и простора за раст."
      },
      {
        id: 5043,
        topic: "Пресађивање",
        text: "Расад патлиџана треба постепено изложити спољним условима током недељу дана пре пресађивања у башту. Пресађивање треба обавити на облачан дан или у касним поподневним сатима како би се смањио стрес биљке."
      }
    ]
  },
  {
    id: 505,
    topic: "Заливање",
    children: [
      {
        id: 5051,
        topic: "Редовно заливање",
        text: "Патлиџани захтевају сталну влажност тла, посебно током цветања и развоја плодова. Заливајте дубоко једном или два пута недељно, обезбеђујући око 25 до 50 мм (1 до 2 инча) воде."
      },
      {
        id: 5052,
        topic: "Мулчирање",
        text: "Примена мулча око базе биљака може помоћи у очувању влаге у тлу, регулисању температуре и смањењу конкуренције од корова."
      },
      {
        id: 5053,
        topic: "Избегавајте прекомерно заливање",
        text: "Прекомерно заливање може довести до труљења корена и других гљивичних болести, па је важно осигурати добру дренажу тла и избегавати стагнацију воде."
      }
    ]
  },
  {
    id: 506,
    topic: "Ђубрење",
    children: [
      {
        id: 5061,
        topic: "Нутријенти",
        text: "Патлиџани имају користи од уравнотеженог ђубрива (нпр. 10-10-10 НПК), које се примењује приликом садње и током сезоне раста. Допунска ђубрења са компостом или органским ђубривима такође могу подстакнути здрав раст."
      },
      {
        id: 5062,
        topic: "Време",
        text: "Ђубрите приликом садње и поново када биљке почну да цветају. Избегавајте прекомерну употребу азота, који може довести до прерастања лишћа на штету продукције плодова."
      }
    ]
  },
  {
    id: 507,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 5071,
        topic: "Штеточине",
        text: "Чести штеточини укључују буве, афиде и паукове гриње. Интегрисане праксе управљања штеточинама (IPM) као што су ротација усева, покривачи редова и органски инсектициди могу помоћи у контроли ових штеточина."
      },
      {
        id: 5072,
        topic: "Болести",
        text: "Патлиџани су подложни болестима као што су вертицилијумова вила, рани пламен и прашкасти плесни. Добра циркулација ваздуха, правилно заливање и ротација усева могу смањити ризик од болести."
      }
    ]
  },
  {
    id: 508,
    topic: "Орезивање и подупирање",
    children: [
      {
        id: 5081,
        topic: "Орезивање",
        text: "Орезивање обично није потребно, али уклањање неких доњих листова и изданака може побољшати циркулацију ваздуха и усмерити енергију биљке на продукцију плодова."
      },
      {
        id: 5082,
        topic: "Подупирање",
        text: "Патлиџани могу постати тешки са плодовима и можда ће морати бити подупрти или везани како би се спречило њихово падење. Користите стубове или кавезе како бисте одржали биљке усправним."
      }
    ]
  },
  {
    id: 509,
    topic: "Берба",
    children: [
      {
        id: 5091,
        topic: "Време",
        text: "Патлиџани су обично спремни за бербу 65 до 85 дана након пресађивања, у зависности од врсте."
      },
      {
        id: 5092,
        topic: "Знакови зрелости",
        text: "Берба се врши када су плодови чврсти, сјајни и достигли своју зрелу величину. Прекомерно зрели патлиџани могу постати тврди и горки, па је важно убрати их у право време."
      },
      {
        id: 5093,
        topic: "Рукавице",
        text: "Користите оштри нож или резаче да одсечете плодове са биљке, остављајући кратак стабљику. Руке треба бити пажљиво ручно обрађене како би се избегло модрице."
      }
    ]
  },
  {
    id: 510,
    topic: "Чување",
    text: "Патлиџани се могу чувати на хладном месту (10°C до 13°C или 50°F до 55°F) до недељу дана. Избегавајте чување у фрижидеру, јер температуре испод 10°C могу оштетити плод."
  }
]
    },
    {
        id: 2,
name: "Цвекла",
img: vegetablesImages.beet,
inGeneralHeading: `Земљанo и хранљивo коренастo поврће`,
inGeneral: `Цвекле, или Бета вулгарис, су живописне коренасте поврће познате по дубокој црвеној-љубичастој боји, земљаном укусу и импресивном нутритивном профилу. Са историјом култивације која датира из давних времена, цвекле се уживају у различитим облицима — било да су печене, стиснуте или мариниране — и постале су основни састојак у многим дијетама усмереним на здравље.
Једна од кључних здравствених предности цвекле је њихова висока концентрација нитрата, који се у телу претварају у азот-оксид. Азот-оксид помаже опуштању крвних судова, побољшавајући проток крви и смањујући крвни притисак. Ова кардиоваскуларна корист чини цвекле храном корисном за срце, потенцијално смањујући ризик од срчаних болести и можданог удара.
Цвекле су такође одличан извор есенцијалних витамина и минерала, посебно фолне киселине, која је витална за раст и функцију ћелија, чинећи је посебно важном за труднице. Поред тога, цвекле пружају манган, који подржава здравље костију, и калијум, који помаже у одржавању правилне функције мишића и нерва.
У смислу антиоксиданата, цвекле су богате беталајнима, пигментима који им дају њихову живописну боју. Беталајни имају противупална и детоксикациона својства, која могу помоћи у смањењу ризика од хроничних болести и подржавају здравље јетре. Цвекле су такође високе у дијеталним влакнима, која подржавају здравље варења и регулишу ниво шећера у крви.
Кулинарски гледано, цвекле су невероватно свестране. Могу се печи за салате, блендирати у смутије или супе, или чак користити у десертима за природну слаткоћу и влагу.
У закључку, цвекле су хранљиво богато поврће са својствима која су корисна за срце и свестраним кулинарским употребама, нудећи и укус и богатство здравствених предности.`,
topic1: "Исхрана и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 43,
    measurementUnits: "кцал",
    description:
      "– Низак у калоријама, што га чини хранљивим избором за управљање тежином.",
  },
  {
    element: "Масти:",
    quantity: 0.2,
    measurementUnits: "г",
    description:
      "– Веома низак у мастима, доприносећи његовом здравом профилу.",
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0,
    measurementUnits: "г",
    description: "– Не садржи засићене масне киселине, што подржава здравље срца.",
  },
  {
    element: "Натријум:",
    quantity: 78,
    measurementUnits: "мг",
    description:
      "– Садржи малу количину натријума, који треба узети у обзир у уравнотеженој исхрани.",
  },
  {
    element: "Калијум:",
    quantity: 325,
    measurementUnits: "мг",
    description:
      "– Добар извор калијума, неопходног за функцију мишића и равнотежу течности.",
  },
  {
    element: "Угљени хидрати:",
    quantity: 9.6,
    measurementUnits: "г",
    description:
      "– Садржи природне шећере и угљене хидрате, који пружају енергију.",
  },
  {
    element: "Влакна:",
    quantity: 2.8,
    measurementUnits: "г",
    description:
      "– Добар извор дијеталних влакана, која подржавају здравље варења.",
  },
  {
    element: "Шећер:",
    quantity: 6.8,
    measurementUnits: "г",
    description:
      "– Садржи природне шећере, који доприносе њеном слатком укусу.",
  },
  {
    element: "Протеини:",
    quantity: 1.6,
    measurementUnits: "г",
    description: "– Пружа малу количину биљних протеина.",
  },
  {
    element: "Витамин Ц:",
    quantity: 4,
    measurementUnits: "мг",
    description:
      "– Садржи витамин Ц, који је важан за функцију имунолошког система и здравље коже.",
  },
  {
    element: "Калцијум:",
    quantity: 18,
    measurementUnits: "мг",
    description:
      "– Пружа малу количину калцијума, који доприноси здрављу костију.",
  },
  {
    element: "Гвожђе:",
    quantity: 0.8,
    measurementUnits: "мг",
    description:
      "– Садржи гвожђе, неопходно за здраву производњу црвених крвних зрнаца.",
  },
  {
    element: "Магнезијум:",
    quantity: 23,
    measurementUnits: "мг",
    description:
      "– Садржи мале количине магнезијума, који је важан за функцију мишића и нерва.",
  },
  {
    element: "Цинк:",
    quantity: 0.3,
    measurementUnits: "мг",
    description:
      "– Садржи трагове цинка, који подржавају функцију имунолошког система.",
  },
  {
    element: "Фолат:",
    quantity: 109,
    measurementUnits: "µг",
    description:
      "– Добар извор фолата, важан за дељенје ћелија и правилан развој плода.",
  },
  {
    element: "Витамин А:",
    quantity: 0,
    measurementUnits: "ИЕ",
    description: "– Цвекла није значајан извор витамина А.",
  },
],
cultivationHeading:
  "Култивација цвекле захтева пажљиво разматрање животних и земљишних услова како би се осигурао здрав раст и квалитетни корени. Ево прегледа кључних фактора који су укључени у узгој цвекле:",
cultivation: [
  {
    id: 501,
    topic: "Клима",
    children: [
      {
        id: 5011,
        topic: "Температура",
        text: "Цвекле најбоље расту при хладнијим температурама. Идеалне температуре су између 10°C и 24°C (50°F до 75°F). Отпорне су на мраз, посебно у раним фазама раста, али екстремна топлота може смањити квалитет корена.",
      },
      {
        id: 5012,
        topic: "Падавине",
        text: "Цвекле преферирају умерене падавине, обично између 400 и 600 мм (15 до 23 инча) годишње. Константна влажност је важна за равномерни развој корена.",
      },
    ],
  },
  {
    id: 502,
    topic: "Земљиште",
    children: [
      {
        id: 5021,
        topic: "pH",
        text: "Цвекле најбоље расту у благо киселим до неутралним земљиштима, са pH распоном од 6.0 до 7.5.",
      },
      {
        id: 5022,
        topic: "Тип земљишта",
        text: "Цвекле најбоље расту у добро дренираним, лојаним земљиштима са добрим органским садржајем. Избегавајте тешка земљишта која могу ограничити раст корена или земљишта која су натопљена водом и доводе до болести корена.",
      },
      {
        id: 5023,
        topic: "Припрема земљишта",
        text: "Земљиште треба да буде лабаво и без остатака или камења која би могла ометати раст корена. Додавање компоста или добро развијеног стајњака може побољшати плодност и структуру.",
      },
    ],
  },
  {
    id: 503,
    topic: "Варијетети",
    text: "Популарни типови цвекле укључују: - Детроит Дарк Ред - (уобичајена варијета са дубоко црвеним коренима). - Чиогија - (позната по концентричним прстеновима црвене и беле боје изнутра). - Златна цвекла - (са жутом сржом и слатким укусом).",
  },
  {
    id: 504,
    topic: "Садња",
    children: [
      {
        id: 5041,
        topic: "Време",
        text: "Цвекле се могу садити рано пролеће или касну јесен за жетву у јесен. Добро расту у хладном времену и могу издржати лагани мраз.",
      },
      {
        id: 5042,
        topic: "Дубина и растојање",
        text: "Семе цвекле треба посадити на дубину од 1 до 2 цм (0.4 до 0.8 инча). Растојање између семена треба да буде 5 до 8 цм (2 до 3 инча), са растојањем редова од 30 цм (12 инча).",
      },
      {
        id: 5043,
        topic: "Темпо сетве",
        text: "Препоручује се темпо сетве од око 2 до 4 кг по хектару (1.8 до 3.6 фунти по акру) за оптималан принос.",
      },
    ],
  },
  {
    id: 505,
    topic: "Заливање",
    children: [
      {
        id: 5051,
        topic: "Љуљани усеви",
        text: "У подручјима са константним падавинама, цвекле се могу гајити као усеви који се заливају кишом, али је важно да земљиште буде равномерно влажно како би се избегли дрвени или пукнути корени.",
      },
      {
        id: 5052,
        topic: "Иригациони усеви",
        text: "У сувљим подручјима, цвекле ће требати додатно заливање, посебно током сушних периода и фазе развоја корена.",
      },
      {
        id: 5053,
        topic: "Заливеност земљишта",
        text: "Цвекле су осетљиве на услове у којима је земљиште натопљено водом, што може изазвати труљење корена. Обезбедите добро дренирано земљиште како би се спречила стагнација воде.",
      },
    ],
  },
  {
    id: 506,
    topic: "Ђубрење",
    children: [
      {
        id: 5061,
        topic: "Нутријенти",
        text: "Цвекле захтевају уравнотежену снабдевеност азотом, фосфором и калијумом. Потребан је адекватан ниво калијума за добар развој корена и садржај шећера.",
      },
      {
        id: 5062,
        topic: "Време",
        text: "Ђубриво треба применити пре садње. Друга примена азота може се обавити током раног раста, али избегавајте претерано ђубрење, јер то може довести до прекомерног раста лишћа на рачун корена.",
      },
    ],
  },
  {
    id: 507,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 5071,
        topic: "Штеточине",
        text: "Уобичајене штеточине које погађају цвеклу укључују бува, листне минере и уши. Ротација усева, покривачи редова и биолошка контрола могу помоћи у управљању популацијама штеточина.",
      },
      {
        id: 5072,
        topic: "Болести",
        text: "Цвекле су подложне гљивичним болестима као што су долини милдев и Церцоспора листна пегавост. Коришћење отпорних сорти и правилна хигијена на терену могу смањити ризике.",
      },
    ],
  },
  {
    id: 508,
    topic: "Жетва",
    children: [
      {
        id: 5081,
        topic: "Време",
        text: "Цвекле се обично беру 50 до 70 дана након садње, у зависности од варијетета. Корени треба да буду чврсти, а њихова величина зависи од сорте и намераване употребе.",
      },
      {
        id: 5082,
        topic: "Метод",
        text: "Цвекле се беру повлачењем корена из земље. Након бербе, врхови се могу скратити, а корени треба да се складиште на хладном и влажном месту како би се спречило њихово сушење.",
      },
    ],
  },
  {
    id: 509,
    topic: "Складиштење",
    text: "Цвекле треба да се чувају на хладном, влажном месту, као што је подрум, на температури од 0°C до 4°C (32°F до 39°F) са влажношћу од 90-95%. Правилни услови складиштења могу држати цвеклу свеже неколико месеци.",
  },
  {
    id: 510,
    topic: "Проређивање",
    text: "Саднице цвекле треба проредити како би се омогућио адекватан простор за развој корена. Када саднице буду високе 5 цм (2 инча), треба их проредити на растојање од око 5 до 8 цм (2 до 3 инча) за оптималан раст.",
  },
]
    },
    {
        id: 3,
name: "Купус",
img: vegetablesImages.cabbage,
inGeneralHeading: `Моћна биљка из породице крсташица`,
inGeneral: `Купус, научно познат као Brassica oleracea, је листнато зелено, црвено или бело поврће из породице крсташица, која укључује броколи, карфиол и прокељ. Познат по хрскавој текстури и благо љутом укусу, купус је свестран састојак који се користи у разним јелима широм света - од салате до кимчија и киселог купуса.
              Једна од најистакнутијих предности купуса је висок садржај витамина Ц. Једна шоља сирог купуса пружа готово 50% дневних препоручених уноса овог есенцијалног витамина, који подржава функцију имунолошког система, здравље коже и производњу колагена. Поред тога, купус је богат витамином К, који игра кључну улогу у згрушавању крви и здрављу костију.
              Купус је такође изврстан извор влакана, која помажу у варењу, подржавају здравље црева и помажу у регулисању нивоа шећера у крви. Његов нискокалоријски садржај чини га одличним избором за контролу тежине, пружајући заситан и хранљив додатак јелима без додавања прекомерних калорија.
              Антиоксиданси који се налазе у купусу, посебно у црвеним и љубичастим сортама, укључују полифеноле и једињења која садрже сумпор као што су глукозинолати. Ова једињења имају антиинфламаторне особине и могу помоћи у заштити од одређених врста рака неутралисањем слободних радикала и подстичући детоксикацију.
              У кулинарству, купус је невероватно свестран. Може се јести сиров у салатама, ферментисати у кисели купус или кимчи, пржити, парити или користити у супама и чорбама, чинећи га основним састојком у многим кухињама.
              Укратко, купус је хранљиво богато, нискокалоријско поврће пуно витамина, влакана и антиоксиданса. Његова свестраност и здравствене користи чине га основним састојком у кухињама широм света.`,
topic1: "Исхрана и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 25,
    measurementUnits: "ккал",
    description:
      "– Низак садржај калорија, што га чини одличним избором за контролу тежине.",
  },
  {
    element: "Масти:",
    quantity: 0.1,
    measurementUnits: "г",
    description:
      "– Изузетно низак садржај масти, што доприноси његовом нискокалоријском профилу.",
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0.02,
    measurementUnits: "г",
    description:
      "– Садржи веома мале количине засићених масти, што подржава здравље срца.",
  },
  {
    element: "Витамин Б3 (Ниацин):",
    quantity: 0.215,
    measurementUnits: "мг",
    description:
      "– Подржава метаболизам енергије и помаже у одржавању здраве коже и нервног система.",
  },
  {
    element: "Натријум:",
    quantity: 18,
    measurementUnits: "мг",
    description: "– Низак у натријуму, користан за здравље срца.",
  },
  {
    element: "Калијум:",
    quantity: 316,
    measurementUnits: "мг",
    description:
      "– Добар извор калијума, који је есенцијалан за одржавање баланса течности и функцију мишића.",
  },
  {
    element: "Угљени хидрати:",
    quantity: 5.8,
    measurementUnits: "г",
    description:
      "– Низак садржај угљених хидрата, углавном пружа влакна.",
  },
  {
    element: "Влакна:",
    quantity: 2.5,
    measurementUnits: "г",
    description:
      "– Богат је влакнима која подржавају здраво варење и редовност.",
  },
  {
    element: "Шећери:",
    quantity: 3.2,
    measurementUnits: "г",
    description: "– Садржи малу количину природних шећера.",
  },
  {
    element: "Протеини:",
    quantity: 1.3,
    measurementUnits: "г",
    description: "– Садржи умерену количину протеина за поврће.",
  },
  {
    element: "Витамин Ц:",
    quantity: 36.6,
    measurementUnits: "мг",
    description:
      "– Богат је витамином Ц, који је важан за имунолошки систем и здравље коже.",
  },
  {
    element: "Калцијум:",
    quantity: 40,
    measurementUnits: "мг",
    description:
      "– Пружа малу количину калцијума, који доприноси здрављу костију.",
  },
  {
    element: "Гвожђе:",
    quantity: 0.47,
    measurementUnits: "мг",
    description:
      "– Садржи малу количину гвожђа, које је неопходно за производњу црвених крвних зрнаца.",
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.07,
    measurementUnits: "мг",
    description:
      "– Подржава метаболизам енергије и функцију нервног система.",
  },
  {
    element: "Витамин Б6:",
    quantity: 0.18,
    measurementUnits: "мг",
    description:
      "– Учествује у здрављу мозга и помаже у производњи неуротрансмитера.",
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.038,
    measurementUnits: "мг",
    description:
      "– Има улогу у производњи енергије и одржавању здраве коже.",
  },
  {
    element: "Магнезијум:",
    quantity: 12,
    measurementUnits: "мг",
    description:
      "– Садржи магнезијум, који је есенцијалан за функцију мишића и производњу енергије.",
  },
  {
    element: "Цинк:",
    quantity: 0.18,
    measurementUnits: "мг",
    description: "– Садржи минималне количине цинка, који подржава имунолошки систем.",
  },
  {
    element: "Витамин Е:",
    quantity: 0.18,
    measurementUnits: "мг",
    description: "– Садржи мале количине витамина Е, антиоксиданта.",
  },
  {
    element: "Витамин А:",
    quantity: 98,
    measurementUnits: "IU",
    description:
      "– Садржи неке витамине А, који су важни за вид и имунолошко здравље.",
  },
],
cultivationHeading: "Култивација купуса захтева одговарајуће услове како би се осигурили здрави главици и добар принос. Ево прегледа кључних фактора који утичу на узгој купуса:",

cultivation: [
  {
    id: 601,
    topic: "Клима",
    children: [
      {
        id: 6011,
        topic: "Температура",
        text: "Купус је усев хладне сезоне, најбоље расте на температурама између 15°C и 21°C (60°F до 70°F). Толерише лаган мраз, али има проблема са екстремним топлотама, што може довести до болтовања или лошег формирања главица.",
      },
      {
        id: 6012,
        topic: "Сезона",
        text: "Купус се може гајити у пролеће или јесен, избегавајући вруће летње месеце у већини региона.",
      },
    ],
  },
  {
    id: 602,
    topic: "Тло",
    children: [
      {
        id: 6021,
        topic: "pH",
        text: "Купус преферира благо кисело до неутрално тло, са pH опсегом од 6.0 до 6.8.",
      },
      {
        id: 6022,
        topic: "Тип тла",
        text: "Добро дренирана, лојна тла богата органским материјама су идеална. Тешка глинавка тла могу довести до лоше дренажe и проблема са коренима.",
      },
      {
        id: 6023,
        topic: "Припрема тла",
        text: "Пре садње, обогатите тло компостом или добро разложеним стајњаком како бисте побољшали плодност и структуру тла. Ово осигурава доступност хранљивих материја током растне сезоне.",
      },
    ],
  },
  {
    id: 603,
    topic: "Врсте",
    text: "Популарне врсте купуса укључују: -Зелени купус- (нпр. 'Golden Acre', 'Savoy'). -Црвени купус- (нпр. 'Red Drumhead'). -Напа купус- (нпр. 'Michihili', 'Wong Bok').",
  },
  {
    id: 604,
    topic: "Садња",
    children: [
      {
        id: 6041,
        topic: "Време",
        text: "Започните садњу семена купуса у затвореном 6 до 8 недеља пре последњег предвиђеног мраза, или посејте семена директно на отвореном када температура тла достигне око 10°C до 15°C (50°F до 60°F).",
      },
      {
        id: 6042,
        topic: "Размак",
        text: "Купус треба садити на размаку од 45 до 60 цм (18 до 24 инча) у редовима, са 60 до 75 цм (24 до 30 инча) између редова како би се омогућило довољно простора за формирање главица.",
      },
      {
        id: 6043,
        topic: "Пресађивање",
        text: "Пресадите саднице купуса на отворено када имају 4 до 5 правих листова и ноћне температуре су константно изнад 5°C (40°F). Постепено их излажите спољним условима пре пресађивања.",
      },
    ],
  },
  {
    id: 605,
    topic: "Заливање",
    children: [
      {
        id: 6051,
        topic: "Редовно заливање",
        text: "Купусима је потребна константна влажност, посебно током формирања главица. Заливајте дубоко једном или два пута недељно, обезбеђујући око 25 до 50 мм (1 до 2 инча) воде.",
      },
      {
        id: 6052,
        topic: "Мулчирање",
        text: "Примена мулча помаже у очувању влажности тла, сузбијању корова и регулисању температуре тла. Органски мулч као што је слама или компост је најбољи.",
      },
      {
        id: 6053,
        topic: "Избегавајте прекомерно заливање",
        text: "Прекомерно заливање може изазвати загушење тла и труљење корена, па осигурате добру дренажу тла, посебно након јаке кише.",
      },
    ],
  },
  {
    id: 606,
    topic: "Ђубрење",
    children: [
      {
        id: 6061,
        topic: "Нутријенти",
        text: "Купус је 'тежак' у погледу потребе за хранљивим материјама и користи редовно ђубрење са уравнотеженим ђубривом (нпр. 10-10-10 НПК). Интегришите компост или добро разложени стајњак у тло пре садње.",
      },
      {
        id: 6062,
        topic: "Време",
        text: "Ђубрите приликом пресађивања и додатно ђубрите 3 до 4 недеље након садње, посебно током брзог раста лишћа.",
      },
    ],
  },
  {
    id: 607,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 6071,
        topic: "Штеточине",
        text: "Чести штеточини укључују црве купуса, афиде, буве и лупаце. Користите покриваче редова, ручно брање и органске инсектициде за контролу штеточина.",
      },
      {
        id: 6072,
        topic: "Болести",
        text: "Купус је подложан болестима као што су црна трулеж, клуброза и долнo пепелница. Ротација усева, правилно заливање и отпорне врсте могу помоћи у управљању болестима.",
      },
    ],
  },
  {
    id: 608,
    topic: "Орезивање и одржавање",
    children: [
      {
        id: 6081,
        topic: "Коровање",
        text: "Чувајте подручје око биљака купуса од корова како бисте смањили конкуренцију за хранљиве материје и воду. Најбољи су ручни рад или плитка обрада земље како би се избегло оштећење корена.",
      },
      {
        id: 6082,
        topic: "Размножавање",
        text: "Таните саднице или пресаднице на правилан размак како бисте обезбедили здраво формирање главица.",
      },
    ],
  },
  {
    id: 609,
    topic: "Берба",
    children: [
      {
        id: 6091,
        topic: "Време",
        text: "Купус је спреман за бербу када главица буде чврста и чврста, обично 70 до 100 дана након пресађивања, у зависности од врсте.",
      },
      {
        id: 6092,
        topic: "Знакови зрелости",
        text: "Берба се врши када главица осећа чврсто на додир и достигне одговарајућу величину за своју врсту. Избегавајте дуго одлагање, јер главице могу да пукну или постану тврде.",
      },
      {
        id: 6093,
        topic: "Ручна обрада",
        text: "Користите оштар нож да одсечете главицу са биљке, остављајући неке спољне листове за заштиту приликом руковања и складиштења.",
      },
    ],
  },
  {
    id: 610,
    topic: "Чување",
    text: "Купус се може чувати на хладном, влажном месту (0°C до 4°C или 32°F до 39°F) неколико недеља.",
    },
],  
    },
{
    id: 4,
    name: "Шаргарепа",
    img: vegetablesImages.carrots,
    inGeneralHeading: `Хрскава моћна нутријентна бомба`,
    inGeneral: `Шаргарепа, научно позната као Daucus carota, је једно од најпопуларнијих коренастих поврћа широм света, позната по својој живописној наранџастој боји, хрскавој текстури и слатком укусу. Док је најчешће наранџаста, шаргарепа такође долази у разним бојама, укључујући љубичасту, жуту, црвену и белу. Врло је свестрана у кухињи и пуна је импресивног распона здравствених користи.
                  Једна од најистакнутијих карактеристика шаргарепе је висок садржај бета-каротена, једињења које тело претвара у витамин А. Овај есенцијални витамин је кључан за здравље очију, помажући у превенцији проблема са видом као што су ноћна слепила и старосна дегенерација макуле. Једна просечна шаргарепа обезбеђује више од 200% дневно препорученог уноса витамина А, што је чини врхунским избором за подршку здрављу вида.
                  Шаргарепе су такође богате антиоксидансима, посебно каротеноидима као што су бета-каротен, лутеин и зеаксантин. Ови антиоксиданси помажу у заштити тела од оксидативног стреса, смањују упале и могу смањити ризик од хроничних болести, укључујући болести срца и одређене врсте рака.
                  Поред витамина А, шаргарепе пружају добру количину влакана, која подржава здравље варења, регулише ниво шећера у крви и промовише ситост. Ниске су калоријске, што их чини савршеним грицкалицама за оне који желе да контролишу своју тежину.
                  У кулинарству, шаргарепе су невероватно свестране. Могу се јести сирове, куване, печене, парене или се могу ставити у супе, сокове и смутије. Њихова природна слаткоћа такође их чини популарним састојком у десертима као што је торта од шаргарепе.
                  Укратко, шаргарепе су поврће пуно нутријената које нуди широк спектар здравствених користи, од подршке здрављу очију до подршке варењу. Њихова хрскава текстура и укус чине их укусним и свестраним додатком свакој исхрани.`,
    topic1: "Исхрана и здравље",
    nutritionText: [
      {
        element: "Енергетска вредност:",
        quantity: 41,
        measurementUnits: "ккал",
        description:
          "– Низак садржај калорија, што их чини хранљивим грицкалицама.",
      },
      {
        element: "Масти:",
        quantity: 0.2,
        measurementUnits: "г",
        description:
          "– Веома низак садржај масти, што доприноси њиховом здравственом профилу.",
      },
      {
        element: "Засићене масне киселине:",
        quantity: 0,
        measurementUnits: "г",
        description: "– Не садрже засићене масти, што подржава здравље срца.",
      },
      {
        element: "Натријум:",
        quantity: 69,
        measurementUnits: "мг",
        description:
          "– Садрже малу количину натријума, што треба узети у обзир у балансираној исхрани.",
      },
      {
        element: "Калијум:",
        quantity: 323,
        measurementUnits: "мг",
        description:
          "– Добар извор калијума, који је есенцијалан за функцију мишића и баланс течности.",
      },
      {
        element: "Угљени хидрати:",
        quantity: 9.6,
        measurementUnits: "г",
        description: "– Пружа природне шећере и угљене хидрате за енергију.",
      },
      {
        element: "Влакна:",
        quantity: 2.8,
        measurementUnits: "г",
        description:
          "– Добар извор дијеталних влакана која подржавају здраво варење.",
      },
      {
        element: "Шећери:",
        quantity: 4.7,
        measurementUnits: "г",
        description:
          "– Садрже природне шећере, што доприноси њиховом слатком укусу.",
      },
      {
        element: "Протеини:",
        quantity: 0.9,
        measurementUnits: "г",
        description: "– Пружа малу количину протеина из биљног извора.",
      },
      {
        element: "Витамин Ц:",
        quantity: 7,
        measurementUnits: "мг",
        description:
          "– Садрже витамин Ц, који је важан за имунолошку функцију и здравље коже.",
      },
      {
        element: "Калцијум:",
        quantity: 30,
        measurementUnits: "мг",
        description:
          "– Пружа малу количину калцијума, који доприноси здрављу костију.",
      },
      {
        element: "Гвожђе:",
        quantity: 0.3,
        measurementUnits: "мг",
        description:
          "– Садржи трагове гвожђа, неопходног за здраву производњу црвених крвних зрнаца.",
      },
      {
        element: "Магнезијум:",
        quantity: 12,
        measurementUnits: "мг",
        description:
          "– Садржи мале количине магнезијума, који је важан за функцију мишића и нерва.",
      },
      {
        element: "Бета-Каротен:",
        quantity: 8285,
        measurementUnits: "µг",
        description:
          "– Прекурсор витамина А, који подржава здравље очију и имунолошки систем.",
      },
      {
        element: "Витамин А:",
        quantity: 835,
        measurementUnits: "IU",
        description:
          "– Изврстан извор витамина А, који је есенцијалан за здравље очију и коже.",
      },
    ],
    cultivationHeading: 
    "Одржавање поврћа захтева специфичне услове како би се обезбедио здрав раст и висококвалитетни корени. Испод је преглед кључних фактора који утичу на узгајање шаргарепе:",
  cultivation: [
    {
      id: 601,
      topic: "Клима",
      children: [
        {
          id: 6011,
          topic: "Температура",
          text: "Шаргарепа најбоље расте у хладним, умереним климатским условима. Оптимални температурни опсег је између 15°C и 21°C (59°F до 70°F). Више температуре могу изазвати да корени постану тврди или развију горки укус.",
        },
        {
          id: 6012,
          topic: "Падавине",
          text: "Шаргарепи су потребне умерене падавине, идеално око 300 до 500 мм (12 до 20 инча) годишње. Константна влажност је важна за равномерни развој корена, али треба избегавати натапање водом.",
        },
      ],
    },
    {
      id: 602,
      topic: "Тло",
      children: [
        {
          id: 6021,
          topic: "pH",
          text: "Шаргарепа више воле благо кисела до неутрална тла, са pH опсегом од 6,0 до 6,8.",
        },
        {
          id: 6022,
          topic: "Тип тла",
          text: "Шаргарепа најбоље расте у лабавим, добро дренираним песковитим иловастим тловима. Тврда глинастa или каменита тла могу деформисати корене, док песковита тла олакшавају продор корена и прави раст.",
        },
        {
          id: 6023,
          topic: "Припрема тла",
          text: "Тло треба дубоко обрадити и ослободити од камења и осталих остака како би се избегли неправилни корени. Додавање органског материјала као што је компост може побољшати структуру и плодност тла.",
        },
      ],
    },
    {
      id: 603,
      topic: "Варитети",
      text: "Популарни варитети шаргарепе укључују: -Нантес- (глатки, цилиндрични корени, добри за свеже конзумирање). -Император- (долги, сужење корени, често се користе у комерцијалној производњи). -Данверс- (дебљи корени, погодни за тврда тла). -Шантене- (краћи корени, идеални за плитка или тврда тла).",
    },
    {
      id: 604,
      topic: "Садња",
      children: [
        {
          id: 6041,
          topic: "Време",
          text: "Шаргарепа се обично сади рано пролеће, чим тло може да се обради. У топлијим климатским условима, може се садити и у јесен за зимску жетву.",
        },
        {
          id: 6042,
          topic: "Дубина и раздаљина",
          text: "Семе шаргарепе треба садити на дубини од 1 до 2 цм (0,4 до 0,8 инча). Раздаљина између семена треба бити 2 до 5 цм (1 до 2 инча), са редовима удаљеним око 30 цм (12 инча).",
        },
        {
          id: 6043,
          topic: "Квантитет семена",
          text: "Препоручена количина семена је 2 до 3 кг по хектару (1,8 до 2,7 фунти по акру) за оптималан принос.",
        },
      ],
    },
    {
      id: 605,
      topic: "Заливање",
      children: [
        {
          id: 6051,
          topic: "Услови кише",
          text: "У регионима са довољним и константним падавинама, шаргарепа може расти као биљка која се залива кишом. Константна влажност је неопходна за равномерни развој корена.",
        },
        {
          id: 6052,
          topic: "Иригиране биљке",
          text: "У сувљим регионима, шаргарепи ће бити потребно додатно заливање. Заливање је посебно критично током раних фаза развоја корена и током сушних периода.",
        },
        {
          id: 6053,
          topic: "Натапање водом",
          text: "Шаргарепа не подноси натапање водом, што може узроковати труљење корена и неправилне корене. Обезбедите добро дренирано тло да избегнете стојећу воду.",
        },
      ],
    },
    {
      id: 606,
      topic: "Ђубрење",
      children: [
        {
          id: 6061,
          topic: "Нутријенти",
          text: "Шаргарепи су потребни уравнотежени нутријенти, посебно калијум, фосфор и умерени нивои азота. Превише азота може изазвати прекомерни раст лишћа на рачун развоја корена.",
        },
        {
          id: 6062,
          topic: "Време",
          text: "Ђубрива треба примењивати пре садње. Друга лагана примена азота може бити потребна током раних фаза развоја корена.",
        },
      ],
    },
    {
      id: 607,
      topic: "Контрола штеточина и болести",
      children: [
        {
          id: 6071,
          topic: "Штеточине",
          text: "Уобичајене штеточине које нападају шаргарепу укључују муве шаргарепе, афиде и нематоде. Ротација усева и садња са другим биљкама као што су луљеви може помоћи у одвраћању штеточина.",
        },
        {
          id: 6072,
          topic: "Болести",
          text: "Шаргарепа је подложна болестима као што су Алтернарија на листовима и труљење корена. Правилно размакнутост, ротација усева и добра дренажа могу помоћи у превенцији ових проблема.",
        },
      ],
    },
    {
      id: 608,
      topic: "Жетва",
      children: [
        {
          id: 6081,
          topic: "Време",
          text: "Шаргарепа је обично спремна за жетву 70 до 80 дана након садње, у зависности од варитета. Корени треба да буду чврсти, а врхови треба да имају светлу зелену боју.",
        },
        {
          id: 6082,
          topic: "Метод",
          text: "Шаргарепа се бере пажљивим повлачењем корена из тла. У комерцијалним условима, често се користе механички берачи. Након жетве, врхови се скраћују како би се спречило губљење влаге.",
        },
      ],
    },
    {
      id: 609,
      topic: "Складиштење",
      text: "Шаргарепа се може складиштити неколико месеци у хладном, влажном окружењу (0°C до 4°C или 32°F до 39°F) са високом влажношћу (90-95%). Правилно складиштење помаже у спречавању сушења и одржавању квалитета корена.",
    },
    {
      id: 610,
      topic: "Проређивање",
      text: "Расад шаргарепе треба проређивање на раздаљину од 5 до 8 цм (2 до 3 инча) када достигну висину од 5 цм (2 инча). Правилно танање обезбеђује довољно простора за развој корена и спречава конкуренцију за нутријенте.",
    },
  ],  
},
{
    id: 5,
name: "Краставци",
img: vegetablesImages.cucumbers,
inGeneralHeading: `Хидратантно и освежавајуће поврће`,
inGeneral: `Краставци, научно познати као Cucumis sativus, су популарно и освежавајуће поврће познато по свом високом садржају воде, благи укусу и хрскавој текстури. Обично се користе у салатама, киселим краставцима и расхлађеним јелима, краставци нису само хидратантни већ и нуде разне здравствене користи.
              Једна од најистакнутијих карактеристика краставца је њихов изузетно висок садржај воде—приближно 95% њихове тежине. Ово их чини одличним избором за хидратацију, посебно током врућег времена, помажући да се обнове течности и одржава здравље коже. Упркос својој лаганој тежини, краставци су богати есенцијалним витаминима и минералима, укључујући витамине К, Ц и калијум. Витамин К игра кључну улогу у згрушавању крви и здрављу костију, док витамин Ц подржава имунолошку функцију и здравље коже.
              Краставци су такође добар извор антиоксиданаса, као што су бета-каротен и флавоноиди, који помажу у заштити ћелија од оксидативних оштећења и смањују упале. Ови антиоксиданси могу играти улогу у смањењу ризика од хроничних болести, укључујући болести срца и одређене врсте рака.
              Поред својих хидратантних својстава, краставци су нискокалоријски и садрже влакна, посебно у кожи. Ово их чини одличним избором за управљање тежином и здравље варења. Помажу у промоцији редовних покретања црева и могу допринети бољем здрављу црева.
              У кулинарству, краставци су невероватно свестрани. Могу се уживати сирови у салатама, исечени у сендвиче, изблендирани у смутије или коришћени за прављење киселих краставца.
              Укратко, краставци су нискокалоријско, хидратантно поврће са хрскавом текстуром и блаким укусом. Њихов висок садржај воде, у комбинацији са есенцијалним нутријентима и антиоксидансима, чини их освежавајућим и здравим избором за било коју исхрану.`,
topic1: "Исхрана и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 16,
    measurementUnits: "ккал",
    description:
      "– Веома нискокалоријски, чинећи га одличним избором за хидратацију и управљање тежином.",
  },
  {
    element: "Масти:",
    quantity: 0.1,
    measurementUnits: "г",
    description:
      "– Изузетно низак садржај масти, што доприноси његовом укупном нискокалоријском садржају.",
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0.02,
    measurementUnits: "г",
    description:
      "– Садржи занемарљиве количине засићених масти, подржавајући здравље срца.",
  },
  {
    element: "Витамин Б3 (Нијасин):",
    quantity: 0.098,
    measurementUnits: "мг",
    description:
      "– Подржава метаболизам и помаже одржавању здраве коже и нерва.",
  },
  {
    element: "Натријум:",
    quantity: 2,
    measurementUnits: "мг",
    description:
      "– Веома низак садржај натријума, чинећи га здравим избором за срце.",
  },
  {
    element: "Калијум:",
    quantity: 262,
    measurementUnits: "мг",
    description:
      "– Добар извор калијума, који је есенцијалан за одржавање баланса течности и функцију мишића.",
  },
  {
    element: "Угљени хидрати:",
    quantity: 3.6,
    measurementUnits: "г",
    description:
      "– Низак садржај угљених хидрата, углавном пружа хидратацију и влакна.",
  },
  {
    element: "Влакна:",
    quantity: 0.5,
    measurementUnits: "г",
    description:
      "– Садржи нека дијетална влакна, која подржавају здравље варења.",
  },
  {
    element: "Шећери:",
    quantity: 1.7,
    measurementUnits: "г",
    description:
      "– Садржи малу количину природних шећера.",
  },
  {
    element: "Протеини:",
    quantity: 0.7,
    measurementUnits: "г",
    description:
      "– Низак садржај протеина, типично за поврће као што су краставци.",
  },
  {
    element: "Витамин Ц:",
    quantity: 2.8,
    measurementUnits: "мг",
    description:
      "– Садржи мале количине витамина Ц, који је важан за имунолошко здравље.",
  },
  {
    element: "Калцијум:",
    quantity: 16,
    measurementUnits: "мг",
    description:
      "– Пружа малу количину калцијума, који доприноси здрављу костију.",
  },
  {
    element: "Гвожђе:",
    quantity: 0.28,
    measurementUnits: "мг",
    description:
      "– Садржи малу количину гвожђа, које је неопходно за здравље крви.",
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.03,
    measurementUnits: "мг",
    description:
      "– Подржава метаболизам енергије и функцију нервног система.",
  },
  {
    element: "Витамин Б6:",
    quantity: 0.04,
    measurementUnits: "мг",
    description:
      "– Учествује у здрављу мозга и подржава метаболизам.",
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.02,
    measurementUnits: "мг",
    description:
      "– Има улогу у производњи енергије и здрављу коже.",
  },
  {
    element: "Магнезијум:",
    quantity: 13,
    measurementUnits: "мг",
    description:
      "– Садржи магнезијум, који је важан за функцију мишића и нерва.",
  },
  {
    element: "Цинк:",
    quantity: 0.2,
    measurementUnits: "мг",
    description:
      "– Садржи минималне количине цинка, који подржава имунолошку функцију.",
  },
  {
    element: "Витамин Е:",
    quantity: 0.12,
    measurementUnits: "мг",
    description:
      "– Садржи мале количине витамина Е, који је антиоксиданс.",
  },
  {
    element: "Витамин А:",
    quantity: 83,
    measurementUnits: "IU",
    description:
      "– Садржи неки витамин А, који је важан за здравље очију и имунолошки систем.",
  },
],
cultivationHeading:
      "Узгој краставаца захтева специфичне услове раста за здраве винове лозе и обилну производњу плодова. Ево прегледа кључних фактора за успешан узгој краставаца:",
    cultivation: [
      {
        id: 701,
        topic: "Клима",
        children: [
          {
            id: 7011,
            topic: "Температура",
            text: "Краставци најбоље расту у топлим климама, са оптималним температурама између 21°C и 29°C (70°F до 85°F). Осетљиви су на мраз, па се садња треба вршити тек након што прође опасност од мраза.",
          },
          {
            id: 7012,
            topic: "Сезона",
            text: "Краставци се обично sade током лета, али у регионима са благим зимама могу се гајити и током јесени или чак почетком пролећа.",
          },
        ],
      },
      {
        id: 702,
        topic: "Тло",
        children: [
          {
            id: 7021,
            topic: "пХ",
            text: "Краставци преферирају благо кисело до неутрално тло са пХ вредношћу између 6.0 и 7.0.",
          },
          {
            id: 7022,
            topic: "Врста тла",
            text: "Најбоље расту у добро дренираном, плодном иловацима или песковитој иловаци. Тежа глинена тла могу довести до лоше дренаже и успореног раста.",
          },
          {
            id: 7023,
            topic: "Припрема тла",
            text: "Прелиминарно обогаћивање тла компостом или добро распаднутим стајњаком може осигурати потребне хранљиве материје за снажан раст краставаца.",
          },
        ],
      },
      {
        id: 703,
        topic: "Врсте",
        text: "Популарне врсте краставаца укључују: - Краставци за сецање- (нпр. 'Marketmore,' 'Straight Eight'). - Краставци за кисељење- (нпр. 'Boston Pickling,' 'National Pickling'). - Безсеменски краставци- (нпр. 'Tyria').",
      },
      {
        id: 704,
        topic: "Садња",
        children: [
          {
            id: 7041,
            topic: "Време",
            text: "Краставци треба да се саде након последњег мраза, када температура тла достигне најмање 18°C (65°F).",
          },
          {
            id: 7042,
            topic: "Размак",
            text: "Размакните биљке краставаца 30 до 60 цм (12 до 24 инча), а редове размакните 90 до 120 цм (3 до 4 стопе). За врсте које расту у винова лозу, размотрите коришћење решетке како бисте уштедели простор и побољшали проток ваздуха.",
          },
          {
            id: 7043,
            topic: "Директно сејање или пресађивање",
            text: "Краставци могу бити директно посејани у врт или започети у затвореном простору 3 до 4 недеље пре последњег мраза. Ако пресађујете, прилагодите саднице пре него што их преместите споља.",
          },
        ],
      },
      {
        id: 705,
        topic: "Заливање",
        children: [
          {
            id: 7051,
            topic: "Редовно заливање",
            text: "Краставци захтевају доследну влагу, посебно током цветања и формирања плодова. Заливајте дубоко 1 до 2 инча недељно, имајући у виду да тло буде равномерно влажно.",
          },
          {
            id: 7052,
            topic: "Мулчирање",
            text: "Нанети мулч око базе биљака краставаца како бисте задржали влагу у тлу, регулисали температуру и потиснули коров.",
          },
          {
            id: 7053,
            topic: "Избегавање поплављивања",
            text: "Обезбедите добру дренажу како бисте спречили поплављивање тла, што може узроковати труљење корена и друге гљивичне болести.",
          },
        ],
      },
      {
        id: 706,
        topic: "Ђубрење",
        children: [
          {
            id: 7061,
            topic: "Хранљиве материје",
            text: "Краставци користе уравнотежено ђубриво или компост. Примените ђубриво богато азотом за рани раст, а касније пређите на оно богатије фосфором и калијумом када се појаве цветови.",
          },
          {
            id: 7062,
            topic: "Време",
            text: "Ђубрите приликом садње, а затим додајте ђубриво сваке 3 до 4 недеље током раста.",
          },
        ],
      },
      {
        id: 707,
        topic: "Контрола штеточина и болести",
        children: [
          {
            id: 7071,
            topic: "Штеточине",
            text: "Чести штеточини укључују краставчеве бубе, уши и паукове гриње. Користите покриваче за редове да заштитите младе биљке и органске инсектициде ако је потребно.",
          },
          {
            id: 7072,
            topic: "Болести",
            text: "Краставци су подложни болестима као што су прашкаста пласе, пласа на доњој страни и бактеријско увело. Правилан размак између биљака, добар проток ваздуха и ротација усева могу помоћи у смањењу ризика од болести.",
          },
        ],
      },
      {
        id: 708,
        topic: "Орезивање и одржавање",
        children: [
          {
            id: 7081,
            topic: "Винске врсте",
            text: "За краставце који расту у виновој лози, обрезивање сулишних лоза и коришћење решетки побољшава проток ваздуха и олакшава жетву.",
          },
          {
            id: 7082,
            topic: "Чишћење од корова",
            text: "Одржавајте подручје око биљака краставаца без корова како бисте смањили конкуренцију за хранљиве материје и воду.",
          },
        ],
      },
      {
        id: 709,
        topic: "Жетва",
        children: [
          {
            id: 7091,
            topic: "Време",
            text: "Краставци су спремни за жетву 50 до 70 дана након садње, у зависности од сорте. Убирајте краставце када буду чврсти, глатки и одговарајуће величине за своју сорту (6 до 9 инча за краставце за сецање).",
          },
          {
            id: 7092,
            topic: "Знакови зрелости",
            text: "Берба краставаца се врши када су чврсти и тамно зелене боје. Презрељи краставци могу постати жути, тврди и горак.",
          },
          {
            id: 7093,
            topic: "Честа берба",
            text: "Берите краставце редовно како бисте подстакли већу производњу плодовâ и спречили да постану преобимни и горак.",
          },
        ],
      },
      {
        id: 710,
        topic: "Складиштење",
        text: "Свеже краставце можете чувати у фрижидеру до недељу дана. За дугорочно складиштење, краставци се могу киселити.",
      },
    ]
},
{
    id: 6,
name: "Блитва",
img: vegetablesImages.chard,
inGeneralHeading: `Богатство нутријената у листовима`,
inGeneral: `Блитва, такође позната као швајцарска блитва (Beta vulgaris subsp. cicla), је листовито поврће које се цени због својих живописних стабљика и нутритивно богатих листова. Често се користи у медитеранској кухињи, а слави се због свог земљаног укуса и широког спектра здравствених користи. Њене живописне стабљике—од црвене и жуте до беле и зелене—додају уочљив визуелни ефекат јелима, док су њени нежни листови препуни хранљивих материја. 
                  Једна од истакнутих особина блитве је њен импресиван садржај витамина и минерала. Посебно је богата витамином К, А и Ц. Витамин К подржава здравље костију и игра критичну улогу у згрушавању крви, док је витамин А есенцијалан за здравље очију и имунолошку функцију. Витамин Ц делује као моћан антиоксидант, помажући у заштити ћелија од оксидативног оштећења и подстиче имунолошку одбрану. 
                  Блитва је такође богата есенцијалним минералима као што су магнезијум, калијум и гвожђе, који сви подржавају мишићну функцију, здравље срца и транспорт кисеоника у организму. Поред тога, влакна у блитви помажу у варењу, промовишу ситост и помажу у регулацији нивоа шећера у крви.
                  Осим витамина и минерала, блитва садржи антиоксиданте као што су бета-каротен и полифеноли, који могу смањити упалу и смањити ризик од хроничних болести као што су болести срца и одређени типови рака.
                  У кулинарству, блитва је невероватно свестрана. Може се пржити, парити, додавати у супе или користити као основа за салате. Њен благ укус чини је одличним додацима за широк спектар јела, од сувих чорби до јела са јајима.
                  Укратко, блитва је хранљиво богато листовито поврће које пружа многе здравствене користи. Њена свестраност у кухињи и импресиван нутритивни профил чине је вредним додацима свакој исхрани.`,
topic1: "Нутриција и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 19,
    measurementUnits: "ккал",
    description: "– Низак у калоријама, што га чини идеалним за управљање тежином."
  },
  {
    element: "Масти:",
    quantity: 0.2,
    measurementUnits: "г",
    description: "– Веома низак садржај масти, са траговима здравих масти."
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0.03,
    measurementUnits: "г",
    description: "– Садржи веома низак ниво засићених масти, подржавајући здравље срца."
  },
  {
    element: "Витамин Б3 (Ниацин):",
    quantity: 0.4,
    measurementUnits: "мг",
    description: "– Подржава метаболизам енергије и важан је за здравље коже."
  },
  {
    element: "Натријум:",
    quantity: 213,
    measurementUnits: "мг",
    description: "– Умерен извор натријума, нудећи баланс за здраву исхрану."
  },
  {
    element: "Калијум:",
    quantity: 379,
    measurementUnits: "мг",
    description: "– Добар извор калијума, који је есенцијалан за одржавање равнотеже течности и правилну функцију мишића."
  },
  {
    element: "Угљени хидрати:",
    quantity: 3.74,
    measurementUnits: "г",
    description: "– Низак у угљеним хидратима, углавном пружа влакна."
  },
  {
    element: "Влакна:",
    quantity: 1.6,
    measurementUnits: "г",
    description: "– Богат извор влакана, подржава здраво варење и ситост."
  },
  {
    element: "Шећер:",
    quantity: 1.1,
    measurementUnits: "г",
    description: "– Садржи малу количину природних шећера."
  },
  {
    element: "Протеини:",
    quantity: 1.8,
    measurementUnits: "г",
    description: "– Умерен садржај протеина у поређењу са другим листовитим поврћем."
  },
  {
    element: "Витамин Ц:",
    quantity: 30,
    measurementUnits: "мг",
    description: "– Богат извор витамина Ц, важан за имунолошку функцију и здравље коже."
  },
  {
    element: "Калцијум:",
    quantity: 51,
    measurementUnits: "мг",
    description: "– Пружа калцијум, који доприноси здрављу костију."
  },
  {
    element: "Гвожђе:",
    quantity: 1.8,
    measurementUnits: "мг",
    description: "– Садржи гвожђе, неопходно за производњу црвених крвних зрнаца."
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.04,
    measurementUnits: "мг",
    description: "– Подржава метаболизам енергије и здравље нервног система."
  },
  {
    element: "Витамин Б6:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Укључен је у здравље мозга и производњу неуротрансмитера."
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.09,
    measurementUnits: "мг",
    description: "– Игра улогу у производњи енергије и одржавању здраве коже."
  },
  {
    element: "Магнезијум:",
    quantity: 81,
    measurementUnits: "мг",
    description: "– Богат извор магнезијума, који је есенцијалан за функцију мишића и производњу енергије."
  },
  {
    element: "Цинк:",
    quantity: 0.35,
    measurementUnits: "мг",
    description: "– Садржи цинк, који подржава имунолошку функцију."
  },
  {
    element: "Витамин Е:",
    quantity: 1.89,
    measurementUnits: "мг",
    description: "– Добар извор витамина Е, који доприноси антиоксидативној заштити."
  },
  {
    element: "Витамин А:",
    quantity: 6116,
    measurementUnits: "ИУ",
    description: "– Богат извор витамина А, који је важан за вид и имунолошку функцију."
  }
],
cultivationHeading:
      "Узгој блитве захтева специфичне услове како би се осигурао здрав раст и живописно лишће. Испод је преглед кључних фактора који су укључени у узгој блитве:",
    cultivation: [
      {
        id: 701,
        topic: "Клима",
        children: [
          {
            id: 7011,
            topic: "Температура",
            text: "Блитва најбоље расте у хладним до умереним климатама, са идеалним температурним опсегом између 10°C и 24°C (50°F до 75°F). Отпоран је на мраз и може преживети лаке мразеве, али прекомерна топлина може узроковати да лишће постане тврдо и горко.",
          },
          {
            id: 7012,
            topic: "Падавине",
            text: "Блитва захтева умерене падавине, обично око 400 до 600 мм (16 до 24 инча) годишње. Константна влага је кључна за производњу нежног, здравог лишћа.",
          },
        ],
      },
      {
        id: 702,
        topic: "Тло",
        children: [
          {
            id: 7021,
            topic: "pH",
            text: "Блитва преферира благо кисело до неутрално тло, са пХ вредношћу између 6.0 и 7.0.",
          },
          {
            id: 7022,
            topic: "Врста тла",
            text: "Блитва добро расте у иловастим, добро дренираним тлима богатим органским материјама. Може толерисати разне типове тла, али најбоље се развија у растреситим, плодним тлима.",
          },
          {
            id: 7023,
            topic: "Припрема тла",
            text: "Тло треба добро припремити укључивањем органских материја као што су компост или стајњак. Обезбедите да тло буде растресито и без груда како бисте подстакли здрав раст корена.",
          },
        ],
      },
      {
        id: 703,
        topic: "Врсте",
        text: "Популарне врсте блитве укључују: - 'Bright Lights' - познат по живописним стабљикама. - 'Fordhook Giant' - веће лишће и стабљике, често се користи за кување. - 'Rhubarb Chard' - светло црвене стабљике, нежно лишће.",
      },
      {
        id: 704,
        topic: "Садња",
        children: [
          {
            id: 7041,
            topic: "Време",
            text: "Блитва се може садити рано у пролеће за летњу бербу, или касно у лето за јесенску или зимску жетву у блажим климатама.",
          },
          {
            id: 7042,
            topic: "Дубина и размак",
            text: "Семе блитве треба посадити на дубину од 1 до 2 цм (0.4 до 0.8 инча). Семе треба размакнути 20 до 30 цм (8 до 12 инча), а редове размакнути 45 цм (18 инча).",
          },
          {
            id: 7043,
            topic: "Стање сејања",
            text: "Препоручује се сејање 4 до 5 кг по хектару (3.5 до 4.5 фунти по акру) за оптималан раст.",
          },
        ],
      },
      {
        id: 705,
        topic: "Заливање",
        children: [
          {
            id: 7051,
            topic: "Кишно храњење усева",
            text: "У подручјима са адекватним падавинама, блитва се може гајити као усев који зависи од падавина. Међутим, константна влага је важна како би се избегло увенуће и осигурало нежно лишће.",
          },
          {
            id: 7052,
            topic: "Иригација",
            text: "У сувљим регионима, додатна ирегација је неопходна, посебно током сувих периода. Ирегација помаже у одржавању квалитета лишћа и спречава болтање у врућем времену.",
          },
          {
            id: 7053,
            topic: "Поплављивање",
            text: "Блитва не толерише поплављене услове, што може довести до труљења корена. Обезбедите добро дренирано тло како бисте избегли задржавање воде.",
          },
        ],
      },
      {
        id: 706,
        topic: "Ђубрење",
        children: [
          {
            id: 7061,
            topic: "Хранљиве материје",
            text: "Блитва користи уравнотежено ђубриво, богато азотом, фосфором и калијумом. Азот подстиче здрав раст лишћа, док фосфор подржава развој корена.",
          },
          {
            id: 7062,
            topic: "Време",
            text: "Ђубриво треба применити пре садње, а додатно ђубрење азотом може се обавити током раста како би се подстакао живољнији раст лишћа.",
          },
        ],
      },
      {
        id: 707,
        topic: "Контрола штеточина и болести",
        children: [
          {
            id: 7071,
            topic: "Штеточине",
            text: "Чести штеточини укључују рударе, уши и слузавце. Користите покриваче за редове и практикујте ротацију усева како бисте смањили нападе штеточина.",
          },
          {
            id: 7072,
            topic: "Болести",
            text: "Блитва је подложана гљивичним болестима као што су доњи плесни и мрље на листовима. Обезбедите одговарајући размак и циркулацију ваздуха како бисте смањили влажност која може подстаћи раст гљива.",
          },
        ],
      },
      {
        id: 708,
        topic: "Берба",
        children: [
          {
            id: 7081,
            topic: "Време",
            text: "Блитва је обично спремна за бербу 50 до 60 дана након садње. Берите спољашње листове по потреби, или обрежите читаву биљку за већу жетву. Биљка ће наставити да производи нове листове ако се беру само спољашњи листови.",
          },
          {
            id: 7082,
            topic: "Метод",
            text: "Берба блитве се врши тако што се листови режу са корена, остављајући унутрашње листове да наставе са растом. Усева се може бербити више пута током сезоне.",
          },
        ],
      },
      {
        id: 709,
        topic: "Складиштење",
        text: "Блитва се може чувати у хладном, влажном окружењу до недељу дана. Најбоље је конзумирати свеже, али се може бланширати и замрзнути за дуже складиштење.",
      },
      {
        id: 710,
        topic: "Разређивање",
        text: "Разређујте саднице на размак од 20 до 30 цм (8 до 12 инча) како би се омогућило довољно простора за раст биљака. Разређивање подстиче здрав раст и смањује конкуренцију за хранљиве материје.",
      },
    ]

},
{
    id: 7,
name: "Бели лук",
img: vegetablesImages.garlic,
inGeneralHeading: `Јак и ароматичан суперфуд`,
inGeneral: `Бели лук, научно познат као Allium sativum, је мала, луковична биљка која се већ хиљадама година цени због својих кулинарских својстава и лековитих особина. Познат по свом јаком, оштром укусу, бели лук је кључни састојак у многим кухињама широм света, додајући дубину и сложеност јелима од прженки до сосова за тестенине.
                  Здравствене користи белог лука углавном се приписују његовој високој концентрацији сулфурних једињења, посебно аллицина, који се ослобађа када се бели лук сецка, сруши или жваће. Аллицин има снажна антиинфламаторна, антибактеријска и антивирусна својства, чинећи бели лук природним леком за различите болести. Такође је повезан са здрављем срца, јер редовна конзумација белог лука може помоћи у смањењу крвног притиска, снижавању нивоа холестерола и побољшању укупне функције срца.
                  Поред здравља срца, бели лук је познат и по појачавању имунолошког система. Истраживања су показала да бели лук може смањити тежину и трајање обичних прехлада и других инфекција. Његова антиоксидативна својства такође помажу у заштити организма од оксидативног стреса, потенцијално смањујући ризик од хроничних болести, укључујући одређене врсте рака.
                  Бели лук је такође добар извор витамина и минерала, укључујући витамин Ц, витамин Б6, манган и селен, који сви доприносе укупном здрављу и благостању.
                  Кулинарски, бели лук је невероватно свестран. Може се користити сиров за оштар, интензиван укус или кувати како би изашао његов слађи, мекши укус. Може се печити, пржити, додавати у маринаде или користити као зачини за месо, поврће и сосове.
                  Укратко, бели лук је моћан суперфуд који нуди широк спектар здравствених користи. Његов оштар укус и лековита својства чине га вредним додацима и у кухињу и у апотеку.`,
topic1: "Исхрана и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 149,
    measurementUnits: "кцал",
    description:
      "– Пружа умерену количину енергије, чинећи га ароматичним додатком оброцима без значајних калорија.",
  },
  {
    element: "Масти:",
    quantity: 0.5,
    measurementUnits: "г",
    description: "– Врло ниске масноће, што доприноси здравом срцу.",
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0.1,
    measurementUnits: "г",
    description: "– Садржи минималне количине засићених масти, подржавајући здравље кардиоваскуларног система.",
  },
  {
    element: "Витамин Б3 (Нијасин):",
    quantity: 0.7,
    measurementUnits: "мг",
    description:
      "– Подржава метаболизам и важан је за одржавање здраве коже и нервног система.",
  },
  {
    element: "Натријум:",
    quantity: 17,
    measurementUnits: "мг",
    description: "– Низак у садржају натријума, што га чини корисним за здравље срца.",
  },
  {
    element: "Калијум:",
    quantity: 401,
    measurementUnits: "мг",
    description:
      "– Добар извор калијума, који је неопходан за функцију мишића и равнотежу течности.",
  },
  {
    element: "Угљени хидрати:",
    quantity: 33.1,
    measurementUnits: "г",
    description: "– Садржи сложене угљене хидрате, пружајући енергију.",
  },
  {
    element: "Влакна:",
    quantity: 2.1,
    measurementUnits: "г",
    description:
      "– Пружа дијетална влакна која подржавају здравље дигестивног система.",
  },
  {
    element: "Шећер:",
    quantity: 1,
    measurementUnits: "г",
    description: "– Садржи мале количине природних шећера.",
  },
  {
    element: "Протеини:",
    quantity: 6.4,
    measurementUnits: "г",
    description:
      "– Добар извор протеина биљног порекла, користан за обнову мишића.",
  },
  {
    element: "Витамин Ц:",
    quantity: 31,
    measurementUnits: "мг",
    description:
      "– Садржи значајне количине витамина Ц, који подржава имунолошки систем.",
  },
  {
    element: "Калцијум:",
    quantity: 18,
    measurementUnits: "мг",
    description:
      "– Пружа мале количине калцијума, који доприноси здрављу костију.",
  },
  {
    element: "Гвожђе:",
    quantity: 1.7,
    measurementUnits: "мг",
    description:
      "– Садржи гвожђе, које је неопходно за производњу црвених крвних зрнаца.",
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.2,
    measurementUnits: "мг",
    description:
      "– Подржава метаболизам енергије претварањем угљених хидрата у енергију.",
  },
  {
    element: "Витамин Б6:",
    quantity: 1.2,
    measurementUnits: "мг",
    description: "– Учествује у здрављу мозга и подржава метаболизам.",
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Има улогу у производњи енергије и здрављу коже.",
  },
  {
    element: "Магнезијум:",
    quantity: 25,
    measurementUnits: "мг",
    description:
      "– Пружа магнезијум, који је неопходан за функцију мишића и здравље нерва.",
  },
  {
    element: "Цинк:",
    quantity: 1.2,
    measurementUnits: "мг",
    description:
      "– Садржи цинк, који подржава имунолошки систем и поправку ћелија.",
  },
  {
    element: "Витамин Е:",
    quantity: 0.08,
    measurementUnits: "мг",
    description: "– Садржи минималне количине витамина Е.",
  },
  {
    element: "Манган:",
    quantity: 1.7,
    measurementUnits: "мг",
    description:
      "– Добар извор мангана, који игра улогу у метаболизму и здрављу костију.",
  },
  {
    element: "Витамин А:",
    quantity: 2,
    measurementUnits: "ИИ",
    description:
      "– Садржи мале количине витамина А, који подржава здравље вида и имунолошки систем.",
  },
],
cultivationHeading:
  "Узгој белог лука захтева специфичне услове за оптималан развој луковица и укус. Ево прегледа кључних фактора у узгоју белог лука:",
cultivation: [
  {
    id: 801,
    topic: "Клима",
    children: [
      {
        id: 8011,
        topic: "Температура",
        text: "Бели лук најбоље успева у умереним климатским условима са хладним зимама и топлим летима. Идеалне температуре за раст су између 13°C и 24°C (55°F до 75°F).",
      },
      {
        id: 8012,
        topic: "Сезона",
        text: "Бели лук се може садити и у јесен и у пролеће, зависно од климе. Садња у јесен омогућава већи развој луковица због хладног периода током зиме.",
      },
    ],
  },
  {
    id: 802,
    topic: "Тло",
    children: [
      {
        id: 8021,
        topic: "pH",
        text: "Бели лук најбоље успева у добро дренираним земљиштима са pH између 6.0 и 7.0.",
      },
      {
        id: 8022,
        topic: "Тип тла",
        text: "Лоамна или песковита земљишта су идеална за узгој белог лука, јер пружају добру дренажу и спречавају наводњавање.",
      },
      {
        id: 8023,
        topic: "Припрема тла",
        text: "Умешајте органски материјал, као што је компост или добро разложени стајњак, у тло пре садње како бисте побољшали плодност.",
      },
    ],
  },
  {
    id: 803,
    topic: "Врсте",
    text: "Најпопуларније врсте белог лука укључују: -Тврди бели лук- (нпр. 'Порцелан', 'Рокамбол'), познат по снажном укусу и већим чешњевима. -Мекани бели лук- (нпр. 'Артичока', 'Силверскин'), који добро сноси складиштење и често се користи за плетење.",
  },
  {
    id: 804,
    topic: "Садња",
    children: [
      {
        id: 8041,
        topic: "Време",
        text: "Бели лук је најбоље садити у јесен (око 4 до 6 недеља пре него што тло замрзне) или у рано пролеће чим се земљиште може обрадити.",
      },
      {
        id: 8042,
        topic: "Размак",
        text: "Садите чешњеве белог лука 10 до 15 цм (4 до 6 инча) један од другог, са размаком између редова од око 30 цм (12 инча).",
      },
      {
        id: 8043,
        topic: "Дубина садње",
        text: "Садите чешњеве тако да су оштри крајеви окренути нагоре, на дубину од 5 до 7.5 цм (2 до 3 инча).",
      },
    ],
  },
  {
    id: 805,
    topic: "Заливање",
    children: [
      {
        id: 8051,
        topic: "Редовно заливање",
        text: "Бели лук захтева сталну влагу, посебно током развоја луковица. Заливајте дубоко једном недељно, смањујући учесталост како луковице сазревају.",
      },
      {
        id: 8052,
        topic: "Мулчирање",
        text: "Примена мулча помаже у задржавању влаге, сузбијању корова и одржавању стабилне температуре тла.",
      },
      {
        id: 8053,
        topic: "Избегавајте прекомерно заливање",
        text: "Обезбедите добру дренажу како бисте спречили труљење, јер је бели лук осетљив на стагнирање воде.",
      },
    ],
  },
  {
    id: 806,
    topic: "Ђубрење",
    children: [
      {
        id: 8061,
        topic: "Нутријенти",
        text: "Бели лук има користи од избалансираног ђубрива, посебно оних са високим садржајем азота током раног фазе раста, и фосфора и калијума како луковице сазревају.",
      },
      {
        id: 8062,
        topic: "Време",
        text: "Ђубрите при садњи, а поново у раном пролећу када биљке почну да расту.",
      },
    ],
  },
  {
    id: 807,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 8071,
        topic: "Штеточине",
        text: "Уобичајене штеточине укључују магареће мухе и апхи. Примените ротирање усева и одржавајте добру хигијену како бисте спречили нападе.",
      },
      {
        id: 8072,
        topic: "Болести",
        text: "Бели лук може бити подложан болестима као што су бела трулеж и пламенаста пепелница. Користите отпорне сорте и практикујте добро ротирање усева како бисте минимизирали ризик.",
      },
    ],
  },
  {
    id: 808,
    topic: "Жетва",
    children: [
      {
        id: 8081,
        topic: "Време",
        text: "Бели лук је обично спреман за жетву када доњи листови почну да жуте и суше се, обично 8 до 9 месеци након садње.",
      },
      {
        id: 8082,
        topic: "Знаци зрености",
        text: "Топови ће почети да жуте и падају када бели лук буде спреман за жетву. Избегавајте да чекате превише дуго, јер презрели бели лук може да се распадне.",
      },
      {
        id: 8083,
        topic: "Руковање",
        text: "Пажљиво рукујте са убраним луком како бисте избегли модрице. Стресите вишак земље, али не прати до употребе.",
      },
    ],
  },
  {
    id: 809,
    topic: "Складиштење",
    text: "Осушени бели лук може се складиштити на хладном, тамном месту са добром вентилацијом током неколико месеци. Избегавајте складиштење белог лука у фрижидеру, јер то може подстаћи клијање.",
  },
],
},{
    id: 8,
name: "Пасуљ",
img: vegetablesImages.greenBeans,
inGeneralHeading: `Хрскава и хранљива поврћа`,
inGeneral: `Пасуљ, такође познат као зупчасти пасуљ или бундеве пасуљ (Phaseolus vulgaris), популаран је и разноврстан укус који се ужива у разним јелима широм света. Карактеришу га живописна зелена боја и хрскава текстура, а пасуљ није само укусан додатак јелима већ је и пун есенцијалних хранљивих материја и здравствених користи.
                  Једна од истакнутих карактеристика пасуља је висок садржај влакана. Чаша куваног пасуља садржи око 4 грама влакана, што помаже дигестији, промовише осећај ситости и помаже у регулацији нивоа шећера у крви. Ово га чини одличним избором за оне који желе одржати здраву тежину или побољшати здравље дигестивног система.
                  Пасуљ је такође богат витаминима и минералима. Он је одличан извор витамина К, који игра важну улогу у здрављу костију и згрушавању крви. Такође, пружа витамин Ц, који подржава имунолошки систем и здравље коже, као и фолну киселину, која је важна за деобу ћелија и синтезу ДНК. Присуство калијума у пасуљу помаже у регулисању крвног притиска и подржава опште здравље кардиоваскуларног система.
                  Као поврће богато антиоксидансима, пасуљ садржи једињења као што су флавоноиди и каротеноиди, која помажу у заштити организма од оксидативног стреса и упале, потенцијално смањујући ризик од хроничних болести.
                  У кулинарству, пасуљ је изузетно разноврстан. Може се парити, пржити, печи или користити у запеченим јелима, салатама и прженим јелима. Његов блажи укус и хрскава текстура одлично се слажу са широким спектром састојака, чинећи га омиљеним прилогом.
                  Укратко, пасуљ је хранљива поврћа која нуди бројне здравствене користи. Његова разноврсност у кухињи и богат нутриционистички профил чине га укусним и здравим додатком свакој исхрани.`,
topic1: "Хранљиве материје и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 31,
    measurementUnits: "кцал",
    description:
      "– Низак садржај калорија, што га чини хранљивом и заситном опцијом.",
  },
  {
    element: "Масти:",
    quantity: 0.1,
    measurementUnits: "г",
    description:
      "– Врло низак садржај масти, што доприноси његовом здравом профилу.",
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0,
    measurementUnits: "г",
    description: "– Не садржи засићене масти, што подржава здравље срца.",
  },
  {
    element: "Натријум:",
    quantity: 6,
    measurementUnits: "мг",
    description:
      "– Врло низак садржај натријума, користан за управљање крвним притиском.",
  },
  {
    element: "Калијум:",
    quantity: 211,
    measurementUnits: "мг",
    description:
      "– Добар извор калијума, који је неопходан за функцију мишића и равнотежу течности.",
  },
  {
    element: "Угљени хидрати:",
    quantity: 7.1,
    measurementUnits: "г",
    description: "– Садржи угљене хидрате који пружају енергију.",
  },
  {
    element: "Влакна:",
    quantity: 3.4,
    measurementUnits: "г",
    description: "– Висок садржај влакана, која подржавају здраву дигестију.",
  },
  {
    element: "Шећер:",
    quantity: 1.5,
    measurementUnits: "г",
    description: "– Садржи мале количине природних шећера.",
  },
  {
    element: "Протеини:",
    quantity: 2.4,
    measurementUnits: "г",
    description: "– Добар извор протеина биљног порекла.",
  },
  {
    element: "Витамин Ц:",
    quantity: 12.2,
    measurementUnits: "мг",
    description:
      "– Пружа добру количину витамина Ц, важног за имунолошки систем.",
  },
  {
    element: "Калцијум:",
    quantity: 37,
    measurementUnits: "мг",
    description: "– Садржи мало калцијума, што доприноси здрављу костију.",
  },
  {
    element: "Гвожђе:",
    quantity: 1.0,
    measurementUnits: "мг",
    description:
      "– Садржи гвожђе, које је неопходно за здраву производњу црвених крвних зрнаца.",
  },
  {
    element: "Магнезијум:",
    quantity: 25,
    measurementUnits: "мг",
    description:
      "– Пружа малу количину магнезијума, који је важан за функцију мишића и нерва.",
  },
  {
    element: "Витамин К:",
    quantity: 14.4,
    measurementUnits: "µг",
    description:
      "– Садржи витамин К, који је важан за згрушавање крви и здравље костију.",
  },
  {
    element: "Витамин А:",
    quantity: 364,
    measurementUnits: "ИИ",
    description:
      "– Садржи бета-каротен, који подржава здравље вида и имунолошког система.",
  },
],
cultivationHeading:
  "Култивација пасуља захтева специфичне услове за оптималан раст и принос. Испод је преглед кључних фактора који су укључени у узгајање пасуља:",
cultivation: [
  {
    id: 801,
    topic: "Клима",
    children: [
      {
        id: 8011,
        topic: "Температура",
        text: "Пасуљ напредује у топлим температурама, идеално између 18°C и 30°C (65°F до 85°F). Осећају се осетљивим на мраз и треба их садити након последњег мраза.",
      },
      {
        id: 8012,
        topic: "Падавине",
        text: "Пасуљ захтева умерене падавине, отприлике 500 до 800 мм (20 до 31 инча) годишње. Константна влага је неопходна, посебно током цветања и развоја махуна.",
      },
    ],
  },
  {
    id: 802,
    topic: "Тло",
    children: [
      {
        id: 8021,
        topic: "pH",
        text: "Пасуљ преферира благо кисело до неутрално тло, са pH опсегом од 6.0 до 7.0.",
      },
      {
        id: 8022,
        topic: "Тип тла",
        text: "Пасуљ најбоље расте у добро дренираним, лоамским тлима богатим органским материјама. Може поднети различите врсте тла, али треба избегавати тешка глинена тла.",
      },
      {
        id: 8023,
        topic: "Припрема тла",
        text: "Пре садње, припремите тло обрадом и убацивањем органских материја као што је компост, како би се побољшала плодност и дренажа.",
      },
    ],
  },
  {
    id: 803,
    topic: "Врсте",
    text: "Популарне врсте пасуља укључују: -Буш пасуљ- (компактан раст, не треба подршка). -Пасуљ са стубовима- (потребна подршка, даје дужи род). -Пасуљ за јело- (нежне махуне које се једу у целости).",
  },
  {
    id: 804,
    topic: "Садња",
    children: [
      {
        id: 8041,
        topic: "Време",
        text: "Пасуљ се може садити касно у пролеће, када температура тла достигне најмање 15°C (59°F).",
      },
      {
        id: 8042,
        topic: "Дубина и размак",
        text: "Семе треба садити на дубину од 2 до 5 цм (0.8 до 2 инча). Размак између буш пасуља треба бити око 15 до 20 цм (6 до 8 инча), а између пасуља са стубовима 20 до 30 цм (8 до 12 инча).",
      },
      {
        id: 8043,
        topic: "Број семенки",
        text: "За оптималан раст препоручује се број семенки од 40 до 80 кг по хектару (35 до 70 фунти по акру).",
      },
    ],
  },
  {
    id: 805,
    topic: "Заливање",
    children: [
      {
        id: 8051,
        topic: "Културе које се заливају кишом",
        text: "У областима са адекватним падавинма, пасуљ може расти без додатног заливања, али и даље захтева константну влагу.",
      },
      {
        id: 8052,
        topic: "Заливајуће културе",
        text: "У сувљим подручјима, обезбедите додатно заливање, посебно током цветања и развоја махуна, како би се обезбедио висок принос.",
      },
      {
        id: 8053,
        topic: "Преливање водом",
        text: "Пасуљ не подноси услове који доводе до натапања. Осигурајте добро дренирано тло како би се спречило труљење корена.",
      },
    ],
  },
  {
    id: 806,
    topic: "Ђубрење",
    children: [
      {
        id: 8061,
        topic: "Нутријенти",
        text: "Пасуљ захтева азот, фосфор и калијум за здрав раст. Међутим, прекомерна количина азота може довести до бујног лишћа са малим бројем пасуља.",
      },
      {
        id: 8062,
        topic: "Време",
        text: "Ђубрива треба примењивати пре садње, а током сезоне раста може се применити и лагано додатно ђубрење азотом, ако је потребно.",
      },
    ],
  },
  {
    id: 807,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 8071,
        topic: "Штеточине",
        text: "Честе штеточине укључују вашице, паучне гриње и бубе пасуља. Користење покривача за редове и примена ротације усева може помоћи у контроли популација штеточина.",
      },
      {
        id: 8072,
        topic: "Болести",
        text: "Пасуљ је подложан болестима као што су рђа, прашкаста плесан и бактеријски труљење. Правилан размак, циркулација ваздуха и отпорне врсте могу помоћи у смањењу ових проблема.",
      },
    ],
  },
  {
    id: 808,
    topic: "Жетва",
    children: [
      {
        id: 8081,
        topic: "Време",
        text: "Пасуљ је обично спреман за жетву 50 до 60 дана након садње. Жњавајте када су махуне чврсте и пре него што постану превише зреле и жилаве.",
      },
      {
        id: 8082,
        topic: "Метод",
        text: "Жетва се врши руком, са пажњом да не оштетите биљку. Честа жетва подстиче наставак производње.",
      },
    ],
  },
  {
    id: 809,
    topic: "Чување",
    text: "Пасуљ се може чувати у фрижидеру до недељу дана. За дуже складиштење, може се бланширати и замрзнути.",
  },
  {
    id: 810,
    topic: "Проређивање",
    text: "Танко посејане саднице на препорученом растојању када су високе неколико инча. Ово подстиче здрав раст и смањује конкуренцију за хранљиве материје.",
  },
],
},
{
id: 9,
name: "Зелена салата",
img: vegetablesImages.butterLettuce,
inGeneralHeading: `Нежна и укусна зелена`,
inGeneral: `Зелена салата, такође позната као Lactuca sativa или путер салата, је врста салате која се одликује меканим, нежним листовима и слатким, благим укусом. Листови су обично бледо зелени до светло жути и формирају лабаву розету, што је чини популарним избором за салате и украсе.
                  Једна од главних предности зелене салате је њен висок садржај воде, што може помоћи у одржавању хидратације. Ова зелена листна поврћа су нискокалоријска, што је чини одличним избором за оне који желе да одрже здраву тежину, а ипак уживају у задовољавајућој и укусној храни.
                  Зелена салата је такође богата есенцијалним витаминима и минералима. Одличан је извор витамина К, који је кључан за здравље костију и правилно згрушавање крви. Поред тога, пружа значајне количине витамина А и Ц. Витамин А подржава здравље очију и имунски систем, док витамин Ц делује као моћан антиоксидант, штитећи ћелије од оштећења и подстичући имунски систем.
                  Штавише, зелена салата садржи корисне фито-нутријенте, укључујући лутеин и зеаксантин, који су повезани са здрављем очију и могу помоћи у смањењу ризика од старосне макуларне дегенерације.
                  У кулинарском смислу, зелена салата је невероватно свестрана. Њена нежна текстура је чини идеалном за салате, обланде и сендвиче. Такође се може користити као основа за свеже поврћне салате или као прилог уз дресинге за укусну прилогу.`,
topic1: "Нутритивне вредности и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 14,
    measurementUnits: "кцал",
    description: "– Веома ниска у калоријама, чинећи је одличним избором за управљање тежином.",
  },
  {
    element: "Масти:",
    quantity: 0.2,
    measurementUnits: "г",
    description: "– Изузетно ниска у мастима, доприноси здравој исхрани.",
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0.0,
    measurementUnits: "г",
    description: "– Не садржи засићене масти, што подстиче здравље срца.",
  },
  {
    element: "Витамин Б3 (Никотинска киселина):",
    quantity: 0.2,
    measurementUnits: "мг",
    description: "– Подржава метаболизам и доприноси здравој кожи и нервном систему.",
  },
  {
    element: "Содијум:",
    quantity: 6,
    measurementUnits: "мг",
    description: "– Веома низак у натријуму, чинећи је здравим избором за срце.",
  },
  {
    element: "Калијум:",
    quantity: 181,
    measurementUnits: "мг",
    description: "– Садржи калијум, који је есенцијалан за функцију мишића и одржавање равнотеже течности.",
  },
  {
    element: "Угљени хидрати:",
    quantity: 2.9,
    measurementUnits: "г",
    description: "– Низак у угљеним хидратима, пружа минималну енергију али је богат нутријентима.",
  },
  {
    element: "Влакна:",
    quantity: 1.0,
    measurementUnits: "г",
    description: "– Садржи дијетална влакна која помажу у варењу.",
  },
  {
    element: "Шећер:",
    quantity: 0.4,
    measurementUnits: "г",
    description: "– Садржи веома мале количине природних шећера.",
  },
  {
    element: "Протеини:",
    quantity: 1.4,
    measurementUnits: "г",
    description: "– Пружа малу количину биљних протеина.",
  },
  {
    element: "Витамин Ц:",
    quantity: 5,
    measurementUnits: "мг",
    description: "– Садржи витамин Ц, који подржава здравље имунског система.",
  },
  {
    element: "Калцијум:",
    quantity: 36,
    measurementUnits: "мг",
    description: "– Пружа малу количину калцијума, који доприноси здрављу костију.",
  },
  {
    element: "Гвожђе:",
    quantity: 0.5,
    measurementUnits: "мг",
    description: "– Садржи гвожђе, које је есенцијално за производњу црвених крвних зрнаца.",
  },
  {
    element: "Витамин А:",
    quantity: 740,
    measurementUnits: "ИИ",
    description: "– Богата је витамином А, који подстиче здравље очију и имунски систем.",
  },
  {
    element: "Фолат:",
    quantity: 70,
    measurementUnits: "мцг",
    description: "– Добар извор фолата, који је важан за синтезу ДНК и раст ћелија.",
  },
  {
    element: "Витамин К:",
    quantity: 126,
    measurementUnits: "мцг",
    description: "– Богата је витамином К, који је есенцијалан за згрушавање крви и здравље костију.",
  },
],
cultivationHeading:
  "Гајење зелене салате захтева специфичне услове за оптималан раст и квалитет листова. Ево прегледа кључних фактора који су укључени у гајење зелене салате:",
cultivation: [
  {
    id: 901,
    topic: "Клима",
    children: [
      {
        id: 9011,
        topic: "Температура",
        text: "Зелена салата напредује у хладнијим температурама, идеално између 15°C и 20°C (59°F до 68°F). Осећа се осетљиво на топлоту, што може узроковати раст цветова.",
      },
      {
        id: 9012,
        topic: "Сезона раста",
        text: "Најбоље је гајити је у пролеће и јесен, јер топле летње температуре могу негативно утицати на раст и текстуру листова.",
      },
    ],
  },
  {
    id: 902,
    topic: "Тло",
    children: [
      {
        id: 9021,
        topic: "pH",
        text: "Зелена салата претпочита добро дренирано, плодно тло са ПХ вредношћу између 6.0 и 7.0.",
      },
      {
        id: 9022,
        topic: "Тип тла",
        text: "Лоами или пешчано тло су идеални за зелену салату, пружајући добру дренажу и аерацију.",
      },
      {
        id: 9023,
        topic: "Припрема тла",
        text: "Умешајте органски материјал, као што је компост, да побољшате плоднотно и структуру тла пре садње.",
      },
    ],
  },
  {
    id: 903,
    topic: "Врсте",
    text: "Уобичајене врсте зелене салате укључују: -Путер салата- (нпр. 'Бостон,' 'Биб'), позната по нежним листовима и слатком укусу.",
  },
  {
    id: 904,
    topic: "Садња",
    children: [
      {
        id: 9041,
        topic: "Време",
        text: "Зелену салату можете директно посејати у башти или започети у затвореном. Посејте семе у рано пролеће или касну јесен за јесењи род.",
      },
      {
        id: 9042,
        topic: "Размак",
        text: "Посејте семе или пресађенке 30 цм (12 инча) једно од другог у редовима 30 до 45 цм (12 до 18 инча) удаљених.",
      },
      {
        id: 9043,
        topic: "Дубина садње",
        text: "Посејте семе 0.5 до 1 цм (0.2 до 0.4 инча) дубоко, јер семе зелене салате захтева светлост за клијање.",
      },
    ],
  },
  {
    id: 905,
    topic: "Заливање",
    children: [
      {
        id: 9051,
        topic: "Редовно заливање",
        text: "Зелена салата захтева константну влажност како би се избегао стрес. Заливајте дубоко и редовно, посебно током сувих периода.",
      },
      {
        id: 9052,
        topic: "Мулчирање",
        text: "Примените мулч да бисте задржали влагу у тлу и спречили растиње, које може конкурисати за хранљиве материје.",
      },
      {
        id: 9053,
        topic: "Избегавајте претерано заливање",
        text: "Осигурајте добру дренажу како бисте спречили труљење корена, јер је зелена салата осетљива на закишено тло.",
      },
    ],
  },
  {
    id: 906,
    topic: "Ђубрење",
    children: [
      {
        id: 9061,
        topic: "Хранљиве материје",
        text: "Зелена салата има користи од уравнотеженог ђубрива, посебно азота, који подстиче густ раст лишћа.",
      },
      {
        id: 9062,
        topic: "Време",
        text: "Ђубрите при садњи и поново усред сезоне раста како бисте одржали плодност тла.",
      },
    ],
  },
  {
    id: 907,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 9071,
        topic: "Штеточине",
        text: "Уобичајене штеточине укључују афиде, полжаве и шкољке. Користите покриваче и подстичите корисне инсекте да помогну у контроли популације штеточина.",
      },
      {
        id: 9072,
        topic: "Болести",
        text: "Зелена салата може бити погођена болестима као што су плесни плесан и труљење салате. Практикујте ротирање усјева и осигурајте добру циркулацију ваздуха како бисте смањили ризик од болести.",
      },
    ],
  },
  {
    id: 908,
    topic: "Жетва",
    children: [
      {
        id: 9081,
        topic: "Време",
        text: "Зелена салата је обично спремна за жетву за 55 до 75 дана након садње, у зависности од врсте.",
      },
      {
        id: 9082,
        topic: "Знаци зрелости",
        text: "Жњите када су главе чврсте, али не прерасле. Листови треба да буду нежни и хрскави.",
      },
      {
        id: 9083,
        topic: "Рукавице",
        text: "Ручно берите зелену салату пажљиво да бисте избегли модрице. Одмах је охладите како бисте одржали свежину.",
      },
    ],
  },
  {
    id: 909,
    topic: "Чување",
    text: "Чувајте убрану зелену салату на хладном и тамном месту или у фрижидеру. Најбоље је конзумирати свежу, али може издржати око недељу дана ако се правилно чува.",
  },
]},

{
    id: 10,
name: "Лук",
img: vegetablesImages.onion,
inGeneralHeading: `Ароматичан и нутритивно богат основни састојак`,
inGeneral: `Лук, научно познат као Allium cepa, представља основни састојак у кулинарству широм света, ценjen због свог оштрог мириса, јаког укуса и дубине коју додаје широком спектру јела. Без обзира да ли се користи свеже у салатама, карамелизован у сосовима или пржено у супама и чорбама, лук доноси богату, слану нотну која побољшава и једноставна и сложена јела.
                    Поред своје кулинарске свестраности, лук нуди низ здравствених предности захваљујући свом импресивном нутритивном профилу. Лук је низак у калоријама, али богат важним хранљивим материјама, посебно витамином Ц, који подржава функцију имуног система, производњу колагена и здравље коже. Такође садржи витамин Б6, који је важан за метаболизам и здравље мозга, и фолну киселину, која подржава раст и поправку ћелија.
                    Лук је посебно богат антиоксидансима, укључујући кверцетин, моћан флавоноид који има антиинфламаторна и антиканцерогена својства. Кверцетин помаже у смањењу оксидативног стреса у организму, што може смањити ризик од хроничних болести као што су срчана обољења и одређени облика рака. Лук такође садржи сумпорне компаундове, који су одговорни за његов јак мирис и доприносе његовим здравственим ефектима, као што је побољшање кардиоваскуларног здравља смањењем нивоа холестерола и крвног притиска.
                    Поред тога, лук је добар извор влакана, што подстиче здравље дигестивног система подржавајући редовне покрете црева и хранећи корисне бактерије у цревима.
                    Кулинарски гледано, лук је невероватно свестран. Може се јести свеже за оштар, љуткаст укус или кувати да би се изразила његова природна слаткоћа и нежност.
                    Укратко, лук је нутритивно богат и ароматичан поврће које нуди широк спектар здравствених предности. Његова способност да побољша укус и нутритивну вредност јела чини га основним састојком у кухињама широм света.`,
topic1: "Нутритивна вредност и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 40,
    measurementUnits: "ккал",
    description: "– Низак у калоријама, чинећи га укусним додатком многим јелима.",
  },
  {
    element: "Масти:",
    quantity: 0.1,
    measurementUnits: "г",
    description: "– Веома низак у мастима, доприноси његовом здравственом профилу.",
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0,
    measurementUnits: "г",
    description: "– Не садржи засићене масти, што подстиче здравље срца.",
  },
  {
    element: "Натријум:",
    quantity: 4,
    measurementUnits: "мг",
    description: "– Веома низак у натријуму, користан за управљање крвним притиском.",
  },
  {
    element: "Калијум:",
    quantity: 146,
    measurementUnits: "мг",
    description: "– Добар извор калијума, важан за функцију мишића и равнотежу течности.",
  },
  {
    element: "Угљени хидрати:",
    quantity: 9.3,
    measurementUnits: "г",
    description: "– Садржи угљене хидрате који пружају енергију.",
  },
  {
    element: "Влакна:",
    quantity: 1.7,
    measurementUnits: "г",
    description: "– Извор дијеталних влакана, подстиче здраву дигестију.",
  },
  {
    element: "Шећери:",
    quantity: 4.2,
    measurementUnits: "г",
    description: "– Садржи природне шећере, који доприносе његовој слаткоћи.",
  },
  {
    element: "Протеини:",
    quantity: 1.1,
    measurementUnits: "г",
    description: "– Пружа малу количину биљних протеина.",
  },
  {
    element: "Витамин Ц:",
    quantity: 7.4,
    measurementUnits: "мг",
    description: "– Пружа извор витамина Ц, важан за функцију имуног система.",
  },
  {
    element: "Калцијум:",
    quantity: 33,
    measurementUnits: "мг",
    description: "– Садржи малу количину калцијума, што доприноси здрављу костију.",
  },
  {
    element: "Гвожђе:",
    quantity: 0.2,
    measurementUnits: "мг",
    description: "– Садржи трагове гвожђа, неопходног за здраву производњу црвених крвних зрнаца.",
  },
  {
    element: "Магнезијум:",
    quantity: 10,
    measurementUnits: "мг",
    description: "– Пружа малу количину магнезијума, важног за функцију мишића и нервног система.",
  },
  {
    element: "Цинк:",
    quantity: 0.17,
    measurementUnits: "мг",
    description: "– Садржи трагове цинка, који подржава функцију имуног система.",
  },
  {
    element: "Витамин Б6:",
    quantity: 0.12,
    measurementUnits: "мг",
    description: "– Важан за метаболизам протеина и здравље мозга.",
  },
  {
    element: "Фолна киселина:",
    quantity: 19,
    measurementUnits: "µg",
    description: "– Пружа малу количину фолне киселине, која је важна за дељење и раст ћелија.",
  },
],
cultivationHeading:
  "Гајење лука захтева специфичне услове за оптималан раст и принос. Испод је преглед кључних фактора који су укључени у гајење лука:",
cultivation: [
  {
    id: 901,
    topic: "Клима",
    children: [
      {
        id: 9011,
        topic: "Температура",
        text: "Лук најбоље расте у умереној клими са идеалним температурама у распону од 13°C до 24°C (55°F до 75°F). Осетљив је на екстремну врућину и хладноћу.",
      },
      {
        id: 9012,
        topic: "Падавине",
        text: "Лук захтева умерене падавине од око 500 до 700 мм (20 до 28 инча) годишње. Континуирана влага је кључна, посебно током формирања луковица.",
      },
    ],
  },
  {
    id: 902,
    topic: "Тло",
    children: [
      {
        id: 9021,
        topic: "pH",
        text: "Лук претпочита благо кисела до неутрална тла са pH вредношћу у распону од 6.0 до 7.0.",
      },
      {
        id: 9022,
        topic: "Тип тла",
        text: "Лук најбоље расте у добро дренираним, ломи земљиштима богатим органским материјама. Тешка земљишта треба избегавати, јер могу задржати превише влаге.",
      },
      {
        id: 9023,
        topic: "Припрема тла",
        text: "Пре садње, тло треба обрадити и обогатити органским материјама као што је компост, како би се побољшала плодност и дренажа.",
      },
    ],
  },
  {
    id: 903,
    topic: "Врсте",
    text: "Уобичајене врсте лука укључују: -Жути лук- (одличан за кување и складиштење). -Црвени лук- (често се користи свеже у салатама и салсима). -Бели лук- (млађи укус, добар за разна јела).",
  },
  {
    id: 904,
    topic: "Садња",
    children: [
      {
        id: 9041,
        topic: "Време",
        text: "Лук се може садити у рано пролеће или јесен, у зависности од врсте и климе. За лук са луковицама, садити у пролеће после последњег мраза.",
      },
      {
        id: 9042,
        topic: "Дубина и размаци",
        text: "Сетови лука треба да се саде на дубини од око 2.5 см (1 инч) и размаци између 10 до 15 см (4 до 6 инча), са растојањем између редова око 30 см (12 инча).",
      },
      {
        id: 9043,
        topic: "Кретање семена",
        text: "За оптималан раст, препоручује се сјеменска количина од око 30 до 60 кг по хектару (27 до 54 фунти по акру).",
      },
    ],
  },
  {
    id: 905,
    topic: "Заливање",
    children: [
      {
        id: 9051,
        topic: "Кишно храњење усева",
        text: "У подручјима са довољним падавинама, лук се може гајити као усев који се напаја кишницом, али константна влага је и даље кључна.",
      },
      {
        id: 9052,
        topic: "Ирригирани усеви",
        text: "У сушнијим областима, потребно је додатно заливање, посебно током фазе формирања луковица.",
      },
      {
        id: 9053,
        topic: "Заливеност",
        text: "Лук не подноси водену стагнацију. Потребно је обезбедити добру дренажу како би се спречила труљење корена и друге болести.",
      },
    ],
  },
  {
    id: 906,
    topic: "Ђубрење",
    children: [
      {
        id: 9061,
        topic: "Хранљиве материје",
        text: "Лук захтева азот, фосфор и калијум за здрав раст. Азот је посебно важан током раних фаза раста.",
      },
      {
        id: 9062,
        topic: "Време",
        text: "Ђубрива треба применити приликом садње и додатно на ђубрење током раста, посебно када почињу да се формирају луковице.",
      },
    ],
  },
  {
    id: 907,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 9071,
        topic: "Штеточине",
        text: "Уобичајени штеточини који нападају лук укључују лукове мухе, трхе и афиде. Примена ротирања усева и коришћење баријера против инсеката може помоћи у контроли ових штеточина.",
      },
      {
        id: 9072,
        topic: "Болести",
        text: "Лук је подложан болестима као што су долејева плавичаста плесан, лукови трулеж и бела трулеж. Са садњом отпорних сорти и добром хигијеном може се смањити ови ризици.",
      },
    ],
  },
  {
    id: 908,
    topic: "Жетва",
    children: [
      {
        id: 9081,
        topic: "Време",
        text: "Лук је обично спреман за жетву када врхови почну да жуте и падну, обично 100 до 120 дана после садње.",
      },
      {
        id: 9082,
        topic: "Метода",
        text: "Жетву лука треба извршити пажљиво извлачењем из тла или уз помоћ пика. Осушите луковице у сувом и добро проветреном простору како би се продужио животни век складиштења.",
      },
    ],
  },
  {
    id: 909,
    topic: "Складиштење",
    text: "Лук треба складиштити на хладном, сувом месту са добром циркулацијом ваздуха. Добро осушени лукови могу трајати неколико месеци.",
  },
  {
    id: 910,
    topic: "Проређивање",
    text: "Ако се саде из семена, треба проређивати саднице до препорученог размаке када постану неколико инча високе како би се смањила конкуренција и подстакнуо здрав развој луковица.",
  },
],
},
{
    id: 11,
name: "Грашак",
img: vegetablesImages.peas,
inGeneralHeading: `Хранљиви и свестрани махунар`,
inGeneral: `Грашак, научно познат као Pisum sativum, популарна је махунарка која се ужива због свог слатког укуса, нежне текстуре и свестраности у широком спектру јела. Било да се једе свеж, замрзнут или сушен, грашак је хранљива храна која нуди различите здравствене користи, чинећи га стандардним састојком у многим исхранама широм света.
                Једна од кључних хранљивих предности грашка је висок садржај протеина, што га чини одличним извором биљних протеина, посебно за вегетаријанце и вегане. Поред протеина, грашак је богат дијеталним влакнима, која подржава здравље варења промовишући редовне покрете црева и хранећи корисне бактерије у цревима. Садржај влакана у грашку такође помаже у регулисању нивоа шећера у крви, чинећи га добрим избором за оне који управљају дијабетесом.
                Грашак је такође богат есенцијалним витаминима и минералима. Одличан је извор витамина Ц и К, који играју важну улогу у функцији имуног система, здрављу коже и јачини костију. Поред тога, грашак садржи различите витамине Б, укључујући фолат, који је кључан за деобу ћелија и синтезу ДНК, што га чини посебно корисним за труднице.
                Антиоксиданти, као што су флавоноиди, каротеноиди и полифеноли, присутни су у великој количини у грашку, помажући у смањењу упале и заштити од хроничних болести као што су срчана обољења и неке врсте рака.
                У кулинарству, грашак је изузетно свестран. Може се јести свеж у салатама, куван или парен као прилог, додавати у супе, гуљаше и касероле или мешати у пире и сосеве. Његова блага слаткоћа чини га дивним додатком многим сланим јелима.
                Укратко, грашак је веома хранљива махунарка пуна протеина, влакана, витамина и антиоксиданата. Његова свестраност и здравствене користи чине га одличним додатком балансираној исхрани.`,
topic1: "Хранљивост и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 81,
    measurementUnits: "ккал",
    description:
      "– Низак у калоријама, чинећи га хранљивим додатком оброцима.",
  },
  {
    element: "Масти:",
    quantity: 0.4,
    measurementUnits: "г",
    description: "– Врло низак у мастима, доприносећи здрављу срца.",
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0.1,
    measurementUnits: "г",
    description:
      "– Садржи минималне количине засићених масних киселина, промовишући опште здравље.",
  },
  {
    element: "Витамин Б3 (Ниацин):",
    quantity: 2.1,
    measurementUnits: "мг",
    description:
      "– Важан за метаболизам енергије и подржава здравље коже.",
  },
  {
    element: "Натријум:",
    quantity: 5,
    measurementUnits: "мг",
    description:
      "– Врло низак у натријуму, користан за управљање крвним притиском.",
  },
  {
    element: "Калијум:",
    quantity: 244,
    measurementUnits: "мг",
    description:
      "– Добар извор калијума, есенцијалног за функцију мишића и нерва.",
  },
  {
    element: "Угљени хидрати:",
    quantity: 14.5,
    measurementUnits: "г",
    description: "– Пружа сложене угљене хидрате за одржавану енергију.",
  },
  {
    element: "Влакна:",
    quantity: 5.7,
    measurementUnits: "г",
    description: "– Богат је дијеталним влакнима, која промовишу здравље варења.",
  },
  {
    element: "Шећер:",
    quantity: 5.7,
    measurementUnits: "г",
    description:
      "– Садржи природне шећере, који доприносе њиховом слатком укусу.",
  },
  {
    element: "Протеини:",
    quantity: 5.4,
    measurementUnits: "г",
    description:
      "– Добар извор биљних протеина, који подржавају обнову мишића.",
  },
  {
    element: "Витамин Ц:",
    quantity: 40,
    measurementUnits: "мг",
    description:
      "– Садржи витамин Ц, важан за имунолошку функцију и здравље коже.",
  },
  {
    element: "Калцијум:",
    quantity: 18,
    measurementUnits: "мг",
    description:
      "– Пружа малу количину калцијума, који доприноси здрављу костију.",
  },
  {
    element: "Гвожђе:",
    quantity: 1.5,
    measurementUnits: "мг",
    description:
      "– Садржи гвожђе, које је есенцијално за транспорт кисеоника у крви.",
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.2,
    measurementUnits: "мг",
    description: "– Подржава метаболизам енергије и функцију нерва.",
  },
  {
    element: "Витамин Б6:",
    quantity: 0.1,
    measurementUnits: "мг",
    description: "– Учествује у развоју и функцији мозга.",
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.2,
    measurementUnits: "мг",
    description:
      "– Игра улогу у производњи енергије и ћелијској функцији.",
  },
  {
    element: "Магнезијум:",
    quantity: 25,
    measurementUnits: "мг",
    description:
      "– Садржи магнезијум, есенцијалан за функцију мишића и нерва.",
  },
  {
    element: "Цинк:",
    quantity: 1.2,
    measurementUnits: "мг",
    description:
      "– Садржи цинк, који подржава имунолошку функцију и зарастање рана.",
  },
  {
    element: "Витамин А:",
    quantity: 765,
    measurementUnits: "ИУ",
    description:
      "– Добар извор витамина А, који промовише здравље вида и коже.",
  },
],
cultivationHeading:
      "Одгајање грашка захтева специфичне услове за оптималан раст и принос. Испод је преглед кључних фактора који утичу на узгој грашка:",
    cultivation: [
      {
        id: 2001,
        topic: "Клима",
        children: [
          {
            id: 2002,
            topic: "Температура",
            text: "Грашак расте у хладном времену, са идеалним температурама од 10°C до 20°C (50°F до 68°F). Отпоран је на мраз и може се садити рано пролеће.",
          },
          {
            id: 2003,
            topic: "Падавине",
            text: "Грашак захтева умерене падавине, обично између 500 и 700 мм (20 до 28 инча) годишње. Континуирана влага је кључна, посебно током цветања и развоја махуна.",
          },
        ],
      },
      {
        id: 2004,
        topic: "Тло",
        children: [
          {
            id: 2005,
            topic: "pH",
            text: "Грашак преферира благо кисело до неутрално тло са pH вредношћу од 6.0 до 7.5.",
          },
          {
            id: 2006,
            topic: "Тип тла",
            text: "Најбоље расте у добро дренираним, лоамским тловима богатим органским материјама. Треба избегавати тешка глиновита тла која задржавају превише влаге, што може довести до труљења корена.",
          },
          {
            id: 2007,
            topic: "Припрема тла",
            text: "Пре садње, тло треба обрадити и обогатити компостом или добро распаднутим стајњаком како би се побољшала плодноса и дренажа.",
          },
        ],
      },
      {
        id: 2008,
        topic: "Врсте",
        text: "Уобичајене врсте грашка укључују: -Грађански грашак- (слатка и нежна, често се једе свежа или замрзнута). -Снапи грашак- (јестиве махуне са слатким укусом, могу се јести сирове). -Снежни грашак- (равне махуне које су такође јестиве, користе се у прженим јелима).",
      },
      {
        id: 2009,
        topic: "Садња",
        children: [
          {
            id: 2010,
            topic: "Време",
            text: "Грашак се обично садити рано пролеће чим тло постане обрадиво. У топлијим климатским условима, може се садити и јесен за зимску бербу.",
          },
          {
            id: 2011,
            topic: "Дубина и растојање",
            text: "Садите семе грашка на дубину од 2 до 5 цм (0.8 до 2 инча) и размакните их 5 до 10 цм (2 до 4 инча), са редовима размакнутим око 30 до 60 цм (12 до 24 инча).",
          },
          {
            id: 2012,
            topic: "Квота семена",
            text: "Препоручује се квота семена од приближно 60 до 120 кг по хектару (50 до 100 фунти по акру) за оптималан принос.",
          },
        ],
      },
      {
        id: 2013,
        topic: "Заливање",
        children: [
          {
            id: 2014,
            topic: "Културе са падавинама",
            text: "У областима са адекватним падавинама, грашак се може гајити као култура која се напаја падавинама, али је константна влага неопходна за добар развој махуна.",
          },
          {
            id: 2015,
            topic: "Наводњаване културе",
            text: "У сушнијим подручјима, може бити потребно додатно наводњавање, посебно током фазе цветања и пуњења махуна.",
          },
          {
            id: 2016,
            topic: "Преливање водом",
            text: "Грашак не подноси прекомерно наводњавање. Осигурајте да су њиве добро дрениране како би се спречиле болести корена.",
          },
        ],
      },
      {
        id: 2017,
        topic: "Ђубрење",
        children: [
          {
            id: 2018,
            topic: "Нутријенти",
            text: "Грашак обично захтева мање ђубрива од других култура. Користи бактерије које везују азот и претварају атмосферски азот у облик који биљке могу искористити.",
          },
          {
            id: 2019,
            topic: "Време",
            text: "Лака примена уравнотеженог ђубрива може се применити при садњи, са додатним нутријентима који се додају по потреби током вегетације.",
          },
        ],
      },
      {
        id: 2020,
        topic: "Контрола штеточина и болести",
        children: [
          {
            id: 2021,
            topic: "Штеточине",
            text: "Уобичајени штеточини који погађају грашак укључују афиде, грашкове жичаре и гусенице. Примена ротације култура и садња у компањији могу помоћи у управљању популацијама штеточина.",
          },
          {
            id: 2022,
            topic: "Болести",
            text: "Грашак је подложан болестима као што су прашкаста пламењача, долњи пламењач и труљење корена. Коришћење сорти отпорних на болести и примена правилне ротације култура може помоћи у управљању овим проблемима.",
          },
        ],
      },
      {
        id: 2023,
        topic: "Берба",
        children: [
          {
            id: 2024,
            topic: "Време",
            text: "Грашак се обично бере 60 до 70 дана након садње, у зависности од сорте. Берба се врши када су махуне пуне и нежне.",
          },
          {
            id: 2025,
            topic: "Метод",
            text: "Берба се врши тако што се махуне откидају са биљке или се користе маказе да их се одсече, водећи рачуна да не оштетите биљке.",
          },
        ],
      },
      {
        id: 2026,
        topic: "Чување",
        text: "Свеже убрані грашак треба чувати у фрижидеру и потрошити у року од неколико дана ради оптималног укуса. За дуготрајно чување, могу се бланширати и замрзнути.",
      },
      {
        id: 2027,
        topic: "Разређивање",
        text: "Ако се сади из семена, треба разређити саднице на препорученом размаку како би се смањила конкуренција и подстакао здрав раст.",
      },
    ],
},
{
    id: 12,
    name: "Слатке паприке",
    img: vegetablesImages.sweetPeppers,
    inGeneralHeading: `Шарени и нутритивно богате поврће`,
    inGeneral: `Слатке паприке, често називане и паприкама (Capsicum annuum), су живописно, хрскаво поврће које долази у разним бојама, укључујући зелену, црвену, жуту и наранџасту. Познате по свом благом, слатком укусу, слатке паприке су основни састојак у многим кухињама због своје свестраности и импресивног нутритивног профила.
                    Једна од најистакнутијих нутритивних карактеристика слатких паприка је висок садржај витамина Ц. Заправо, црвене паприке су посебно један од најбогатијих извора витамина Ц, који пружа више од 150% дневне препоручене количине само у једном оброку. Овај моћан антиоксиданс помаже у подршци имунолошком систему, промовише здраву кожу помоћу производње колагена и штити тело од слободних радикала. Слатке паприке су такође значајан извор витамина А, посебно у црвеним и наранџастим сортама, захваљујући садржају бета-каротена. Витамин А је важан за одржавање здравог вида, коже и имунолошког система.
                    Поред витамина А и Ц, слатке паприке пружају и низ других важних нутријената као што су витамин Б6, фолат и калијум. Ови нутријенти подржавају метаболизам, здравље мозга и функцију мишића, док њихов садржај влакана помаже у дигестији и промовише ситост, чинећи их корисним за управљање тежином.
                    У кулинарском смислу, слатке паприке су изузетно свестране. Њихова хрскава текстура и суптилни слатки укус чине их савршеним за јело сирове у салатама, у пратњи хумуса или у сендвичима. Такође могу бити печени, гриљани, пржени или пуњени за прављење разних укусних јела.
                    Укратко, слатке паприке су нутритивно богат, нискокалоријски поврће које доноси и укус и здравствене користи на сто. Њихове живописне боје, уз свестраност у кухињи, чине их укусним и вредним додатком свакој исхрани.`,
    topic1: "Нутриција и здравље",
    nutritionText: [
      {
        element: "Енергетска вредност:",
        quantity: 31,
        measurementUnits: "ккал",
        description:
          "– Нискокалоричне, што их чини здравим и укусним додатком оброцима.",
      },
      {
        element: "Масти:",
        quantity: 0.3,
        measurementUnits: "г",
        description:
          "– Врло ниске у садржају масти, што доприноси њиховом здравом профилу.",
      },
      {
        element: "Засићене масне киселине:",
        quantity: 0.1,
        measurementUnits: "г",
        description:
          "– Садрже минималне количине засићених масти, што подржава здравље срца.",
      },
      {
        element: "Натријум:",
        quantity: 3,
        measurementUnits: "мг",
        description:
          "– Врло ниске количине натријума, корисне за контролу крвног притиска.",
      },
      {
        element: "Калијум:",
        quantity: 211,
        measurementUnits: "мг",
        description:
          "– Добар извор калијума, неопходан за функцију мишића и равнотежу течности.",
      },
      {
        element: "Угљени хидрати:",
        quantity: 6.0,
        measurementUnits: "г",
        description: "– Садрже угљене хидрате који пружају енергију.",
      },
      {
        element: "Влакна:",
        quantity: 2.1,
        measurementUnits: "г",
        description:
          "– Извор дијететских влакана која подстичу здраву дигестију.",
      },
      {
        element: "Шећери:",
        quantity: 4.2,
        measurementUnits: "г",
        description:
          "– Садрже природне шећере који доприносе њиховом слатком укусу.",
      },
      {
        element: "Протеини:",
        quantity: 1.0,
        measurementUnits: "г",
        description: "– Пружају малу количину протеина биљног порекла.",
      },
      {
        element: "Витамин Ц:",
        quantity: 80.4,
        measurementUnits: "мг",
        description:
          "– Изузетан извор витамина Ц, важан за имунолошки систем и здравље коже.",
      },
      {
        element: "Калцијум:",
        quantity: 10,
        measurementUnits: "мг",
        description:
          "– Пружа малу количину калцијума, који доприноси здрављу костију.",
      },
      {
        element: "Железо:",
        quantity: 0.4,
        measurementUnits: "мг",
        description:
          "– Садржи трагове жељеза, које је неопходно за здраву производњу црвених крвних зрнаца.",
      },
      {
        element: "Магнезијум:",
        quantity: 12,
        measurementUnits: "мг",
        description:
          "– Пружа малу количину магнезијума, који је важан за функцију мишића и нерва.",
      },
      {
        element: "Цинк:",
        quantity: 0.2,
        measurementUnits: "мг",
        description:
          "– Садржи трагове цинка који подржавају имунолошки систем.",
      },
      {
        element: "Витамин Б6:",
        quantity: 0.2,
        measurementUnits: "мг",
        description:
          "– Важан за метаболизам протеина и здравље мозга.",
      },
      {
        element: "Витамин А:",
        quantity: 157,
        measurementUnits: "µг",
        description:
          "– Богат бета-каротеном, који подржава вид и здравље имунолошког система.",
      },
    ],
    cultivationHeading:
      "Гајење слатких паприка захтева специфичне услове за оптималан раст и принос. Испод је преглед кључних фактора који су укључени у гајење слатких паприка:",
    cultivation: [
      {
        id: 1001,
        topic: "Клима",
        children: [
          {
            id: 1001,
            topic: "Температура",
            text: "Слатке паприке најбоље расту у топлим климатским условима, са идеалним температурама између 20°C и 30°C (68°F до 86°F). Оне су осетљиве на мраз и треба их садити након последњег мраза.",
          },
          {
            id: 1002,
            topic: "Падавине",
            text: "Слатке паприке захтевају константну влагу, са падавинама од око 500 до 750 мм (20 до 30 инча) годишње. Адекватна вода је кључна током цветања и формирања плода.",
          },
        ],
      },
      {
        id: 1002,
        topic: "Тло",
        children: [
          {
            id: 1003,
            topic: "pH",
            text: "Слатке паприке воле благо кисела до неутрална тла са pH вредностима између 6.0 и 7.0.",
          },
          {
            id: 1004,
            topic: "Тип тла",
            text: "Најбоље расту у добро дренираним, лојним земљиштима богатим органским материјама. Тврда глине треба избегавати, јер могу задржавати превише влаге.",
          },
          {
            id: 1005,
            topic: "Припрема тла",
            text: "Пре садње, тло треба обрадити и обогатити органским материјама, као што су компост или добро разградљени стајњак, како би се побољшала плодност.",
          },
        ],
      },
      {
        id: 1006,
        topic: "Сорте",
        text: "Честе сорте слатких паприка укључују: - Белле Паприке - (велике, слатке паприке доступне у различитим бојама). - Кубанеле Паприке - (блажи укус, често се користе у кувању). - Банана Паприке - (дужи, жути плодови са слатким укусом).",
      },
      {
        id: 1007,
        topic: "Садња",
        children: [
          {
            id: 1008,
            topic: "Време",
            text: "Слатке паприке се обично почињу гајити унутар 8 до 10 недеља пре последњег мраза и пресађују се на отвореном након што мраз прође.",
          },
          {
            id: 1009,
            topic: "Дубина и растојање",
            text: "Саднице слатких паприка треба садити на дубину од 5 до 7,5 цм (2 до 3 инча) и распоредити их на растојању од 45 до 60 цм (18 до 24 инча), са растојањем између редова од око 90 цм (36 инча).",
          },
          {
            id: 1010,
            topic: "Број садница",
            text: "Препоручује се садња око 25.000 до 30.000 биљака по хектару (10.000 до 12.000 биљака по акру) за оптималан принос.",
          },
        ],
      },
      {
        id: 1011,
        topic: "Заливање",
        children: [
          {
            id: 1012,
            topic: "Падавине као извор воде",
            text: "У областима са довољним падавинама, слатке паприке се могу гајити као усеви који се заливају природним падавинама, али константна влага је од виталног значаја за добар развој плода.",
          },
          {
            id: 1013,
            topic: "Иригирани усеви",
            text: "У сувљим регионима, потребна је додатна иримација, посебно током цветања и плодоношења.",
          },
          {
            id: 1014,
            topic: "Плављење",
            text: "Слатке паприке не подносе претерано наводњавање. Обезбедите добро дренирано тло како бисте спречили болести корена.",
          },
        ],
      },
      {
        id: 1015,
        topic: "Ђубрење",
        children: [
          {
            id: 1016,
            topic: "Нутријенти",
            text: "Слатке паприке захтевају азот, фосфор и калијум за здрав раст. Азот је посебно важан током вегетативне фазе.",
          },
          {
            id: 1017,
            topic: "Термини ђубрења",
            text: "Ђубрива треба примењивати при садњи и током раста како би се обезбедила адекватна доступност нутријената.",
          },
        ],
      },
      {
        id: 1018,
        topic: "Контрола штеточина и болести",
        children: [
          {
            id: 1019,
            topic: "Штеточине",
            text: "Уобичајене штеточине које нападају слатке паприке укључују афиде, паукове гриње и трпотке. Примена интегрисаног управљања штеточинама (IPM) може помоћи у управљању овим популацијама.",
          },
          {
            id: 1020,
            topic: "Болести",
            text: "Слатке паприке су подложне болестима као што су бактеријска пегавост, брашњаста пламењача и труљење крајева цветова. Примена ротације усева и коришћење отпорних сорти може помоћи у управљању овим проблемима.",
          },
        ],
      },
      {
        id: 1021,
        topic: "Жетва",
        children: [
          {
            id: 1022,
            topic: "Време",
            text: "Слатке паприке се обично беру 60 до 90 дана након пресађивања, у зависности од сорте и условâ раста. Жетење се обавља када су плодови чврсти и потпуно обојени.",
          },
          {
            id: 1023,
            topic: "Метод",
            text: "Слатке паприке треба брати тако што се одсеку са биљке оштрим ножем или шкарпама, избегавајући оштећење биљке или других плодова.",
          },
        ],
      },
      {
        id: 1024,
        topic: "Складиштење",
        text: "Слатке паприке треба чувати на хладном и сувом месту. Могу се чувати у фрижидеру до 1-2 недеље. Правилно складиштење помаже у одржавању свежине и укуса.",
      },
      {
        id: 1025,
        topic: "Размножавање",
        text: "Ако су посејане из семена, потребно је размастити саднице на препорученом растојању како би се смањила конкуренција и подстакло здраво развијање плодова.",
      },
    ],
},
{
    id: 13,
name: "Кромпир",
img: vegetablesImages.potatoes,
inGeneralHeading: `Свестни и хранљиви скроб`,
inGeneral: `Кромпир, научно познат као Solanum tuberosum, један је од највише конзумираних поврћа на свету. Са својом скробном текстуром и неутралним укусом, кромпир служи као свестрана основа за бројне јела у разним кухињама. Кромпир се може припремити на различите начине — куван, пире, печен, пржен или печени — чинећи га основним састојком у многим домаћинствима.
                    Хранљиво, кромпир је богат угљеним хидратима, пре свега у облику скроба, који обезбеђује брз извор енергије. Они су нискокалорични када се припремају без додатних масти и одличан су извор виталних витамина и минерала. Средњи кромпир са кожом обезбеђује значајне количине витамина Ц, који подржава имунски систем и здравље коже, као и витамина Б6, који игра улогу у метаболизму и здрављу мозга. Кромпир такође садржи калијум, важан минерал за здравље срца, функцију мишића и баланс течности у телу.
                    Упркос својој репутацији као скробни, кромпир је такође добар извор дијеталних влакана, посебно ако се кора не уклони. Влакна помажу варењу, помажу у регулисању нивоа шећера у крви и доприносе осећају ситости, чинећи кромпир задовољавајућом храном.
                    У кулинарском смислу, кромпир је изузетно свестран. Може се користити у супама, чорбама, кавијама, салатама, па чак и десертима. Различите врсте као што су русет, Јукон голд и црвени кромпир имају јединствене текстуре и укусе, што их чини погодним за различите методе кувања.
                    Укратко, кромпир је хранљиво богат, свестран поврће који обезбеђује основну енергију и низ здравствених користи. Његова способност да компонује различита јела и кухиње чини га волљеним основним састојком широм света.`,
topic1: "Храна и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 77,
    measurementUnits: "кцал",
    description:
      "– Нискокалорична храна која обезбеђује добар извор енергије.",
  },
  {
    element: "Масти:",
    quantity: 0.1,
    measurementUnits: "г",
    description: "– Веома низак садржај масти, што доприноси здравој исхрани.",
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0.03,
    measurementUnits: "г",
    description:
      "– Садржи минималне количине засићених масти, што промовише свеукупно здравље.",
  },
  {
    element: "Витамин Б3 (Нијасин):",
    quantity: 1.4,
    measurementUnits: "мг",
    description:
      "– Подржава метаболизам и важан је за одржавање здраве коже.",
  },
  {
    element: "Натријум:",
    quantity: 6,
    measurementUnits: "мг",
    description:
      "– Веома низак садржај натријума, користан за управљање крвним притиском.",
  },
  {
    element: "Калијум:",
    quantity: 425,
    measurementUnits: "мг",
    description:
      "– Добар извор калијума, који је есенцијалан за функцију мишића и нерва.",
  },
  {
    element: "Угљени хидрати:",
    quantity: 17.6,
    measurementUnits: "г",
    description:
      "– Богат угљеним хидратима, који обезбеђују брз извор енергије.",
  },
  {
    element: "Влакна:",
    quantity: 2.2,
    measurementUnits: "г",
    description: "– Садржи дијетална влакна, која подржавају здравље дигестивног система.",
  },
  {
    element: "Шећер:",
    quantity: 0.8,
    measurementUnits: "г",
    description:
      "– Садржи минималне природне шећере, чинећи га храном са ниским садржајем шећера.",
  },
  {
    element: "Протеини:",
    quantity: 2.0,
    measurementUnits: "г",
    description: "– Обезбеђује умерену количину биљних протеина.",
  },
  {
    element: "Витамин Ц:",
    quantity: 19.7,
    measurementUnits: "мг",
    description:
      "– Добар извор витамина Ц, који је важан за имунски систем и здравље коже.",
  },
  {
    element: "Калцијум:",
    quantity: 12,
    measurementUnits: "мг",
    description:
      "– Обезбеђује малу количину калцијума, који доприноси здрављу костију.",
  },
  {
    element: "Гвожђе:",
    quantity: 0.81,
    measurementUnits: "мг",
    description:
      "– Садржи гвожђе, које је потребно за здраву производњу црвених крвних зрнаца.",
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.08,
    measurementUnits: "мг",
    description: "– Подржава метаболизам енергије и функцију нерва.",
  },
  {
    element: "Витамин Б6:",
    quantity: 0.3,
    measurementUnits: "мг",
    description: "– Учествује у здрављу мозга и подржава метаболизам.",
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.02,
    measurementUnits: "мг",
    description:
      "– Игра улогу у производњи енергије и ћелијској функцији.",
  },
  {
    element: "Магнезијум:",
    quantity: 23,
    measurementUnits: "мг",
    description:
      "– Садржи магнезијум, који је есенцијалан за функцију мишића и нерва.",
  },
  {
    element: "Цинк:",
    quantity: 0.29,
    measurementUnits: "мг",
    description:
      "– Садржи цинк, који подржава имунски систем и зарастање рана.",
  },
  {
    element: "Витамин А:",
    quantity: 2,
    measurementUnits: "IU",
    description:
      "– Садржи малу количину витамина А, који доприноси здрављу вида.",
  },
],
cultivationHeading:
  "Оглед кромпира захтева специфичне услове за оптималан раст и принос. Испод је преглед кључних фактора који су укључени у узгој кромпира:",
cultivation: [
  {
    id: 3001,
    topic: "Клима",
    children: [
      {
        id: 3002,
        topic: "Температура",
        text: "Кромпир расте у хладним до умереним климатским условима. Идеалне температуре су између 15°C и 20°C (59°F до 68°F). Могу поднети мраз, али температуре испод 0°C (32°F) могу оштетити клубенке.",
      },
      {
        id: 3003,
        topic: "Падавине",
        text: "Кромпир захтева константну влажност, обично око 600 до 800 мм (24 до 31 инча) падавина годишње. Довољно воде је кључно током формирања и развоја клубенки.",
      },
    ],
  },
  {
    id: 3004,
    topic: "Тло",
    children: [
      {
        id: 3005,
        topic: "pH",
        text: "Кромпир преферира благо кисела до неутрална тла са pH опсегом од 5.0 до 7.0.",
      },
      {
        id: 3006,
        topic: "Тип тла",
        text: "Најбоље расте у добро дренираним, лојним тлима богата органским материјама. Избегавајте тешка глином тла која могу задржати вишак влаге, што доводи до труљења.",
      },
      {
        id: 3007,
        topic: "Припрема тла",
        text: "Пре садње, тло треба обрадити и обогатити компостом или добро одмрљеним стајњаком како би се побољшала плодност и структура.",
      },
    ],
  },
  {
    id: 3008,
    topic: "Врсте",
    text: "Уобичајене врсте кромпира укључују: -Русет- (популаран за печење и пржење). -Јукон Голд- (познат по свом маслацном укусу и свестраности). -Црвени Блис- (често се користи у салатама и супама).",
  },
  {
    id: 3009,
    topic: "Садња",
    children: [
      {
        id: 3010,
        topic: "Време",
        text: "Кромпир се обично садњи у рано пролеће, око 2 до 4 недеље пре последњег очекиваног мраза.",
      },
      {
        id: 3011,
        topic: "Дубина и растојање",
        text: "Садите семенке кромпира на дубину од 10 до 15 цм (4 до 6 инча), са растојањем од 30 цм (12 инча) између биљака и 75 цм (30 инча) између редова.",
      },
      {
        id: 3012,
        topic: "Квота садње",
        text: "Препоручује се квота садње од приближно 2.500 до 3.500 кг по хектару (2.200 до 3.100 фунти по акру) за оптималан принос.",
      },
    ],
  },
  {
    id: 3013,
    topic: "Заливање",
    children: [
      {
        id: 3014,
        topic: "Природне падавине",
        text: "У регионима са довољним падавинама, кромпир се може гајити као биљка која зависи од падавина, али је константна влажност критична током формирања клубенки.",
      },
      {
        id: 3015,
        topic: "Заливање",
        text: "У сувљим регионима, можда ће бити потребно додатно заливање, посебно током критичних фаза раста.",
      },
      {
        id: 3016,
        topic: "Преливање водом",
        text: "Кромпир не подноси преливање водом. Осигурајте да су поља добро одводњена како бисте спречили труљење клубенки и болести.",
      },
    ],
  },
  {
    id: 3017,
    topic: "Ђубрење",
    children: [
      {
        id: 3018,
        topic: "Нутријенти",
        text: "Кромпир захтева азот, фосфор и калијум за здрав раст. Балансирано ђубрење је важно за добар принос и квалитет.",
      },
      {
        id: 3019,
        topic: "Време",
        text: "Ђубрива треба применити при садњи и са стране током раног раста за оптималан унос хранљивих материја.",
      },
    ],
  },
  {
    id: 3020,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 3021,
        topic: "Штеточине",
        text: "Уобичајени штеточини који утичу на кромпир укључују апсиде, Colorado potato beetles и жичане црве. Применом ротације усева и заједничким садњама може се помоћи у управљању популацијама штеточина.",
      },
      {
        id: 3022,
        topic: "Болести",
        text: "Кромпир је подложан болестима као што су касна пепељица, рана пепељица и краставац. Коришћењем отпорних сорти и пракси доброг хигијенског стања на пољу може се помоћи у управљању овим проблемима.",
      },
    ],
  },
  {
    id: 3023,
    topic: "Жетва",
    children: [
      {
        id: 3024,
        topic: "Време",
        text: "Кромпир се обично бере 70 до 120 дана после садње, у зависности од сорте и услова раста. Жетва се врши када лишће почне да увене.",
      },
      {
        id: 3025,
        topic: "Метод",
        text: "Кромпир се може убрати ручно или механичким откопавачима. Са клубенима се мора пажљиво руковати како би се избегло надувавање.",
      },
    ],
  },
  {
    id: 3026,
    topic: "Складиштење",
    text: "Убрани кромпир треба чувати на хладном, тамном и добро проветреном месту. Идеални услови за складиштење су температуре између 4°C и 10°C (39°F до 50°F).",
  },
  {
    id: 3027,
    topic: "Проређивање",
    text: "Проређивање обично није потребно за кромпир, јер се обично сади са довољним растојањем да омогући здрав раст.",
  },
],
},
{
    id: 14,
name: "Парадајз",
img: vegetablesImages.tomatoes,
inGeneralHeading: `Сочан и нутритивно богат плод`,
inGeneral: `Парадајз, научно класификован као Solanum lycopersicum, је популаран и свестран плод који се често користи у различитим кулинарским јелима. Познат по својој сочности и живој црвеној боји, парадајз се може конзумирати свеж у салатама, кувати у сосовима или печен да би се побољшао његов природни слатки укус.
                    Једна од најистакнутијих нутритивних користи парадајза је висок садржај ликопена, моћног антиоксиданса који је одговоран за његову црвену боју. Ликопен је повезан са различитим здравственим користима, укључујући смањење ризика од одређених ракова, посебно рака простате, и подршку здрављу срца смањењем нивоа холестерола и смањењем упале. Поред тога, парадајз је одличан извор витамина Ц који подржава имунолошки систем, здравље коже и производњу колагена. Такође пружа витамин К, који је неопходан за здравље костију, као и фолат, који подржава деобу ћелија и синтезу ДНК.
                    Парадајз је низак у калоријама и садржи добру количину дијеталних влакана, која помажу у варењу, регулишу нивое шећера у крви и промовишу осећај ситости. Комбинација витамина, минерала и антиоксиданата у парадајзу чини га вредним додатком уравнотеженој исхрани.
                    У кулинарском смислу, парадајз је изузетно свестран. Може се користити свеже у салатама, сендвичима и салсама, или кувати у сосовима, супама и чорбама. Такође се може сушити, пасирати или правити сок, додајући укус и хранљиве материје разним јелима.
                    Укратко, парадајз је сочан, нутритивно богат плод који нуди бројне здравствене користи. Његова свестраност и укусан укус чине га основним састојком у кухињама широм света, доприносећи и укусу и исхрани у безброј јела.`,
topic1: "Нутритивне вредности и здравље",
nutritionText: [
  {
    element: "Енергетска вредност:",
    quantity: 18,
    measurementUnits: "ккал",
    description:
      "– Низак у калоријама, чинећи га одличним додатком разним јелима.",
  },
  {
    element: "Масти:",
    quantity: 0.2,
    measurementUnits: "г",
    description:
      "– Веома низак садржај масти, што доприноси његовом здравом профилу.",
  },
  {
    element: "Засићене масне киселине:",
    quantity: 0.0,
    measurementUnits: "г",
    description:
      "– Садржи незначајне количине засићених масти, подржавајући здравље срца.",
  },
  {
    element: "Натријум:",
    quantity: 5,
    measurementUnits: "мг",
    description:
      "– Веома низак садржај натријума, користан за управљање крвним притиском.",
  },
  {
    element: "Калијум:",
    quantity: 237,
    measurementUnits: "мг",
    description:
      "– Добар извор калијума, који је неопходан за функцију мишића и равнотежу течности.",
  },
  {
    element: "Угљени хидрати:",
    quantity: 3.9,
    measurementUnits: "г",
    description: "– Садржи угљене хидрате који обезбеђују енергију.",
  },
  {
    element: "Влакна:",
    quantity: 1.2,
    measurementUnits: "г",
    description:
      "– Извор дијеталних влакана, која промовишу здраво варење.",
  },
  {
    element: "Шећер:",
    quantity: 2.6,
    measurementUnits: "г",
    description:
      "– Садржи природне шећере који доприносе његовом благом слатком укусу.",
  },
  {
    element: "Протеини:",
    quantity: 0.9,
    measurementUnits: "г",
    description: "– Обезбеђује малу количину биљних протеина.",
  },
  {
    element: "Витамин Ц:",
    quantity: 13.7,
    measurementUnits: "мг",
    description:
      "– Добар извор витамина Ц, важан за имунолошку функцију и здравље коже.",
  },
  {
    element: "Калцијум:",
    quantity: 18,
    measurementUnits: "мг",
    description:
      "– Обезбеђује малу количину калцијума, који доприноси здрављу костију.",
  },
  {
    element: "Гвожђе:",
    quantity: 0.5,
    measurementUnits: "мг",
    description:
      "– Садржи трагове гвожђа, неопходног за здраву производњу црвених крвних зрнаца.",
  },
  {
    element: "Магнезијум:",
    quantity: 11,
    measurementUnits: "мг",
    description:
      "– Обезбеђује малу количину магнезијума, који је важан за функцију мишића и нерва.",
  },
  {
    element: "Цинк:",
    quantity: 0.2,
    measurementUnits: "мг",
    description:
      "– Садржи трагове цинка, који подржава имунолошку функцију.",
  },
  {
    element: "Витамин А:",
    quantity: 833,
    measurementUnits: "IU",
    description:
      "– Богат бета-каротеном, који подржава здравље вида и имунолошки систем.",
  },
  {
    element: "Витамин Б1 (Тиамин):",
    quantity: 0.04,
    measurementUnits: "мг",
    description:
      "– Витамин Б1 је важан за метаболизам угљених хидрата и правилно функционисање нервног система.",
  },
  {
    element: "Витамин Б2 (Рибофлавин):",
    quantity: 0.02,
    measurementUnits: "мг",
    description:
      "– Витамин Б2 је важан за производњу енергије и одржавање здравља коже и очију.",
  },
  {
    element: "Витамин Б3 (Ниацин):",
    quantity: 0.6,
    measurementUnits: "мг",
    description:
      "– Витамин Б3 помаже у претварању угљених хидрата у енергију и одржава здравље коже.",
  },
  {
    element: "Витамин Б6:",
    quantity: 0.1,
    measurementUnits: "мг",
    description:
      "– Витамин Б6 је важан за метаболизам аминокиселина и производњу неуротрансмитера.",
  },
],
cultivationHeading:
  "Гајење парадајза захтева специфичне услове за оптималан раст и квалитет плода. Испод је преглед кључних фактора који утичу на гајење парадајза:",
cultivation: [
  {
    id: 5001,
    topic: "Клима",
    children: [
      {
        id: 5002,
        topic: "Температура",
        text: "Парадајз успева у топлим климатама. Идеалне температуре су између 20°C и 30°C (68°F до 86°F). Осетљиви су на мраз и треба их садити после последњег мраза.",
      },
      {
        id: 5003,
        topic: "Падавине",
        text: "Парадајз захтева константну влажност, обично око 500 до 800 мм (20 до 31 инча) падавина годишње. Адекватно наводњавање је од суштинске важности током развоја плода.",
      },
    ],
  },
  {
    id: 5004,
    topic: "Тло",
    children: [
      {
        id: 5005,
        topic: "pH",
        text: "Парадајз преферира благо кисело до неутрално тло са pH вредношћу од 6,0 до 7,0.",
      },
      {
        id: 5006,
        topic: "Тип тла",
        text: "Најбоље расте у добро дренираним, песковитим и органским тлима. Песковити лој је идеалан, јер омогућава добру дренажу и аерацију.",
      },
      {
        id: 5007,
        topic: "Припрема тла",
        text: "Пре садње, тло треба обрадити и обогатити компостом или добро распаднутом стајњаком како би се побољшала плодност и структура.",
      },
    ],
  },
  {
    id: 5008,
    topic: "Варитети",
    text: `Уобичајени варитети парадајза укључују:
            -Рома (популаран за сосеве и конзервирање).
            -Чери (мали, слатки и одлични за салате).
            -Бифстеак (велики и сочни, идеални за сендвиче).`,
  },
  {
    id: 5009,
    topic: "Садња",
    children: [
      {
        id: 5010,
        topic: "Време",
        text: "Парадајз се обично саде у касно пролеће након што прође опасност од мраза. У хладнијим регионима, почетак сетве унутар 6-8 недеља пре последњег мраза је уобичајен.",
      },
      {
        id: 5011,
        topic: "Дубина и растојање",
        text: "Саднице парадајза треба посадити на дубину од 5 до 7 цм (2 до 3 инча) дубље него што су биле у својим лонцима. Растојање између биљака треба бити 45 до 90 цм (18 до 36 инча), а растојање између редова 90 до 120 цм (36 до 48 инча).",
      },
      {
        id: 5012,
        topic: "Број семена",
        text: "Ако садите из семена, препоручује се број семена од 25 до 30 семена по метру (или 8 до 12 семена по стопи).",
      },
    ],
  },
  {
    id: 5013,
    topic: "Наводњавање",
    children: [
      {
        id: 5014,
        topic: "Културе са падавинама",
        text: "У подручјима са довољним падавинама, парадајз се може гајити као култура са падавинама, али константна влажност је кључна током цветања и развоја плода.",
      },
      {
        id: 5015,
        topic: "Културе са наводњавањем",
        text: "У сувљим регионима може бити потребно додатно наводњавање, посебно током врелих и сувих периода.",
      },
      {
        id: 5016,
        topic: "Преливање водом",
        text: "Парадајз не подноси услове са наводњавањем. Осигурајте да поља буду добро дренажна како би се избегло труљење корена и друге болести.",
      },
    ],
  },
  {
    id: 5017,
    topic: "Ђубрење",
    children: [
      {
        id: 5018,
        topic: "Нутријенти",
        text: "Парадајз захтева азот, фосфор и калијум за здрав раст. Уравнотежено ђубриво може промовисати енергичан раст и производњу плода.",
      },
      {
        id: 5019,
        topic: "Време",
        text: "Ђубрива треба применити при садњи и поново када се започне са формирањем првих плодова. Избегавајте преливање ђубривима, посебно са азотом, јер то може довести до прекомерног раста лишћа на штету плода.",
      },
    ],
  },
  {
    id: 5020,
    topic: "Контрола штеточина и болести",
    children: [
      {
        id: 5021,
        topic: "Штеточине",
        text: "Уобичајене штеточине које утичу на парадајз укључују афиде, беле мушице и паучне гриње. Примена интегрисаног управљања штеточинама (IPM) може помоћи у контроли популација штеточина.",
      },
      {
        id: 5022,
        topic: "Болести",
        text: "Парадајз је подложан болестима као што су пламен, трулеж краја цветова и трулеж корена. Користећи сорте отпорне на болести и практикујући ротацију усева, може се помоћи у управљању овим проблемима.",
      },
    ],
  },
  {
    id: 5023,
    topic: "Жетва",
    children: [
      {
        id: 5024,
        topic: "Време",
        text: "Парадајз је обично спреман за жетву 60 до 85 дана након садње, у зависности од сорте. Жетва се врши када су плодови чврсти и у потпуности обојени.",
      },
      {
        id: 5025,
        topic: "Метод",
        text: "Парадајз треба убирати пажљивим окретањем или резањем плода са стабљике. Руке треба бити пажљиве како би се избегло појављивање удубљења.",
      },
    ],
  },
  {
    id: 5026,
    topic: "Складиштење",
    text: "Бербовани парадајз треба чувати на собној температури, далеко од директне сунчеве светлости. Хлађење може утицати на њихов укус и текстуру.",
  },
  {
    id: 5027,
    topic: "Проређивање",
    text: "Проређивање није обично потребно за парадајз, јер су биљке већ размакнуте тако да омогуће здрав раст.",
  },
],
}
]

export default povrce;