export const ukrasneBiljkeTekst = [

        {
            "id": 1,
            "topic": "Украсне биљке",
            "text": "Украсне биљке или баштенске биљке су биљке које се пре свега гаје због своје лепоте, али и због својих квалитета као што су мирис или начин на који обликују физички простор. Многе цветне биљке и баштенске сорте су посебно узгајане култиваре који побољшавају оригиналне врсте у својствима као што су боја, облик, мирис и дуготрајни цветови. Постоји много примера лепих украсних биљака које могу пружити висину, приватност и лепоту за сваку башту. Ове трајнице имају семе које им омогућава да се размножавају. Једна од лепота украсних трава је та што су веома свестране и ниско одржаване. Скоро сви типови биљака имају украсне сорте: дрвеће, грмље, пужеви, траве, сочне биљке, водене биљке, травнате трајнице и годишње биљке. Неботаничке класификације укључују собне биљке, биљке за цветне леје, живе ограде, биљке за резано цвеће и биљке са лишћем. Узгој украсних биљака припада флористици и расадницима дрвећа, што је важан део хортикултуре. Често се украсне биљке гаје ради приказивања естетских карактеристика укључујући цветове, лишће, мирис, укупну текстуру лишћа, плодовe, стабљике и кору, као и естетски облик. У неким случајевима, необичне карактеристике као што су истакнути трњи на Рози серицеји и кактусима могу бити сматране као интересантне."
        },
        {
            "id": 2,
            "topic": "Историја",
            "text": "Узгој украсних биљака у баштованству започео је у старим цивилизацијама око 2000. године пре нове ере. Слике са гробова старог Египта из 1500. године пре нове ере показују физичке доказе о украсном вртовима и пејзажном дизајну. Богати фараони Амуна имали су много земље за узгој различитих врста украсних биљака."
        },
        {
            "id": 3,
            "topic": "Узгој",
            "text": "Украсне биљке и дрвећа се разликују од корисних и ратарских биљака, као што су оне које се користе за пољопривреду и повртарске усеве, као и за шумарство или као воћке. Ово не искључује могућност да нека биљка буде узгајана и као украсна у врту и као корисна у другим подешавањима. Тако је лаванда обично узгајана као украсна биљка у баштама, али се такође може узгајати као ратарска биљка за производњу уља од лаванде. Украсне биљке често су мета японског буба, познатог инсекта штеточине познатог по својим деструктивним навикама у храњењу. Са великом апетитом, јапански буба представља значајну претњу различитим врстама биљака, укључујући украсне цветове, воћке и пољопривредне културе. Његово неразумно храњење може довести до озбиљне штете на лишћу украсних биљака, што угрожава њихову естетску привлачност и укупно здравље. Ово широко признање утицаја јапанског буба наглашава важност ефективних стратегија за контролу штеточина у циљу заштите украсних башти и пејзажа од инфестације."
        },
        {
            "id": 4,
            "topic": "Термин",
            "text": "Термин украсна биљка користи се овде у истом смислу као што се обично користи у хортикултурним пословима, где се често називају једноставно 'украсне'. Овај термин углавном одговара 'баштенској биљци', иако је последњи термин много мање прецизан, јер се било која биљка може гајити у башти. Украсне биљке су биљке које се гаје ради приказивања, а не ради функционалне употребе. Иако неке биљке могу бити и украсне и функционалне, термин 'украсне биљке' обично се користи за биљке које немају вредност осим што су атрактивне, иако многи људи сматрају да је то довољна вредност. Украсне биљке су кључни део украсног вртовења, а долазе у различитим облицима, величинама и бојама погодним за широк спектар клима, пејзажа и потреба у баштама. Неке украсне биљке су биљке са лишћем које се гаје углавном или потпуно због свог упечатљивог лишћа; ово је посебно тачно за собне биљке. Њихово лишће може бити листопадно, окренуто у светле наранџасте, црвене и жуте тонове пре него што опадне у јесен, или зимзелено, када остаје зелено током целе године. Неке украсне биљке имају запањујући изглед створен лишћем као што су резбарени листови или дугачки иглице, док се друге гаје због специфичних боја лишћа, као што су сивкасто-сиве подлоге и светло црвене траве, међу многим другима."
        },
        {
            "id": 5,
            "topic": "Украсне траве",
            "text": "Украсне траве и биљке сличне травама су цењене у кућним пејзажима због своје отпорности, лакоће одржавања, драматичног изгледа и широке палете боја, текстура и величина. Многе украсне врсте трава су праве траве (Poaceae), међутим, неколико других породица биљака сличних травама обично се маркетирају као украсне траве. То укључује седге (Cyperaceae), трачеве (Juncaceae), рестије (Restionaceae) и патке (Typhaceae). Све су то монокотиледони, обично са уским листовима и паралелним жилама. Већина су травнате трајнице, иако су многе зимзелени и неке развијају дрвенаста ткива. Украсне траве су популарне у многим земљама. Оне доносе упечатљиву линеарну форму, текстуру, боју, кретање и звук у башту током целе године. Украсне траве су популарне у многим хладнијим зонама издржљивости због своје отпорности на хладне температуре и естетску вредност током јесени и зиме."
        }
    ]
    