export const sumeTekst = [
  {
    id: 1,
    topic: "Шуме",
    text: `Шума је екосистем који карактерише густа заједница дрвећа. Постоји стотине дефиниција шуме које се користе широм света, укључујући факторе као што су густина дрвећа, висина дрвећа, намена земљишта, правни статус и еколошка функција. Организација за храну и пољопривреду Уједињених нација (FAO) дефинише шуму као "земљиште површине веће од 0,5 хектара са дрвећем вишим од 5 метара и са покровом крошњи већим од 10 посто, или дрвећем које може достићи ове прагове на месту." Према овој дефиницији, у Глобалној процени шумских ресурса из 2020. године је утврђено да шуме покривају 4,06 милијарди хектара (10,0 милијарди ари; 40,6 милиона квадратних километара; 15,7 милиона квадратних миља), што чини отприлике 31 проценат копнене површине света 2020. године.
                Шуме су највећи копнени екосистеми на Земљи по површини и налазе се широм света. Четрдесет пет процената шумског земљишта је у тропским ширинама. Следећи највећи део шума налази се у субарктичким климатама, а затим у умереним и суптропским зонама.
                Шуме чине 75% бруто примарне продукције биосфере Земље и садрже 80% биомасе биљака на Земљи. Нето примарна продукција је процењена на 21,9 гигатона биомасе годишње за тропске шуме, 8,1 за умерене шуме и 2,6 за бореалне шуме.`  },
  {
    id: 2,
    topic: "Дефиниције",
    text: `Иако је реч шума често у употреби, не постоји универзално призната тачна дефиниција, са више од 800 дефиниција шуме које се користе широм света. Иако се шума обично дефинише присуством дрвећа, према многим дефиницијама, подручје које потпуно недостаје дрвеће и даље може да се сматра шумом ако је у прошлости имало дрвеће, ако ће га имати у будућности, или ако је правно одређено као шума без обзира на врсту вегетације.`
       },
  {
    id: 3,
    topic: "Етимологија",
    text: `Реч шума потиче од старофранцуске речи forest (такође forès), која означава „шуму, огромну површину покривену дрвећем“; forest је први пут уведена у енглески као реч која означава дивљу земљу одређену за лов, без обзира на то да ли је земљиште покривено дрвећем или не. Могуће је да је реч позајмљена, вероватно преко франкијског или старог високогерманског језика, од средњовековног латинског foresta, која означава „отворену шуму“, а Каролиншки писари су први пут користили foresta у капитуларима Карла Великог, посебно да означе краљевске ловне терене краља. Реч није ендемска у романским језицима, нпр. изворне речи за шуму у романским језицима потичу од латинске silva, која означава „шуму“ и „древну земљу“ (упор. енглеске речи sylva и sylvan; италијанску, шпанску и португалску selva; румунску silvă; старофранцуску selve). Речи сродне forest у романским језицима – нпр. италијанска foresta, шпанска и португалска floresta, итд. – све су у крајњем случају изведенице од француске речи.`
          },
  {
    id: 4,
    topic: "Екологија",
    text: `Шуме чине 75% бруто примарне продуктивности биосфере Земље и садрже 80% биомасе биљака на Земљи. Биомаса по јединици површине је велика у поређењу са другим заједницама вегетације. Велики део ове биомасе налази се под земљом у кореновим системима и као делимично разложен биљни детритус. Дрвени део шуме садржи лигнин, који је релативно спор у распадању у поређењу са другим органским материјалима као што су целулоза или угљени хидрати. Светске шуме садрже око 606 гигатона живе биомасе (изнад и испод земље) и 59 гигатона мртвог дрвета. Укупна биомаса се благо смањила од 1990. године, али се биомаса по јединици површине повећала.
            Еко-системи шума се углавном разликују у зависности од климе; географске ширине 10° северно и јужно од екватора углавном су покривене тропским кишним шумама, а ширине између 53°N и 67°N имају бореалне шуме. Уопштено, шуме којима доминирају скривеносеменице (шуме широког лишћа) су богатије врстама од оних у којима доминирају голосеменице (четинарске, планинске или шуме игличастог лишћа), иако постоје изузеци. Дрвеће које чини главни структурни и дефинишући елемент шуме може бити великог броја врста (као у тропским кишним шумама и умереним листопадним шумама), или релативно мало врста на великим површинама (нпр. тајга и аридне планинске четинарске шуме). Биодиверзитет шума такође обухвата жбуње, зељасте биљке, маховину, папрат, лишајеве, гљиве и разне животињске врсте.`
          },
  {
    id: 5,
    topic: "Слојеви",
    text: `Главни слојеви свих типова шума су шумско тло, подрастај и крошња. Издигнути слој, изнад крошње, постоји у тропским кишним шумама. Сваки слој има различите биљке и животиње, у зависности од доступности сунчеве светлости, влаге и хране.
                Шумско тло је покривено мртвим биљним материјалом као што су опало лишће и трулежни трупци, које детритивори разлажу у ново тло. Слој распаднутог лишћа који покрива тло неопходан је за многе инсекте да презиме и за водоземце, птице и друге животиње да се склоне и траже храну. Лишћe такође одржава влажност тла, спречава ерозију и штити корење од екстремне топлоте и хладноће. Гљивични мицелијум који помаже формирању микоризног мрежа преноси хранљиве материје из распаднутог материјала у дрвеће и друге биљке. Шумско тло подржава различите биљке, папрати, траве и младе саднице, као и животиње као што су мрави, водоземци, пауци и многоножци.
                Подрастај се састоји од жбунова, грмља и младог дрвећа који су прилагођени животу у сенци крошње.`
              },
  {
        id: 6,
        topic: 'Типови',
        text: `Шуме се класификују различито и са различитим степеном специфичности. Једна од таквих класификација је према биомима у којима постоје, у комбинацији са дужином трајања листа доминантних врста (да ли су зимзелене или листопадне). Друга разлика је да ли су шуме углавном састављене од широколисног дрвећа, четинара (дрвећа са игличастим лишћем) или мешовитог дрвећа.
                Бореалне шуме заузимају субарктичку зону и углавном су зимзелене и састављене од четинара.
                У умереним зонама постоје широколисне листопадне шуме (нпр. умерена листопадна шума) и зимзелене четинарске шуме (нпр. умерене четинарске шуме и умерене кишне шуме). Топле умерене зоне подржавају широколисне зимзелене шуме, укључујући ловорове шуме.`,
                        children: [
            {
                id: 601,
                topic: 'Умерене четинарске',
                text: `Умерене четинарске шуме углавном заузимају више географске ширине северне хемисфере, као и неке топлије умерене пределе, посебно на хранљиво сиромашним или на други начин неповољним земљиштима. Ове шуме су у потпуности, или готово у потпуности, састављене од четинара (Coniferophyta). У северној хемисфери, крошњу чине борови (Pinus), смрче (Picea), аришеви (Larix), јеле (Abies), Даглас јеле (Pseudotsuga), и цуга (Tsuga); али су и други таксони важни. У јужној хемисфери, већина четинарских дрвећа (чланови породице Araucariaceae и Podocarpaceae) јавља се помешана са широколисним врстама и класификована је као широколисне и мешовите шуме.`
            },
            {
                id: 602,
                topic: 'Умерене широколисне и мешовите',
                text: `Умерене широколисне и мешовите шуме укључују значајну компоненту дрвећа из групе Anthophyta. Углавном су карактеристичне за топлије умерене ширине, али се простиру и у хладне умерене, посебно у јужној хемисфери. Оне укључују шуме као што су мешовите листопадне шуме Сједињених Држава и њихови пандани у Кини и Јапану; зимзелене кишне шуме Јапана, Чилеа и Тасманије; склерофилне шуме Аустралије, централног Чилеа, Медитерана и Калифорније; и шуме јужне букве (Nothofagus) Чилеа и Новог Зеланда.`
            },
            {
                id: 603,
                topic: 'Тропске влажне',
                text: `Постоје многи различити типови тропских влажних шума, са низијским зимзеленим широколисним тропским кишним шумама: на пример варзеа и игапо шуме и терра фирме шуме у Амазонском басену; шуме тресетишта; диптерокарпске шуме југоисточне Азије; и високе шуме у Конго басену. Сезонске тропске шуме, можда најбољи опис за колоквијални термин "џунгла", обично се простиру од зоне кишних шума 10 степени северно или јужно од екватора до Тропика Рака и Тропика Јарца. Шуме на планинама такође су укључене у ову категорију, подељене углавном на горње и доње планинске формације, на основу промене физиономије у складу са надморском висином.`
            },
            {
                id: 604,
                topic: 'Тропске суве',
                text: `Тропске суве шуме карактеристичне су за подручја у тропима погођена сезонским сушама. Сезоналност падавина обично се одражава у листопадности крошње шуме, где је већина дрвећа без лишћа неколико месеци годишње. У одређеним условима, као што су мање плодна земљишта или мање предвидљиви режими суша, проценат зимзелених врста се повећава, и шуме се карактеришу као "склерофилне". Трновите шуме, густе шуме ниског раста са високим учесталостима бодљикавих или бодљастих врста, налазе се тамо где суша траје дуже, а нарочито где су бројне животиње које пасу. На веома сиромашним земљиштима, и нарочито тамо где су пожар или биљоједи чести феномени, развијају се саване.`
            },
            {
                id: 605,
                topic: 'Ретко дрвеће и савана',
                text: `Шуме са ретким дрвећем и саване су шуме са ретким покривачем дрвећа. Углавном се јављају у областима прелаза између шумовитих и не-шумовитих предела. Два главна појаса у којима се ови екосистеми јављају су у бореалном региону и у сезонски сувим тропима. На високим географским ширинама, северно од главне зоне бореалних шума, услови раста нису довољни за одржавање континуираног затвореног шумског покривача, тако да је покривач дрвећа редак и дисконтинуиран. Ова вегетација се различито назива отворена тајга, отворена лишајна шума и шумска тундра. Савана је екосистем мешовитог шумског и травнатог подручја где су стабла довољно широко распоређена тако да крошња не затвара. Отворена крошња омогућава довољно светлости да дође до земље, подржавајући непрекинути слој трава. Саване одржавају отворену крошњу упркос високој густини дрвећа.`
            },
            {
                id: 606,
                topic: 'Плантаже',
                text: `Шумске плантаже углавном су намењене за производњу дрвета и дрвене пулпе. Углавном моноспецифичне, са равномерним размаком између стабала и интензивно управљане, ове шуме су важне као станиште за аутохтону биолошку разноликост. Неке се управљају на начин који повећава њихову функцију заштите биолошке разноликости и могу пружати екосистемске услуге као што су одржавање хранљивих материја, заштита речних сливова и структуре земљишта и складиштење угљеника.`
            }
        ]
    },
    {
        id: 7,
        topic: 'Површина',
        text: `Годишњи нето губитак шумске површине се смањио од 1990. године, али свет није на правом путу да испуни циљ Стратешког плана Уједињених нација за шуме, који подразумева повећање шумске површине за 3 процента до 2030. године.
                Удео шумске површине у укупној површини земљишта, водеће земље (2021).
                Иако се крчење шума дешава у неким областима, нове шуме се успостављају путем природног ширења или намерним напорима у другим областима. Као резултат тога, нето губитак шумске површине је мањи од стопе крчења шума и такође се смањује: са 7,8 милиона хектара (19 милиона акри) годишње током 1990-их на 4,7 милиона хектара (12 милиона акри) годишње током периода 2010–2020. године. У апсолутним бројевима, глобална шумска површина је смањена за 178 милиона хектара (440 милиона акри; 1.780.000 квадратних километара; 690.000 квадратних миља) између 1990. и 2020. године, што је подручје отприлике величине Либије.`
    }
    
    
];
